{
  "0": {
    "paragraph": "కాకతీయులు చరిత్ర పరికరాల పెట్టె స్వరూపం దాచు పాఠ్యం చిన్న ప్రామాణిక పెద్ద వెడల్పు ప్రామాణిక వెడల్పుగా రంగు ఆటోమాటిగ్గా ప్రకాశవంతంగా చీకటిగా కాకతీయ సామ్రాజ్యం స్థాయి సామ్రాజ్యం రాజధాని ఓరుగల్లు వరంగల్లు సామాన్య భాషలు తెలుగు మతం హిందూ మతం జైన మతం నుండి రూపాంతరం చెందింది. ప్రభుత్వం రాజరికము చక్రవర్తి చరిత్ర స్థాపన పతనం దస్త్రం పశ్చిమ చాళుక్యులు తూర్పు చాళుక్యులు దక్కను సుల్తానులు విజయనగర సామ్రాజ్యము ముసునూరి నాయకులు కాకతీయ సామ్రాజ్యం ఆంధ్ర ప్రదేశ్ చరిత్రలో ఒక భాగం కాకతీయ పాలకులు కాకతి వెన్నయ మొదటి గుండయ రెండవ గుండయ మూడవ గుండయ ఎఱ్ఱయ మొదటి బేతరాజు నాల్గవ గుండయ గరుడ బేతరాజు మొదటి ప్రోలరాజు రెండవ బేతరాజు దుర్గరాజు రెండవ ప్రోలరాజు గణపతి దేవుడు రుద్రమ దేవి ప్రతాపరుద్రుడు రాణి ఇతరులు మాలిక్ మక్బూల్ నిర్మాణాలు వరంగల్ ఖిల్లా వేయి స్తంభాల గుడి రామప్ప దేవాలయం మార్చు కాకతీయులు క్రీ. శ. నుండి క్రీ.",
    "kingdoms": [
      "Vijayanagara",
      "Kakatiya"
    ],
    "confidence": 0.026481715006305175,
    "all_scores": {
      "Vijayanagara": 0.026481715006305175,
      "Kakatiya": 0.024590163934426233
    }
  },
  "2": {
    "paragraph": "శ. వ శతాబ్దము ప్రాంతములో రాష్ట్రకూటుల సేనానులుగా రాజకీయ జీవితాన్ని ించిన కాకతీయులు ఘనమైన పరిపాలనను అందించారు. శాతవాహనుల అనంతరం తెలుగు జాతిని సమైక్యం చేసి ఏకచ్ఛత్రాధిపత్యం క్రిందికి తెచ్చిన హైందవ యాదవ రాజ వంశంలో కాకతీయులొకరూ.. కాకతీయులు యాదవ వంశస్థులుగా కొందరు చరిత్రకారులు అభిప్రాయపడుతున్నారు.",
    "kingdoms": [
      "Rashtrakuta",
      "Satavahana",
      "Kakatiya"
    ],
    "confidence": 0.10238907849829351,
    "all_scores": {
      "Rashtrakuta": 0.10238907849829351,
      "Satavahana": 0.07167235494880547,
      "Kakatiya": 0.06313993174061433
    }
  },
  "3": {
    "paragraph": "ప్రస్తుత తెలంగాణ అనే పదం కాకతీయుల కాలంలో త్రిలింగ అని దేశపరంగా జాతిపరంగా ప్రచారం పొందింది మూలం అవసరం . వీరి రాజధాని ఓరుగల్లు నేటి వరంగల్లు . పూర్వ రంగం నేటి తెలంగాణ ప్రాంతంలో కాకతీయుల రాజ్యానికి అంకురార్పణ జరుగుతున్నపుడు మూలం అవసరం తీరాంధ్రంలో వేంగి చాళుక్య చోళుల ప్రభావం క్షీణదశలో ఉంది. ంలో తూర్పు చాళుక్యులు పశ్చిమ బాదామి చాళుక్యులకు సోదర సమానులు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.05730659025787966,
    "all_scores": {
      "Kakatiya": 0.05730659025787966,
      "Chalukya": 0.02363896848137536,
      "Chola": 0.017191977077363897
    }
  },
  "4": {
    "paragraph": "కాని క్రమంగా దక్షిణాపథం నుండి విస్తరిస్తున్న చోళులు తీరాంధ్రాన్ని తమ అధీనంలోకి తెచ్చుకోవడానికి తూర్పు చాళుక్యులతో సంబంధాలు కలుపుకొన్నారు. ఆలా క్రీ. శ. నుండి తీరాంధ్రంలో చాళుక్య చోళ యుగం మై క్రీ.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.03865979381443299,
    "all_scores": {
      "Chola": 0.03865979381443299
    }
  },
  "5": {
    "paragraph": "శ. వరకు సాగింది. వారికి సత్యదేవుని నాయకత్వంలోని పశ్చిమ చాళుక్యులకు తరచు యుద్ధాలు జరిగాయి. దక్షిణ తీరాంధ్రంలో శతాబ్దాలలో వెలనాటి చోడులు గుంటూరు జిల్లా ప్రాంతంలో చోళులకు సామంతులుగా ఉంటూ పశ్చిమ చాళుక్యులను ఎదుర్కొన్నారు.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.027649769585253458,
    "all_scores": {
      "Chola": 0.027649769585253458
    }
  },
  "6": {
    "paragraph": "క్రీ. శ. లో వేంగిలో జరిగిన యుద్ధంలో గొంకయ అనే వెలనాటి చోళ నాయకుని సైన్యం చేత పశ్చిమ చాళుక్యులు తీవ్రంగా పరాజితులై ఆంధ్ర ప్రాంతంనుండి పూర్తిగా వైదొలగారు. తరువాత వెలనాటి చోళులు దక్షిణ తీరాంధ్రంలో దాదాపు స్వతంత్రులుగా పాలించారు.",
    "kingdoms": [
      "Chalukya",
      "Chola"
    ],
    "confidence": 0.06666666666666667,
    "all_scores": {
      "Chalukya": 0.06666666666666667,
      "Chola": 0.03333333333333333
    }
  },
  "7": {
    "paragraph": "తరువాత ఈ ప్రాంతాన్ని అంచెలంచెలుగా కొణిదెన చోళులు నెల్లూరు చోడులు పాలించారు. కడప ప్రాంతాన్ని రేనాటి చోళులు కోనసీమను హైహయ రాజులు నిడదవోలును వేంగి చాళుక్య చోళులు కొల్లేరు ప్రాంతాన్ని తెలుగు నాయకులు విజయవాడను చాగివారు ధరణికోటను కోటవారు కొండవీడు వెలనాటి దుర్జయ చోడులు పల్నాటిని హైహయ వంశపు రాజులు పాలిస్తుండేవారు. ఈ చిన్న చిన్న రాజ్యాల మధ్య తగాదాలు వైషమ్యాలు సర్వ సాధారణం. క్రీ.",
    "kingdoms": [
      "Chalukya",
      "Chola"
    ],
    "confidence": 0.020161290322580645,
    "all_scores": {
      "Chalukya": 0.020161290322580645,
      "Chola": 0.020161290322580645
    }
  },
  "9": {
    "paragraph": "సమాజం కకావికలయ్యింది. బలం కలిగిన పాలకులు లేకపోతే జరిగే కష్టం ప్రజలకు అవగతమయ్యింది. అరాచకాన్ని అంతం చేసే ప్రభువులకు అది అదనైన సమయం. ఈ పరిస్థితిలో ఓరుగల్లు కాకతీయులకు రాజులందరినీ ఓడించడం అంత కష్టం కాలేదు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.07425742574257425,
    "all_scores": {
      "Kakatiya": 0.07425742574257425
    }
  },
  "10": {
    "paragraph": "ఆంధ్ర దేశాన్ని తమ పాలనలో ఐక్యం చేసే అవకాశం వారికి లభించింది. ప్రస్తుత తెలంగాణా మూలం అవసరం ప్రాంతం ఆ సమయంలో స్వతంత్ర రాజుల పాలనలో లేదు. కొన్ని భాగాలు పశ్చిమ చాళుక్యుల అధీనంలోను కొన్ని భాగాలు రాష్ట్రకూటుల అధీనంలోను కొన్ని భాగాలు వేంగి చాళుక్యుల అధీనంలోను ఉన్న సామంతరాజుల పాలనలో ఉండేవి. ముఖ్యంగా వేంగి చాళుక్యులకు రాష్ట్రకూటులకు మధ్య ఎడ తెరపి లేకుండా అనేక యుద్ధాలు జరిగాయి.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.08108108108108109,
    "all_scores": {
      "Rashtrakuta": 0.08108108108108109,
      "Chalukya": 0.02027027027027027
    }
  },
  "12": {
    "paragraph": "మధ్య కాలంలో కాకతీయుల పూర్వీకులు రాష్ట్రకూటులకు లేదా పశ్చిమ చాళుక్యులకు లేదా తూర్పు చాళుక్యులకు దశలను బట్టి సామంతులుగా ఉద్యోగులుగా ఉండేవారు. క్రీ. శ. మధ్య నందిగామ ముక్త్యాల మాంగల్లు మధిర మానుకోటలను పాలించిన కాకత్య గుండన రాష్ట్రకూటులకు వంశం అని హైహయ దుర్జయ వంశం అని శాసనాలు దొరికాయి.",
    "kingdoms": [
      "Rashtrakuta",
      "Kakatiya"
    ],
    "confidence": 0.10676156583629895,
    "all_scores": {
      "Rashtrakuta": 0.10676156583629895,
      "Kakatiya": 0.07473309608540926
    }
  },
  "13": {
    "paragraph": "రాష్ట్రకూటులకు వేంగి రాజులకు మధ్య జరిగిన యుద్ధాలలో ప్రశంసనీయమైన పాత్ర వహించి తన ప్రభువు ప్రోత్సాహంతో రాజ్యాన్ని ఏర్పరచుకొన్నాడు. అతని వంశస్థులు ప్రోలరాజు బేతరాజు రెండవ ప్రోలరాజు క్రమంగా తెలంగాణా ప్రాంతంలో పశ్చిమ చాళుక్యుల పాలనను అంతమొందించ గలిగారు. తరువాత కాకతీయుల పాలన తెలంగాణ ప్రాంతానికి విస్తరించింది విస్తరించింది. రాష్ట్రకూటులకు వేంగి రాజులకు మధ్య జరిగిన యుద్ధాలలో ప్రశంసనీయమైన పాత్ర వహించి తన ప్రభువు ప్రోత్సాహంతో రాజ్యాన్ని ఏర్పరచుకొన్నాడు.",
    "kingdoms": [
      "Rashtrakuta",
      "Kakatiya"
    ],
    "confidence": 0.06711409395973154,
    "all_scores": {
      "Rashtrakuta": 0.06711409395973154,
      "Kakatiya": 0.039149888143176735,
      "Chalukya": 0.016778523489932886
    }
  },
  "14": {
    "paragraph": "అతని వంశస్థులు ప్రోలరాజు బేతరాజు రెండవ ప్రోలరాజు క్రమంగా తెలంగాణా మూలం అవసరం ప్రాంతంలో పశ్చిమ చాళుక్యుల పాలనను అంతమొందించ గలిగారు. తరువాత కాకతీయుల పాలన తెలంగాణ ప్రాంతానికి విస్తరించింది. కాకతీయుల పుట్టుపూర్వోత్తరాలు శాసనాధారాలను బట్టి కాకతీయుల కులదేవత కాకతి అనీ మొదట వారు కాకతి ఆరాధకులు కాబట్టి కాకతీయులయ్యారనీ ఆ తర్వాత స్వయంభూదేవుని ఆరాధకులయ్యారనీ చారిత్రక సమాచారం ఉంది. కాజీపేట శాసనాన్ని బట్టి వీరు గుమ్మడమ్మ సంప్రదాయానికి తీగకు చెందిన వారని తెలుస్తోంది.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.03837719298245614,
    "all_scores": {
      "Kakatiya": 0.03837719298245614
    }
  },
  "15": {
    "paragraph": "జైన దేవత గుమ్మడమ్మ కుషాండిని కి మరోపేరు కాకతి. ఈమె జీవుల్ని అనారోగ్యం నుండి కాపాడే జైన ఆరోగ్య దేవత. కాకతీయులు తమను తాము దుర్జయుల మని చెప్పుకున్నారు. అంటే హైహయ వంశం వారు అని అర్థం.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.10335195530726256,
    "all_scores": {
      "Kakatiya": 0.10335195530726256
    }
  },
  "17": {
    "paragraph": "అయితే ఆ గ్రామం లేదా పట్టణం ఎక్కడ ఉందో గుర్తించటం ఇప్పుడు కష్టంగా ఉంది. మూలం అవసరం కాకతీయుల కులము గురించి చరిత్రకారుల్లో భిన్నాభిప్రాయమున్నవి. కొన్ని శాసనాల్లో సూర్యవంశ క్షత్రియులని మరి కొన్ని పుస్తకాల్లో తెలుగు నాయక వంశాల మాదిరి దుర్జయ వంశము వారని చెప్పబడ్డారు. హైహయ వంశం దుర్జయులే కాకతీయ రాజుల శాసనాలలో వీరు అని కొమ్మజనులు అని వర్ణించబడింది.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.06140350877192982,
    "all_scores": {
      "Kakatiya": 0.06140350877192982
    }
  },
  "19": {
    "paragraph": "కాకతీయులు సూర్యవంశపు క్షత్రియులని తెలుపుచున్నది. కర్నూలు జిల్లా త్రిపురాంతకంలో ఉన్న త్రిపురాంతకేశ్వర ఆలయంలో చెక్కబడిన శిలాశాసనం . . .",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.13909774436090225,
    "all_scores": {
      "Kakatiya": 0.13909774436090225
    }
  },
  "20": {
    "paragraph": ". ప్రకారం గణపతిదేవుడు సూర్యవంశ క్షత్రియుడని తెలుపుచున్నది. రుద్రమ దేవి భర్త వీరభద్రుడు కాస్యప గోత్రీకుడు కావున తర్వాత కాలంలో కాకతీయులు కాస్యపగోత్రపు క్షత్రియులుగా చెప్పుకున్నారని చరిత్రకారుల భావన. చిలుకూరి వీరభద్రరావు తన ఆంధ్ర చరిత్రలో వడ్డమాని శాసనం బూదవూరు శాసనం త్రిపురాంతక శాసనం ఆధారంగా చేసుకొని కాకతీయులు అని తేల్చారు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.055727554179566555,
    "all_scores": {
      "Kakatiya": 0.055727554179566555
    }
  },
  "21": {
    "paragraph": "చేబ్రోలు శాసనం ప్రకారం గణపతిదేవుడు మున్నూరు సీమ కృష్ణా జిల్లా ప్రాంతంలోని దూర్జయ తెగకు చెందిన జాయప నాయుడి జాయప్ప సేనాని సోదరీమణులైన కమ్మ నారమ్మ పేరమ్మలను వివాహమాడాడు. వీరి కుమార్తెలు రుద్రమదేవి గణపాంబ . గణపతిదేవుడు తన పెద్ద కుమార్తె రుద్రమదేవిని చాళుక్య వంశీయుడైన వీరభద్రుడు కిచ్చి వివాహం చేశాడు. రెండవ కుమార్తె గణపాంబ కోట సామ్రాజ్యమునకు చెందిన బేతరాజు కిచ్చి వివాహం చేశాడు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.05080213903743316,
    "all_scores": {
      "Kakatiya": 0.05080213903743316
    }
  },
  "22": {
    "paragraph": "కాకతీయుల అచ్చతెలుగు పేర్లు కాకతీయులు గరుడాంక చిహ్నం కలిగిన రాష్ట్రకూటులు కాబట్టి వారు రాష్ట్రకూట వంశస్థులని మహారాష్ట్ర ప్రాంతం నుండి త్రిలింగదేశానికి వలన వచ్చిన వారని గుండయ ఎరియల పేర్ల ఉన్న రాష్ట్రకూట శబ్ధమే ఇందుకు తార్కాణమని కొందరు అభివూపాయపడ్డారు. శాసనాలు దొరికాయి .చాళుక్య శాసనాల్లోనూ ఉంది. రాష్ట్రకూటుల వద్ద సైనిక వృత్తిలో ఉన్నమాట వాస్తవమే కానీ రాష్ట్ర కూటుల ఆక్రమిత ప్రాంతాలైన ఆంధ్రదేశంలోనే వారున్నారు పైగా వారి పేర్లన్నీ గుండయ పేరు దానికి సంబంధించిందే. బేతరాజు పేరు పోతరాజు నుండి వచ్చిందే.",
    "kingdoms": [
      "Rashtrakuta",
      "Kakatiya"
    ],
    "confidence": 0.05,
    "all_scores": {
      "Rashtrakuta": 0.05,
      "Kakatiya": 0.03333333333333333
    }
  },
  "24": {
    "paragraph": "బ వ య్యలమ్మ ల తల్లి మైలమ భూదేవి కుందమ్మ వ్వ మేడలమ్మ రుయ్యమ్మ ముమ్మడమ్మ ముగ్గురమ్మల మూలపుటమ్మ ముప్పమ మొదలైన కాకతీయ కుటుంబీకుల పేర్లు అచ్చ తెలుగు పదాలతో కూడినవి. రుద్రదేవునితోనే సంస్కృత పేర్లతో కాకతీయ ప్రభువులు కనిపిస్తారు మూడు దశలు గుంటుపల్లి కామవరపుకోట వద్ద ఉన్న బౌద్ధ స్తూపాలు ఆంధ్ర ప్రదేశ్ చరిత్ర కాలరేఖ చరిత్ర పూర్వ యుగము క్రీ.పూ. వరకు పూర్వ యుగము క్రీ.పూ. క్రీ.శ.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.049046321525885554,
    "all_scores": {
      "Kakatiya": 0.049046321525885554
    }
  },
  "26": {
    "paragraph": "శాతవాహనులు క్రీ.పూ. క్రీ.త. కళింగులు క్రీ.పూ. ?",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.3829787234042553,
    "all_scores": {
      "Satavahana": 0.3829787234042553
    }
  },
  "27": {
    "paragraph": "క్రీ.త. ? ఇక్ష్వాకులు బృహత్పలాయనులు ఆనంద గోత్రీకులు శాలంకాయనులు విష్ణుకుండినులు పల్లవులు పూర్వమధ్య యుగము మహాపల్లవులు రేనాటి చోడులు చాళుక్యులు రాష్ట్రకూటులు తూర్పు చాళుక్యులు పూర్వగాంగులు చాళుక్య చోళులు కాకతీయులు అర్వాచీన గాంగులు ఉత్తరమధ్య యుగము ముసునూరి నాయకులు ఓఢ్ర గజపతులు రేచెర్ల పద్మనాయకులు కొండవీటి రెడ్డి రాజులు రాజమహేంద్రవరం రెడ్డి రాజులు బహమనీ రాజ్యము విజయనగర సామ్రాజ్యము ఆధునిక యుగము అరవీటి వంశము పెమ్మసాని నాయకులు కుతుబ్ షాహీ యుగము నిజాము రాజ్యము బ్రిటిషు రాజ్యము స్వాతంత్ర్యోద్యమము ఆంధ్ర రాష్ట్రం ఏర్పాటు హైదరాబాదు రాష్ట్రం ఏర్పాటు ఆంధ్ర ప్రదేశ్ అవతరణ ఏకీకృత ఆంధ్ర ప్రదేశ్ చరిత్ర ఆంధ్ర ప్రదేశ్ చరిత్ర తెలుగు సాహిత్యం నన్నయకు ముందు నన్నయ యుగము శివకవి యుగము తిక్కన యుగము ఎఱ్ఱన యుగము శ్రీనాథ యుగము రాయల యుగము దాక్షిణాత్య యుగము క్షీణ యుగము ఆధునిక యుగము వ శతాబ్ది చారిత్రక నగరాలు పిఠాపురం భట్టిప్రోలు వేంగి ధాన్యకటకము కొలనుపాక ఓరుగల్లు విజయపురి రాజమహేంద్రవరం కళింగపట్నం హంపి సింహపురి హైదరాబాదు చారిత్రక వ్యక్తులు గణపతిదేవుడు రుద్రమదేవి కృష్ణదేవరాయలు శాలివాహనుడు కాకతీయ సామ్రాజ్యంలో మూడు ముఖ్యమైన ఘట్టాలున్నాయి. క్రీ.",
    "kingdoms": [
      "Rashtrakuta",
      "Kakatiya",
      "Vijayanagara"
    ],
    "confidence": 0.024217221135029353,
    "all_scores": {
      "Rashtrakuta": 0.024217221135029353,
      "Kakatiya": 0.017025440313111546,
      "Vijayanagara": 0.015166340508806261,
      "Satavahana": 0.011741682974559686,
      "Chalukya": 0.007338551859099804,
      "Chola": 0.007338551859099804
    }
  },
  "28": {
    "paragraph": "శ. తెలంగాణ విమోచన మూలం అవసరం ఈ దశలో నలుగురు రాజులు పాలించారు కాకత్య గుండన మొదటి ప్రోలరాజు రెండవ బేతరాజు రెండవ ప్రోలరాజు ఈ సమయంలో తెలంగాణ ప్రాంతం కాకతీయుల వశమయ్యింది. తెలుగునాట పశ్చిమ చాళుక్యుల పాలన అంతమయ్యింది. ముఖ్యంగా రెండవ ప్రోలరాజు పెద్ద రాజ్యాలకు ప్రతినిధులైన నలుగురు సామంతులను ఓడించి ఈ నిజయం సాధించాడు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.056818181818181816,
    "all_scores": {
      "Kakatiya": 0.056818181818181816
    }
  },
  "29": {
    "paragraph": "అంతకు ముందు తీరాంధ్రంలో మాత్రమే స్వతంత్ర రాజ్యాలున్నాయి. కన్నడ ప్రాంతపు చాళుక్యులు మహారాష్ట్రము నుండి రాష్ట్రకూటులు తీరాంధ్రంపై జరిగిన దండయాత్రలకు తెలంగాణా మార్గంగా ఉంది. కనుక తెలంగాణ ప్రాంతంలో ఆర్థిక సాంస్కృతిక ప్రగతి కుంటువడింది. ప్రజలలో పుట్టి కష్టసుఖాలెరిగిన కాకతీయులు సాధించిన స్వాతంత్ర్యముతో తెలంగాణ ప్రాంతంలో వ్యవసాయం సాహిత్యం వ్యాపారం ఊపందుకొన్నాయి.",
    "kingdoms": [
      "Rashtrakuta",
      "Kakatiya"
    ],
    "confidence": 0.06932773109243698,
    "all_scores": {
      "Rashtrakuta": 0.06932773109243698,
      "Kakatiya": 0.05182072829131653
    }
  },
  "30": {
    "paragraph": "ఇప్పటికీ కాకతీయులు త్రవ్వించిన చెరువులే చాలా మండలాలలో ముఖ్య నీటివనరులు. క్రీ. శ. తీరాంధ్రంలో విజయం ఈ దశలో కాకతీయులు ఉత్తరాన గంజాం నుండి దక్షిణాన కంచి వరకు జయించారు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.11280487804878049,
    "all_scores": {
      "Kakatiya": 0.11280487804878049
    }
  },
  "31": {
    "paragraph": "రాయలసీమ తెలంగాణ తీరాంధ్ర ప్రాంతాలు ఒకే పాలనలోకి వచ్చాయి. ఈ దశలో ముగ్గురు పాలకులున్నారు. వారిలో గణపతి దేవుడు ప్రసిద్ధుడు. ఈ కాలంలో అన్ని ప్రాంతాల వారి మధ్య సంబంధ బాంధవ్యాలు పెరిగాయి.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.09944751381215469,
    "all_scores": {
      "Kakatiya": 0.09944751381215469
    }
  },
  "32": {
    "paragraph": "ఖ్రీ. శ. సామ్రాజ్య పతనం ఈ సమయంలో రుద్రమదేవి ప్రతాపరుద్రుడు పాలించారు. ఇద్దరూ సమర్థులైన ప్రభువులు యుద్ధ కోవిదులు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.20535714285714288,
    "all_scores": {
      "Kakatiya": 0.20535714285714288
    }
  },
  "33": {
    "paragraph": "కాని ఉప్పెనలా ముంచుకొచ్చిన ముస్లిం దండయాత్రల కారణంగా కాకతీయ సామ్రాజ్యం పతనాన్ని ఆపలేకపోయారు. వివిధ కులాల మధ్య కలహాలు ఈ పతనానికి మరింత తోడ్పడ్డాయి. కాకతీయ సామ్రాజ్య క్రమం ఆరంభ దశ క్రీ. శ.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.0967741935483871,
    "all_scores": {
      "Kakatiya": 0.0967741935483871
    }
  },
  "34": {
    "paragraph": "మధ్యకాలంలో గుండయ రాష్ట్రకూటుల ప్రతినిధి సామంత రాజు గా మధిర మానుకోట తాలూకాలను పాలించేవాడు. అది రాష్ట్రకూట రాజయిన రెండవ కృష్ణునకు వేంగి రాజు మొదటి చాళుక్య భీమునకు యుద్ధాలు జరుగుతున్న సమయం. అనంతరం పెరువంగూరు యుద్ధంలో గుండయ మరణించాడు. బెజవాడను పట్టుకోవడంలో గుండన చూపిన సాహసానికి కృతజ్ఞతాపూర్వకముగా రెండవ కృష్ణుడు గుండయ కుమారుడు ఎరియను ఓరుగల్లు దగ్గరలోని కురవాడికి అధిపతిగా చేశాడు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.0797872340425532,
    "all_scores": {
      "Rashtrakuta": 0.0797872340425532,
      "Satavahana": 0.031914893617021274,
      "Chalukya": 0.0199468085106383
    }
  },
  "37": {
    "paragraph": "ముందు రాష్ట్రకూటుల సామంతులుగా ఉన్న కాకతీయులు ఇలా విరియాల వారి సౌహార్ద్రత్వంతో చాళుక్యుల సామంతులుగా ఓరుగల్లులో నెలకొన్నారు. బేతన క్రీ. శ. వరకు రాజ్యం చేశాడు.",
    "kingdoms": [
      "Rashtrakuta",
      "Kakatiya"
    ],
    "confidence": 0.1923076923076923,
    "all_scores": {
      "Rashtrakuta": 0.1923076923076923,
      "Kakatiya": 0.1185897435897436
    }
  },
  "38": {
    "paragraph": "బేతరాజు కుమారుడు మొదటి ప్రోలుడు క్రీ. శ. చాళుక్య యువరాజు ఆరవ విక్రమాదిత్యునికి సహాయపడ్డాడు. స్థానిక ప్రభువులైన అన్నయ్య గొన్నయ్యలను నిర్జించాడు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.07342657342657342,
    "all_scores": {
      "Kakatiya": 0.07342657342657342
    }
  },
  "39": {
    "paragraph": "ఈతనికి అరికేసరి అనే బిరుదు ఉంది. ఇతను అనుమకొండ హనుమకొండ ను సోమేశ్వరుడినుండి పొందాడు. ప్రోలుని కుమారుడు రెండవ బేతరాజు క్రీ. శ.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.138,
    "all_scores": {
      "Kakatiya": 0.138
    }
  },
  "40": {
    "paragraph": "హనుమకొండ రాజధానిగా పాలించాడు. రాష్ట్రకూటులను జయించి కొరవి మండలం హనుమకొండ విషయం సబ్బిరాయి మండలాలను కలిపి కాకతీయ రాజ్యాన్ని విస్తరించాడు. ఈతని తమ్ముడు రెండవ ప్రోలరాజు క్రీ. శ.",
    "kingdoms": [
      "Rashtrakuta",
      "Kakatiya"
    ],
    "confidence": 0.17341040462427745,
    "all_scores": {
      "Rashtrakuta": 0.17341040462427745,
      "Kakatiya": 0.12138728323699421
    }
  },
  "41": {
    "paragraph": "మిక్కిలి గొప్పవాడు. చాళుక్యులు బలహీనపడిన సమయములో స్వాతంత్ర్యము ప్రకటించుకొని తెలంగాణ ప్రాంతం అంతా రాజ్యవిస్తరణ చేశాడు. పశ్చిమ చాళుక్యుల సామంతులైన తైలప దేవుడు మహబూబ్ నగర్ నల్గొండ జిల్లాల ప్రాంతం గోవిందరాజు వరంగల్ జిల్లా వేలకొండపల్లి ప్రాంతం గుండరాజు మంథెన ప్రాంతం జగద్దేవుడు వేములవాడ ప్రాంతం అనే నలుగురు రాజులను జయించి తెలంగాణంలో చాళుక్యుల పాలనను అంతం చేశాడు. ఇతడు కళ్యాణిని పాలిస్తున్న బిజ్జలుని సమకాలికుడు.",
    "kingdoms": [
      "Chalukya",
      "Rashtrakuta"
    ],
    "confidence": 0.051597051597051594,
    "all_scores": {
      "Chalukya": 0.051597051597051594,
      "Rashtrakuta": 0.051597051597051594,
      "Kakatiya": 0.022113022113022116
    }
  },
  "42": {
    "paragraph": "బిజ్జలునికి సహకారంగా తన సేనను పంపి అతడు కళ్యాణి నగరాన్ని పశ్చిమ చాళుక్యులనుండి వశం చేసుకోవడానికి సాయపడ్డాడు. కాకతీయులు మొదట జైనులు. అప్పటివరకు తెలంగాణ ప్రాంతంలో జైన మతం బలంగా ఉంది. కాని కళ్యాణిలో బసవని నేతృత్వంలో వీరశైవం విజృంభించి ఆంధ్రదేశంలో బలం పుంజుకోసాగింది.",
    "kingdoms": [
      "Chalukya",
      "Rashtrakuta",
      "Kakatiya"
    ],
    "confidence": 0.07984790874524714,
    "all_scores": {
      "Chalukya": 0.07984790874524714,
      "Rashtrakuta": 0.07984790874524714,
      "Kakatiya": 0.07034220532319392
    }
  },
  "43": {
    "paragraph": "ఉప్పెనలా వస్తున్న వీరశైవానికి తలవంచి రెండవ ప్రోలరాజు శైవాన్ని స్వీకరించాడు. ఈ సమయానుకూల చతురత వల్ల కాకతీయుల రాజ్యం మరో రెండు శతాబ్దాలు కొనసాగగలిగింది. తరువాత రెండవ ప్రోలుడు కృష్ణానదిని దాటి తీరాంధ్ర చోళులను జయించాలని యత్నించాడు. మంత్రకూటమును నూజివీడు మండలం పాలించుచున్న గుండని నిర్జించి తన రాజ్యములో కలుపుకున్నాడు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.06687898089171976,
    "all_scores": {
      "Kakatiya": 0.06687898089171976,
      "Chola": 0.01910828025477707
    }
  },
  "44": {
    "paragraph": "క్రీ. శ. లో వెలనాటిపై చేసిన యుద్ధములో రాజేంద్ర చోడుని చేతిలో హతమయ్యాడు. ఈ ఘటనతో కాకతీయుల చరిత్ర మలుపు తిరిగింది.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.1875,
    "all_scores": {
      "Kakatiya": 0.1875
    }
  },
  "45": {
    "paragraph": "రుద్రదేవుడు ప్రసిద్ధులైన కాకతీయులలో రుద్రదేవుడు మొదటివాడు. పరాక్రమ శాలి. రాజనీతి చతురుడు. ఇతనినే మొదటి ప్రతాపరుద్రుడు అని కూడా అంటారు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.15671641791044777,
    "all_scores": {
      "Kakatiya": 0.15671641791044777
    }
  },
  "46": {
    "paragraph": "ఇతని అనేక శాసనాలలో అనుమకొండ శాసనం వేయి స్తంభాలగుడి ప్రసిద్ధమైన చారిత్రకాధారము. రుద్రదేవుడు కాకతీయుల రాజ్యాన్ని విస్తరించి సుస్థిరం చేశాడు. ప్రోలరాజు మొదలుపెట్టిన దిగ్విజయ యాత్రలను ముందుకు తీసుకెళ్ళాడు. పశ్చిమ చాళుక్యుల సార్వభౌమత్వానికి వారసుడుగా బిజ్జలుడు కాకతీయులను లొంగదీసుకోవడానికి ప్రయత్నించాడు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.07023411371237459,
    "all_scores": {
      "Kakatiya": 0.07023411371237459
    }
  },
  "47": {
    "paragraph": "మరో ప్రక్క కాకతీయుల విజృంభణపై అసూయాగ్రస్తులైన చాళుక్య సామంతులు కాకతీయులపై కత్తిగట్టారు. అసమానమైన రాజనీతితో వీరందరిని ఎదుర్కొని రుద్రదేవుడు కాకతీయులకు సంపూర్ణ స్వాతంత్ర్యం సాధించాడు. మేడరాజు దొమ్మరాజు మైలగి దేవుడు చోడోదయుడు వంటి చిన్న చిన్న స్థానిక రాజులను జయించాడు. తరువాత తీరాంధ్రంవైపు దృష్టి సారించాడు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.06907894736842105,
    "all_scores": {
      "Kakatiya": 0.06907894736842105
    }
  },
  "49": {
    "paragraph": "పల్నాటి యుద్ధంలో వెలనాటి చోళులు బలహీనపడిన తరువాత క్రీ. శ. లో రుద్రదేవుడు ఈ ప్రాంతాన్నంతా ఆక్రమించుకొని రెండవ ప్రోలుని మరణానికి ప్రతీకారం తీర్చుకొన్నాడు. తరువాత దేవగిరి రాజైన జైతుగితో జరిగిన యుద్ధంలో రుద్రదేవుడు మరణించాడు.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.03393665158371041,
    "all_scores": {
      "Chola": 0.03393665158371041
    }
  },
  "51": {
    "paragraph": "మహాదేవుడు క్రీ. శ. రుద్రదేవుని సోదరుడు మహాదేవుడు దేవగిరి యాదవులపై పగసాధించవలెనని ప్రయత్నించి విఫలుడయ్యాడు. రుద్రునికి సంతానం లేనందున మహాదేవుని కొడుకు గణపతిదేవుని దత్తత తీసికొన్నాడు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.07458563535911603,
    "all_scores": {
      "Kakatiya": 0.07458563535911603
    }
  },
  "52": {
    "paragraph": "బహుశా రుద్రదేవుడు మరణించినపుడే గణపతిదేవుడు దేవగిరి యాదవులకు బందీగా చిక్కి ఉంటాడు. అతనిని విడిపించే ప్రయత్నంలోనే మహాదేవుడు దేవగిరిపై దండెత్తి ఆ యుద్ధంలో ఏనుగు మీద ఉండి యుధ్ధాన్ని నడిపిస్తూ మరణించాడు. మహాదేవుడు శైవ మతాభిమాని. ధ్రువేశహవర పండితుడు అతని దీక్షా గురువు.",
    "kingdoms": [
      "Kakatiya",
      "Rashtrakuta"
    ],
    "confidence": 0.057034220532319393,
    "all_scores": {
      "Kakatiya": 0.057034220532319393,
      "Rashtrakuta": 0.057034220532319393
    }
  },
  "53": {
    "paragraph": "మహాదేవుని మరణానంతరం క్రీ. శ. లో మహాదేవుని కొడుకు రుద్రదేవుని దత్తపుత్రుడు గణపతి దేవుడు కాకతీయ సింహాసనాన్ని అధిష్టించాడు. గణపతిదేవుడు క్రీ.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.12681159420289856,
    "all_scores": {
      "Kakatiya": 0.12681159420289856
    }
  },
  "54": {
    "paragraph": "శ. గణపతి దేవుడు రాజ్యానికి రావడానికి ముందు సంవత్సరాలు దేవగిరి యాదవులకు బందీగా ఉండి విడుదల చేయబడ్డాడు. ఈలోగా కాకతీయ సామంతులు చేసిన తిరుగుబాట్లను రేచర్ల రుద్రుడు అనే విశ్వాసపాత్రుడైన సేనాని అణచి రాజ్యాన్ని గణపతిదేవునికి అప్పగించాడు. గణపతిదేవుడు మహావీరుడు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.06916996047430829,
    "all_scores": {
      "Kakatiya": 0.06916996047430829
    }
  },
  "55": {
    "paragraph": "దూరదృష్టి ఉన్న రాజనీతిజ్ఞుడు. అప్పటికి దక్షిణాన పాండ్యులు పశ్చిమాన హొయసల యాదవ రాజులు ఉత్తరదేశంలో తురుష్కులు బలవంతులై తెలుగుప్రాంతాన్ని చుట్టుముట్టి ఉన్నారు. రాగల ప్రమాదాన్ని గుర్తించిన గణపతిదేవుడు త్రిలింగదేశాన్ని ఐక్యము చేయడానికి విజయయాత్రలు ించాడు. అయితే ఓడిపోయిన రాజులను తొలగించలేదు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.057692307692307696,
    "all_scores": {
      "Kakatiya": 0.057692307692307696
    }
  },
  "56": {
    "paragraph": "వారితో సంబంధాలు కలుపుకొని వారి సామంత ప్రతిపత్తిని కొనసాగించాడు. ఈ సామంతులు కాకతీయులకు అండగా నిలిచారు. గణపతిదేవుడు క్రీ. శ.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.12704918032786885,
    "all_scores": {
      "Kakatiya": 0.12704918032786885
    }
  },
  "57": {
    "paragraph": "కాలంలో తూర్పు తీరంపై దండెత్తి కృష్ణా గోదావరి గుంటూరు ప్రాంతాలను స్వాధీనం చేసుకొన్నాడు. నిడదవోలు పాలకుడైన వేంగి చాళుక్య వీరభద్రునికి క్షత్రియుడు తన కుమార్తె రుద్రమ్మను ఇచ్చి పెళ్ళి చేశాడు. రెండవ కుమార్తె గణపాంబను ధరణికోట రాజు బేతరాజుకు సోదరి మేలాంబికను మధిర పాలకుడు రుద్రరాజుకు ఇచ్చి వివాహం చేశాడు. జాయపసేవాని ఇద్దరు చెల్లెళ్ళను పిన్నచోడుని కుమార్తెలైన నారమ్మ పేరమ్మ గణపతిదేవుడు వివాహం చేసుకొన్నాడు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.04711055276381909,
    "all_scores": {
      "Kakatiya": 0.04711055276381909,
      "Chalukya": 0.01884422110552764
    }
  },
  "59": {
    "paragraph": "అప్పటికి కుల వ్యవస్థ కులాల మధ్య అంతరాలు బలపడుతున్నాయి. కాని గణపతిదేవుడు అన్ని కులాల వారితో సంబంధ బాంధవ్యాలు నెరపుకొంటూ ఈ కుల భేదాలు అంతఃకలహాలుగా మారకుండా జాగ్రత్త పడ్డాడు. జాయప కమ్మ వంశస్థుడు. చాళుక్య వీరభద్రుడు క్షత్రియుడు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.07366071428571429,
    "all_scores": {
      "Kakatiya": 0.07366071428571429
    }
  },
  "60": {
    "paragraph": "నెల్లూరుకు చెందిన తిక్కన సోమయాజి ఓరుగల్లు వెళ్ళి గణపతిదేవుని ఆస్థానంలో తన మహాభారత రచన పూర్తి చేశాడు. నెల్లూరు రాజ్యంలో కాకతీయుల జోక్యం వలన వారికి పాండ్యులతో వైరం ఏర్పడింది. పాండ్యులు రెండు సైన్యాలను పంపారు. కొప్పెరుంజింగలి నాయకత్వంలోని ఒక సైన్యం కాకతీయులతో యుద్ధంలో ఓడిపోయింది.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.07581227436823104,
    "all_scores": {
      "Kakatiya": 0.07581227436823104
    }
  },
  "61": {
    "paragraph": "పాండ్యుల రెండవ సైన్యం జటావర్మ నాయకత్వంలో నెల్లూరు పై దాడిచేసింది. క్రీ. శ. లో ముత్తుకూరు వద్ద జరిగిన యుద్ధంలో కాకతీయ శేవుణ సైన్యాలు ఓడిపోయాయి.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.1267605633802817,
    "all_scores": {
      "Kakatiya": 0.1267605633802817
    }
  },
  "62": {
    "paragraph": "ఈ యుద్ధంలో మనుమసిద్ధి మరణించాడు. నెల్లూరు రాజ్యం పాండ్యుల వశమయ్యంది. ఇది కాకతీయులకు ఘోర పరాజయం. ఇదొక్కటే గణపతిదేవుడు యుద్ధాలలో చవి చూసిన ఓటమి.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.1091549295774648,
    "all_scores": {
      "Kakatiya": 0.1091549295774648
    }
  },
  "63": {
    "paragraph": "అప్పటికే గణపతిదేవుడు బాగా వృద్ధుడై యున్నాడు. తరువాత ప్రతాపరుద్రుని కాలం వరకు నెల్లూరును కాకతీయులు వశపరచుకోలేకపోయారు. గణపతిదేవుని కాలంలో ఓరుగల్లు పెక్కు తటాకాల ఆలయాల నిర్మాణం జరిగింది. అనేక గణపవరాలు వెలిశాయి.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.10144927536231885,
    "all_scores": {
      "Kakatiya": 0.10144927536231885
    }
  },
  "65": {
    "paragraph": "రుద్రమదేవి రాణి రుద్రమ దేవి ప్రధాన రుద్రమ దేవి గణపతిదేవునికి పుత్రులు లేనందున రెండవ కూతురు రుద్రమదేవికి పురుషోచిత విద్యలు నేర్పి రుద్రదేవ మహారాజు గా సింహాసనాన్ని అప్పగించాడు. త్రిలింగదేశమంతటినీ ఒక స్త్రీ అసమాన ధైర్య సాహసాలతో సమర్ధవంతంగా పాలించడం వలన ఈ ఘట్టం తెలుగువారి చరిత్రలో ముఖ్యమైనది. రుద్రమదేవి పాలనకాలమంతా యుద్ధాలతోనే సరిపోయింది. రుద్రమదేవికి ముందుగా స్త్రీ పరిపాలన సహించని సామంతులనుండి దాయాదులనుండి ప్రతిఘటన ఎదురయ్యింది.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.07009345794392523,
    "all_scores": {
      "Kakatiya": 0.07009345794392523
    }
  },
  "67": {
    "paragraph": "తరువాత తూర్పున గంగ నరసింహదేవుడు వేంగి ప్రాంతాన్ని క్రీ. శ. లో ఆక్రమించాడు. కాని పోతినాయక ప్రోలినాయకులు వారిని ఓడించి సా.శ.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.06147540983606557,
    "all_scores": {
      "Chalukya": 0.06147540983606557
    }
  },
  "68": {
    "paragraph": "లో వేంగిలో తిరిగి కాకతీయుల అధికారం నెలకొల్పారు. ఇంతలో దేవగిరి యాదవ మహాదేవుడు దండెత్తాడు. అతనిని ఓడించి రుద్రమదేవి పరిహారాన్ని గ్రహించింది. దక్షిణాదిన నెల్లూరు ప్రాంతంలో పాండ్యులు విజృంభించసాగారు.",
    "kingdoms": [
      "Kakatiya",
      "Chalukya"
    ],
    "confidence": 0.0903846153846154,
    "all_scores": {
      "Kakatiya": 0.0903846153846154,
      "Chalukya": 0.07692307692307693
    }
  },
  "69": {
    "paragraph": "వారిని ఓడించిననూ అక్కడ కాకతీయాధికారం ఎంతో కాలం నిలువలేదు. పాండ్యుల సామంతులైన తెలుగు చోడులు మళ్ళీ నెల్లూరును ఆక్రమించారు. వల్లూరు రాజ్యం మాత్రం పాండ్యులనుండి కాకతీయుల వశమైంది. దానిని జన్నిగదేవుడు తరువాత త్రిపురారి కాకతీయుల సామంతులుగా ఏలారు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.08786610878661087,
    "all_scores": {
      "Kakatiya": 0.08786610878661087
    }
  },
  "70": {
    "paragraph": "అయితే త్రిపురారి తరువాత వచ్చిన అంబదేవుడు తిరుగుబాటు చేసి స్వతంత్రరాజ్యం స్థాపించ ప్రయత్నించాడు. అంబయతో జరిగిన యుద్ధంలో రుద్రమదేవి మరణించింది క్రీ. శ. .",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.09933774834437087,
    "all_scores": {
      "Kakatiya": 0.09933774834437087
    }
  },
  "71": {
    "paragraph": "నిరంతరం యుద్ధాలలో ఉన్నాగాని రుద్రమదేవి చాలా సమర్థవంతంగా పాలన నిర్వహించింది. ఓరుగల్లు కోటను దుర్భేద్యంగా బలపరచింది. దేశం సుభిక్షంగా ఉంది. ఆమె కాలంలోనే వెనిస్ యాత్రికుడు మోటుపల్లి రేవులో దిగాడు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.078125,
    "all_scores": {
      "Kakatiya": 0.078125
    }
  },
  "72": {
    "paragraph": "దేశంలో పాలన కట్టుదిట్టంగా ఉందని పరిశ్రమలు వాణిజ్యం వర్ధిల్లుతున్నాయని వర్ణించాడు. రుద్రమ దేవి భర్త చాళుక్య వీరభద్రుడు. వీరికి ముగ్గుర్ కుమార్తెలు కుమారులు కలగలేదు. పెద్ద కూతురు ముమ్మడామ్మను కాకతి మహాదేవుడు వివాహమాడెను.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.06192660550458716,
    "all_scores": {
      "Kakatiya": 0.06192660550458716
    }
  },
  "73": {
    "paragraph": "వారి తనయుడే ప్రతాపరుద్రుడు. రుద్రమ దేవి తరువాత కాకతీయ సామ్రాట్టు అయినాడు. రుద్రమ చిన్న నాదే అతనిని దత్తత తీసుకొని తన తదనంతరం వారసుడిని యువరాజ్య పట్టాభిషేక మొనర్చింది. ప్రతాపరుద్రుడు ప్రధాన ప్రతాపరుద్రుడు ప్రతాపరుద్రుడు రుద్రమదేవి మనుమడు కూతురు కొడుకు .",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.0863095238095238,
    "all_scores": {
      "Kakatiya": 0.0863095238095238
    }
  },
  "74": {
    "paragraph": "రుద్రమదేవి ఈతనిని వారసునిగా చేసుకోవటానికి దత్తత తీసుకొంది. క్రీ. శ. లో కాయస్థ సేనాని అంబదేవుని తిరుగుబాటు అణచు ప్రయత్నములో రుద్రమదేవి మరణించింది.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.10344827586206896,
    "all_scores": {
      "Kakatiya": 0.10344827586206896
    }
  },
  "75": {
    "paragraph": "ప్రతాపరుద్రుడు సింహాసనమధిష్ఠించాడు. ప్రతాపరుద్రుని పరిపాలనాకాలమంతయూ యుద్ధములతోనే గడచింది. అంబదేవుని నెల్లూరులో మనుమగండుని కర్ణాట రాజులను జయించి రాజ్యము కట్టుదిట్టము చేశాడు. ఇంతలో ఉత్తర దేశమునుండి కొత్త ఉపద్రవము ముంచుకొచ్చింది.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.11946902654867257,
    "all_scores": {
      "Kakatiya": 0.11946902654867257
    }
  },
  "77": {
    "paragraph": "లో జరిగిన నాలుగవ యుద్ధములో ప్రతాపరుద్రునికి అపజయము సంభవించింది. ముసునూరి నాయకులు ప్రధాన ముసునూరి నాయకులు ప్రతాపరుద్రుని పరాజయము తరువాత త్రిలింగదేశము అల్లకల్లోలమైనది. తురుష్కుల ఆగడాలు చెప్పనలవి గానివి. ముసునూరి ప్రోలయ నాయకుని విలస తామ్ర శాసనములో ఆనాటి తెలుగు వారి దయనీయ స్థితి వర్ణించబడింది.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.11379310344827587,
    "all_scores": {
      "Kakatiya": 0.11379310344827587
    }
  },
  "80": {
    "paragraph": "అనితల్లి కలువచేరు శాసనములో ముసునూరి ప్రోలయ నాయకుని వీరత్వము దేశాభిమానము ప్రజారంజకమగు పరిపాలన విపులముగా కొనియాడబడ్డాయి. కాకతీయ సామంతులు ప్రధాన కాకతీయ సామంతులు కాకతీయుల కాలమున సామంతులు మహా సామంతాధిపతులు మహా మాత్యులు దండనాయకులు వంశ పాలకులు అమేయమైన శక్తిప్రపత్తులతో రాజ భక్తితో దేశ భక్తితో చాలా చక్కని పాత్రని పోషించారు. వంశ పాలకులు అనగా స్వజాతి కుటుంబ పాలకులు. యుద్ధములలో వీరు చాలా ఎన్న దగిన పాత్ర పోషించారు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.05185185185185186,
    "all_scores": {
      "Kakatiya": 0.05185185185185186
    }
  },
  "81": {
    "paragraph": "అటువంటి కాకతి వంశ సామంతులలో ఎన్నదగినవారు రేచర్ల రుద్ర వంశం రేచెర్ల పద్మనాయకులు గోన వంశీయులు కందూరి చోడులు చెరుకు వంశీయులు మల్యాల వంశీయులు విరియాల వంశీయులు పొలవాస పాలకులు వావిలాల వంశీయులు యాదవ రాజులు త్యాగి వంశీయులు నతవాడి వంశం కోట వంశం కాయస్థ వంశం ఇందులూరి వంశీయులు ముసునూరి నాయకులు బాణ వంశం నాగ వంశీయులు వైదుంబులు చిత్రమాలిక ములుగు వద్ద కోట గుళ్ళు ములుగు వద్ద కోట గుళ్ళు కాకతీయులనాటి మంటపం. ఆంధ్రప్రదేశ్ రాష్ట్ర పురావస్తు సంగ్రహాలయం హైదరాబాదులో భద్రపరచబడింది. మ్యూజియం వారి సౌజన్యంతో ఫొటో తీయబడినది కాకతీయులనాటి మంటపం. ఆంధ్రప్రదేశ్ రాష్ట్ర పురావస్తు సంగ్రహాలయం హైదరాబాదులో భద్రపరచబడింది.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.025510204081632654,
    "all_scores": {
      "Kakatiya": 0.025510204081632654
    }
  },
  "82": {
    "paragraph": "మ్యూజియం వారి సౌజన్యంతో ఫొటో తీయబడినది రామప్ప ఆలయం వద్ద నంది మండపం రామప్ప ఆలయం వద్ద నంది మండపం ఆర్ధిక రంగం ఈ కాలంలో కాకతీయ సామ్రాజ్యం సిరిసంపదలతో తులతూగుతున్నట్లు అమీర ఖుస్రూ అబ్దున్నా వాసఫ్ మార్కోపోలో వంటి విదేశీ యాత్రికుల రచనల వల్ల తెలుస్తుంది. వ్యవసాయమే నాడు తెలంగాణ ప్రాంతానికి ప్రధాన వృత్తి మూలం అవసరం . వ్యవసాయం చాలావరకు వర్షాధారమే అయితే కాకతీయ రాజులు రాణులు సామంతులు పెద్ద చెరువులు కాలువలు త్రవ్వించి నీటి పారుదల సౌకర్యాలు కల్పించారు. రామప్పచెరువు కేసరి సముద్రం పాకాల చెరువు కాటసముద్రం చౌడ సముద్రం సబ్బి సముద్రం జగత్కేసరి సముద్రం ఉదాహరణలు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.03296703296703297,
    "all_scores": {
      "Kakatiya": 0.03296703296703297
    }
  },
  "87": {
    "paragraph": "ఇంకా మోటుపల్లి మచిలీపట్టణం వంటి రేవుపట్టణాల ద్వారా విదేశీ వ్యాపారం జరిగేది. వ్యవసాయం ప్రధాన కాకతీయుల కాలంలో వ్యవసాయ రంగం కాకతీయుల కాలంలో వ్యవసాయమే ప్రధాన వృత్తి కావడంతో కాకతీయ చక్రవర్తులు వ్యవసాయాభివృద్ధికి ప్రత్యేక శ్రద్ధ తీసుకున్నారు. వ్యవసాయ సంస్కరణల ద్వారా చెన్నూరు పాలంపేట పాకాల మంథని ఏటూరు నాగారం కొత్తగూడ ఎల్లందు బయ్యారం అమ్రాబాద్ శ్రీశైలం ప్రాంతాల్లో లక్షలాది ఎకరాల భూమి కొత్తగా సాగులోకి వచ్చింది ఫలితంగా ఆ ప్రాంతాలలో వందల గ్రామాలు ఏర్పడ్డాయి. ఇందుకోసం రెండు ప్రధానమైన మార్గాలు అనుసరించారు ఒకటి వ్యవసాయానికి సాగునీటి ఏర్పాటు రెండు అడవులు కొట్టించడం ద్వారానూ సాగులో లేని బీడు భూముల సాగుకు ప్రోత్సాహకాలు అందించడం సాగునీటికి జలాశయాలు ఏర్పాటు వేయిస్తంభాల గుడి వద్ద కాకతీయులు నిర్మించిన చెరువు వ్యవసాయం ప్రధానంగా వర్షాధారం కావడంతో సాగునీటి వనరుల పెంపుకు వర్షపునీటిని నిల్వచేసుకునే లక్ష్యంతో కాకతీయుల కాలపు నిర్మాణాలు సాగాయి.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.022370012091898428,
    "all_scores": {
      "Kakatiya": 0.022370012091898428
    }
  },
  "88": {
    "paragraph": "కాకతీయ చక్రవర్తులు నిర్మించిన జలాశయాలు నాలుగు విధాలుగా విభజించవచ్చు సరస్సులు చెరువులు కాలువలు బావులు. ప్రతీ ఊరికీ అనుబంధంగా ఆలయానికి ఈశాన్యంగా ఒక చెరువు నిర్మాణం చేసేవారు. ఊరికి దిగువన చెరువు చెరువుకు దిగువన పొలాలు ఉండేలా జాగ్రత్తపడడంతో ఊరిలో పడిన వాననీరు చెరువును నింపడంతోపాటు ఊరికి వరదల ముప్పు కూడా ఉండేది కాదు. వర్షపు నీటిని నిలువ చేయడం మాత్రమే కాక సమీపంలోని భారీ జలాశయానికి దీన్ని అనుసంధానించేవారు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.04477611940298507,
    "all_scores": {
      "Kakatiya": 0.04477611940298507
    }
  },
  "89": {
    "paragraph": "నుంచి చాళుక్యుల సామంతునిగా రాజ్యపాలన చేసిన కాకతీయ పాలకుడు మొదటి ప్రోలయరాజు నిర్మించిన కేసీయసముద్రం సరస్సుతో కాకతీయుల చెరువుల నిర్మాణం మైంది. తర్వాత్తర్వాత స్వాతంత్ర్యం ప్రకటించుకున్న కాకతీయులు చెరువుల నిర్మాణం కొనసాగించారు. రెండవ బేతరాజు అనుమకొండలో చెరువును కట్టించాడు. ఆపైన గణపతిదేవుడు నెల్లూరు ఎల్లూరు గణపురం గంగాపురం వగైరా చెరువులను నిర్మించి ఈ పథకాన్ని ముందుకు తీసుకువెళ్ళాడు.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.04342105263157895,
    "all_scores": {
      "Kakatiya": 0.04342105263157895
    }
  },
  "91": {
    "paragraph": "వ్యవసాయం పెంపొందిద్దామని అడపగట్టు అనే పద్ధతిలో రాచభూములను సగం ఆదాయాన్ని ప్రభుత్వానికి జమకట్టడానికి ఇష్టపడేవారికి కౌలుకు ఇచ్చేవారు. ఈ విధానాలు వ్యవసాయానికి కాకతీయుల ఆర్థిక స్థితికి సాయం చేశాయి. జీవనం శిల్పం సాహిత్యం కళలు ప్రధాన కాకతీయుల కళాపోషణ ఇవి కూడా చూడండి కాకతీయుల వంశవృక్షము కాకతీయుల కళాపోషణ శాతవాహనులు చరిత్ర పరికరాల పెట్టె స్వరూపం దాచు పాఠ్యం చిన్న ప్రామాణిక పెద్ద వెడల్పు ప్రామాణిక వెడల్పుగా రంగు ఆటోమాటిగ్గా ప్రకాశవంతంగా చీకటిగా శాతవాహనులు సా.శ.. లో శాతవాహన సామ్రాజ్య విస్తృతి అధికార భాషలు ప్రాకృతం సంస్కృతం భట్టిప్రోలు లిపి ఆది తెలుగు రాజధానులు కోటిలింగాల పుణె వద్ద ఉన్న జున్నార్ గుంటూరు సమీపాన కల ధరణికోట అమరావతి ప్రభుత్వం రాచరికం శాతవాహనులకు ముందు పాలించినవారు మౌర్యులు శాతవాహనుల తర్వాత పాలించినవారు ఇక్ష్వాకులు కదంబులు గుంటుపల్లి కామవరపుకోట వద్ద ఉన్న బౌద్ధ స్తూపాలు ఆంధ్ర ప్రదేశ్ చరిత్ర కాలరేఖ చరిత్ర పూర్వ యుగము క్రీ.పూ.",
    "kingdoms": [
      "Kakatiya",
      "Satavahana"
    ],
    "confidence": 0.025179856115107913,
    "all_scores": {
      "Kakatiya": 0.025179856115107913,
      "Satavahana": 0.01753597122302158
    }
  },
  "93": {
    "paragraph": "మౌర్యులు క్రీ.పూ. క్రీ.పూ. శాతవాహనులు క్రీ.పూ. క్రీ.త.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.3333333333333333,
    "all_scores": {
      "Satavahana": 0.3333333333333333
    }
  },
  "95": {
    "paragraph": "ఇక్ష్వాకులు బృహత్పలాయనులు ఆనంద గోత్రీకులు శాలంకాయనులు విష్ణుకుండినులు పల్లవులు పూర్వమధ్య యుగము మహాపల్లవులు రేనాటి చోడులు చాళుక్యులు రాష్ట్రకూటులు తూర్పు చాళుక్యులు పూర్వగాంగులు చాళుక్య చోళులు కాకతీయులు అర్వాచీన గాంగులు ఉత్తరమధ్య యుగము ముసునూరి నాయకులు ఓఢ్ర గజపతులు రేచెర్ల పద్మనాయకులు కొండవీటి రెడ్డి రాజులు రాజమహేంద్రవరం రెడ్డి రాజులు బహమనీ రాజ్యము విజయనగర సామ్రాజ్యము ఆధునిక యుగము అరవీటి వంశము పెమ్మసాని నాయకులు కుతుబ్ షాహీ యుగము నిజాము రాజ్యము బ్రిటిషు రాజ్యము స్వాతంత్ర్యోద్యమము ఆంధ్ర రాష్ట్రం ఏర్పాటు హైదరాబాదు రాష్ట్రం ఏర్పాటు ఆంధ్ర ప్రదేశ్ అవతరణ ఏకీకృత ఆంధ్ర ప్రదేశ్ చరిత్ర ఆంధ్ర ప్రదేశ్ చరిత్ర తెలుగు సాహిత్యం నన్నయకు ముందు నన్నయ యుగము శివకవి యుగము తిక్కన యుగము ఎఱ్ఱన యుగము శ్రీనాథ యుగము రాయల యుగము దాక్షిణాత్య యుగము క్షీణ యుగము ఆధునిక యుగము వ శతాబ్ది చారిత్రక నగరాలు పిఠాపురం భట్టిప్రోలు వేంగి ధాన్యకటకము కొలనుపాక ఓరుగల్లు విజయపురి రాజమహేంద్రవరం కళింగపట్నం హంపి సింహపురి హైదరాబాదు చారిత్రక వ్యక్తులు గణపతిదేవుడు రుద్రమదేవి కృష్ణదేవరాయలు శాలివాహనుడు అశోకుని ఆరవస్తంభం ఇసుకరాయిపై బ్రాహ్మీలో చెక్కిన అశోకుని వ స్తంభ శాసన శకలం. బ్రిటీషు మ్యూజియం వాశిష్టీపుత్ర శాతకర్ణి యొక్క వెండి నాణెం సా.శ.. . ముందు .",
    "kingdoms": [
      "Rashtrakuta",
      "Kakatiya",
      "Vijayanagara"
    ],
    "confidence": 0.02233754512635379,
    "all_scores": {
      "Rashtrakuta": 0.02233754512635379,
      "Kakatiya": 0.015703971119133575,
      "Vijayanagara": 0.013989169675090252,
      "Satavahana": 0.010830324909747294,
      "Chalukya": 0.006768953068592058,
      "Chola": 0.006768953068592057
    }
  },
  "96": {
    "paragraph": "అశోకుని కాలమునాటి బ్రాహ్మీలిపిలో ప్రాకృతం శిరి శాతకనీస రానో ... వసితిపుతస. వెనుక ఎడమవైపు ఉజ్జయినీ శాతవాహన చిహ్నం. కుడివైపు ఆరు అర్ధచంద్రాకారపు ఆర్చులతో చైత్యగిరి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.12962962962962962,
    "all_scores": {
      "Satavahana": 0.12962962962962962
    }
  },
  "97": {
    "paragraph": "క్రింది భాగములో నది. తెలుగు బ్రాహ్మీ లిపిలో అరహనకు వహిత్తి మకనకు తిరు హతకనికో. శాతవాహనులు దక్షిణ మధ్య భారతదేశాన్ని కోటిలింగాల ధరణికోట జూన్నార్ ల నుండి సా.శ..పూ. సం.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.10975609756097561,
    "all_scores": {
      "Satavahana": 0.10975609756097561
    }
  },
  "98": {
    "paragraph": "నుండి సుమారు సంవత్సరాలు పరిపాలించారు. శాతవానుల తొలి రాజధాని కోటిలింగాల. కాని కొందరు చరిత్రకారులు శాతవాహనుల తొలి రాజధాని ఆంధ్రప్రదేశ్ లోని ధాన్యకటకం అమరావతి అని భావిస్తున్నారు. వీరి జనరంజక పరిపాలన వీరికి శాంతికాముకులుగా పేరు తెచ్చింది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07905982905982906,
    "all_scores": {
      "Satavahana": 0.07905982905982906
    }
  },
  "99": {
    "paragraph": "మౌర్య వంశ సామంతులుగా రాజకీయజీవితం ించిన శాతవాహనులు సా.శ. లో అశోకుని మరణం తర్వాత స్వాతంత్ర్యము ప్రకటించుకొన్నారు. శాతవాహన వంశ మూలాల స్పష్టమైన సమాచారం లేదు. పురాణాల ప్రకారం ఈ వంశపు తొలి రాజు కణ్వ వంశాన్ని ఓడించాడు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.0849056603773585,
    "all_scores": {
      "Satavahana": 0.0849056603773585
    }
  },
  "100": {
    "paragraph": "మౌర్యుల తరువాత దక్కనులో విదేశీయుల దండయాత్రలను ఎదుర్కొని శాంతిని స్థాపించారు. మరీ ముఖ్యంగా శకులు పశ్చిమ సాత్రపులతో వారి యుద్ధాలు దీర్ఘ కాలం పాటు సాగాయి. గౌతమిపుత్ర శాతకర్ణి అతని కుమారుడూ వాశిష్ఠీ పుత్ర పులుమావి ల కాలంలో శాతవాహన సామ్రాజ్యం ఉచ్ఛ స్థితికి చేరింది. సా.శ.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06766917293233082,
    "all_scores": {
      "Satavahana": 0.06766917293233082
    }
  },
  "103": {
    "paragraph": "శాతవాహనులు వాశిష్ఠీపుత్ర శ్రీ పులోమావి సా.శ..పూ. తో ించి తమ నాణేలపై రాజుల ముఖచిత్రాలు ముద్రించిన తొలి భారతీయ స్థానిక పాలకులుగా భావిస్తారు. ఈ సంప్రదాయం వాయువ్యాన పరిపాలించిన ఇండో గ్రీకు రాజుల నుండి వచ్చింది. శాతవాహన నాణేలు రాజుల కాలక్రమం భాష ముఖ కవళికల గుంగురు జుట్టు పెద్ద చెవులు బలమైన పెదవులు గురించి అనూహ్యమైన ఆధారాలు పొందు పరుస్తున్నవి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05309734513274336,
    "all_scores": {
      "Satavahana": 0.05309734513274336
    }
  },
  "104": {
    "paragraph": "వీరు ప్రధానంగా సీసము రాగి నాణేలు ముద్రించారు వీరి ముఖచిత్ర వెండి నాణేలు సాధారణంగా పశ్చిమ క్షాత్రప రాజుల నాణేలపై ముద్రించబడినవి. ఈ నాణేలపై ఏనుగులు సింహాలు గుర్రాలు చైత్య స్తూపాల వంటి అనేక సాంప్రదాయక చిహ్నాలు అలంకరించబడి ఉన్నాయి. వీటిపై ఉజ్జయిని చిహ్నం ఒక గుర్తులో నాలుగు అంచుల వద్ద నాలుగు వృత్తాలు కూడా ఉన్నాయి. ఉజ్జయినీ చిహ్నం శాతవాహనుల నాణేలపై ఉండటము వలన ప్రసిద్ధ పౌరాణిక చక్రవర్తి విక్రమాదిత్యుడు శాతవాహన చక్రవర్తి అయి ఉండవచ్చని భావిస్తున్నారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.04708520179372197,
    "all_scores": {
      "Satavahana": 0.04708520179372197
    }
  },
  "105": {
    "paragraph": "ఈ విక్రమాదిత్యుని పేరు మీదనే విక్రమ శకం మైంది. ఆవిర్భావం శాతవాహనుల పుట్టిన తేదీ ప్రదేశం అలాగే రాజవంశం పేరు అర్థం చరిత్రకారులలో నీయాంశంగా ఉంది. ఈ లలో కొన్ని ప్రాంతీయవాదం నేపథ్యంలో జరిగాయి. ఇందుకు విభిన్నంగా ప్రస్తుత ఆంధ్రప్రదేశ్ మహారాష్ట్ర కర్ణాటక తెలంగాణ ప్రాంతాలు శాతవాహనుల అసలు మాతృభూమిగా పేర్కొనబడ్డాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06862745098039215,
    "all_scores": {
      "Satavahana": 0.06862745098039215
    }
  },
  "106": {
    "paragraph": "పేరు వెనుక చరిత్ర ఒక సిద్ధాంతం ప్రకారం శాతవాహన అనే పదం సంస్కృత సప్త వాహన ప్రాకృత రూపం ఏడు వాహనాలు హిందూ పురాణాలలో సూర్య భగవానుడి రథాన్ని ఏడు గుర్రాలు నడిపిస్తాయి . పురాతన భారతదేశంలో సర్వసాధారణంగా శాతవాహనులు పౌరాణిక సూర్యవంశంతో సంబంధం కలిగి ఉన్నారని ఇది సూచిస్తుంది. ఇంగువ కార్తికేయ శర్మ అభిప్రాయం ప్రకారం రాజవంశం పేరు సాతా పదునుపెట్టింది అతి చురుకైనది లేదా వేగవంతమైనది . వాహన వాహనం అనే పదాల నుండి ఉద్భవించింది వ్యక్తీకరణలో అతి చురుకైన గుర్రపు స్వారీ చేసేవాడు అని అర్ధం.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.038379530916844345,
    "all_scores": {
      "Satavahana": 0.038379530916844345
    }
  },
  "107": {
    "paragraph": "మరొక సిద్ధాంతం వారి పేరును పూర్వపు సత్యపుట రాజవంశంతో కలుపుతుంది. ఇంకొక సిద్ధాంతం వారి పేరును ముండా పదాలు సడం గుర్రం హర్పాను కొడుకు ల నుండి వచ్చింది ఇది గుర్రాన్ని బలి ఇచ్చేవారి కుమారుడు అని సూచిస్తుంది. రాజవంశంలో అనేక మంది పాలకులకు శాతకర్ణి అనే పేరు బిరుదు ను ఉంది. శాతవాహన శాతకర్ణి శాతకణి శాలివాహన ఒకే పదానికి ఉన్న వివిధ రూపాలుగా కనిపిస్తాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.048104956268221574,
    "all_scores": {
      "Satavahana": 0.048104956268221574
    }
  },
  "108": {
    "paragraph": "శాతకర్ణి అనే పదం ముండా పదాలు సదా గుర్రం కోన్ కొడుకు నుండి ఉద్భవించిందని దామోదర్ ధర్మానంద కోశాంబి సిద్ధాంతీకరించారు. పురాణాలు శాతవాహనులకు ఆంధ్ర అనే పేరును ఉపయోగిస్తాయి. ఆంధ్ర అనే పదం రాజవంశం జాతి లేదా భూభాగాన్ని సూచిస్తుంది. క్రింద అసలు మాతృభూమి చూడండి .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06521739130434782,
    "all_scores": {
      "Satavahana": 0.06521739130434782
    }
  },
  "109": {
    "paragraph": "ఇది రాజవంశం సొంత రికార్డులలో కనిపించదు. తమిళ ఇతిహాసం సిలప్పదికారంలో హిమాలయాల్లో చేసిన పోరాటంలో చేర రాజు సెంగుట్టువన్ కు సహాయం చేసిన నూరువరు కన్నారు గురించిన ప్రస్తావన ఉంది. నూర్వరు కన్నారు అనే పదం ప్రత్యక్ష అనువాదం వంద కర్ణాలు లేదా శాతకర్ణి అందువలన నూరువరు కన్నారే శాతవాహన రాజవంశంగా గుర్తించబడింది. అసలైన మాతృభూమి .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05238095238095238,
    "all_scores": {
      "Satavahana": 0.05238095238095238
    }
  },
  "111": {
    "paragraph": "మూస మూస . పురాణాలలో ఆంధ్రా ఆంధ్ర జాతియా పేర్లను ఉపయోగించడం వల్ల ఈ రాజవంశం తూర్పు దక్కను ప్రాంతంలో చారిత్రాత్మకంగా ప్రస్తుత ఆంధ్ర ప్రాంతం ఉద్భవించిందని ఇ.జె రాప్సన్ ఆర్.జి.భండార్కర్ వంటి కొంతమంది పండితులు విశ్వసించారు. ప్రస్తుత ఆంధ్రప్రదేశ్ తెలంగాణ . తెలంగాణలోని కోటిలింగాల వద్ద రానో సిరి చిముకా శాతవాహనస అనే పురాణ చిహ్నాలు కలిగి ఉన్న నాణేలు కనుగొనబడ్డాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.029577464788732397,
    "all_scores": {
      "Satavahana": 0.029577464788732397
    }
  },
  "112": {
    "paragraph": "ఎపిగ్రాఫిస్టు నామిస్మాస్టిస్టు పుచ్చా వాసుదేవ పరబ్రహ్మశాస్త్రి మొదట్లో చిముకాను రాజవంశం వ్యవస్థాపకుడు సిముకాగా గుర్తించారు. దీని కారణంగా కోటిలింగాలు సిముకాకు నాణేలు దొరికిన ఏకైక ప్రదేశంగా ప్రసిద్ధి చెందింది. సిముకా వారసులైన కన్హా మొదటి శాతకర్ణికి కారణమైన నాణేలు కోటిలింగ వద్ద కూడా కనుగొనబడ్డాయి. ఈ ఆవిష్కరణల ఆధారంగా అజయ మిత్రా శాస్త్రి డి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07079646017699115,
    "all_scores": {
      "Satavahana": 0.07079646017699115
    }
  },
  "113": {
    "paragraph": "ఆర్. రెడ్డి ఎస్. రెడ్డి శంకరు ఆర్. గోయల్ వంటి చరిత్రకారులు కోటిలింగాల ప్రాంతం శాతవాహనుల అసలు నివాసం అని సిద్ధాంతీకరించారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.1721311475409836,
    "all_scores": {
      "Satavahana": 0.1721311475409836
    }
  },
  "114": {
    "paragraph": "కోటిలింగాల వద్ద నాణేలను కనుగొనడం శాతవాహన రాజకీయ అధికారం అసలు కేంద్రం మనం గుర్తించాల్సిన ప్రాంతానికి స్పష్టమైన కేంద్రం అని అజయ మిత్రా శాస్త్రి పేర్కొన్నారు. అయితే కోటిలింగాలలో లభించిన నాణెం నమూనాలు చిన్నవిగా ఉన్నాయి. ఈ నాణేలు అక్కడ ముద్రించబడినవా లేదా వేరే చోట నుండి అక్కడకు చేరుకున్నాయా అనేది కచ్చితంగా తెలియదు. అంతేకాకుండా కోటిలింగాలకు చెందిన చిముకాను రాజవంశం వ్యవస్థాపకుడు సిముకాకు చెందినవనే సిద్ధాంతంతో పి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05134474327628362,
    "all_scores": {
      "Satavahana": 0.05134474327628362
    }
  },
  "116": {
    "paragraph": "వారు చిముకాను తరువాతి కాలానికి చెందిన పాలకుడిగా గుర్తించారు. పి.వి.పి. శాస్త్రి కూడా తరువాత తన అభిప్రాయాన్ని మార్చుకుని ఇద్దరు రాజులు భిన్నమైన వారని పేర్కొన్నాడు. కోటిలింగాల అన్వేషణతో పాటు ఆంధ్రప్రదేశ్ లోని కర్నూలు జిల్లాలో స్థాపకుడి నాల్గవ తరానికి చెందిన శాతవాహన యువరాజు శక్తికుమార నాణేన్ని కనుగొన్నట్లు నివేదించబడింది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06562499999999999,
    "all_scores": {
      "Satavahana": 0.06562499999999999
    }
  },
  "117": {
    "paragraph": "పురాణాల విషయానికొస్తే ఈ గ్రంథాలు తరువాతి తేదీలో సంకలనం చేయబడి ఉండవచ్చు. శాతవాహనులను వారి కాలం లోనే ఆంధ్రులుగా పేర్కొన్నారా లేదా అనేది కచ్చితంగా తెలియదు. క్రీ.పూ నాటి నానేఘాటు శాసనం. మొదటి శాతకర్ణి పాలనలో సా.పూ.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07857142857142857,
    "all_scores": {
      "Satavahana": 0.07857142857142857
    }
  },
  "119": {
    "paragraph": "ఈ నగరాలు ప్రస్తుత దక్షిణ మహారాష్ట్ర తెలంగాణ ఆంధ్రప్రదేశ్ రాష్ట్రాలలో విస్తరించి ఉన్నాయి. ప్రతిష్ఠానపురం ఇప్పటి పైఠాన్ వారి రాజధాని. వారే శాతవాహన రాజులు. చంద్రగుప్త మౌర్యుని పాలనలో మెగస్తనీస్ తన పుస్తకం ఇండికాలో దీనిని వివరించాడు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07860262008733623,
    "all_scores": {
      "Satavahana": 0.07860262008733623
    }
  },
  "120": {
    "paragraph": "శాతవాహనులు పశ్చిమ దక్కను ప్రస్తుత మహారాష్ట్ర లో ఉద్భవించారని కొందరు పరిశోధకులు భావిస్తున్నారు. ఈ ప్రాంతంలో శాతవాహన కాలం క్రీ.పూ. వ శతాబ్దం నుండి ఉన్న నాలుగు శాసనాలను కనుగొన్నారు. నాసిక్ జిల్లాలోని పాండవ్లేని గుహలలోని గుహ నెం .",
    "kingdoms": [
      "Satavahana",
      "Rashtrakuta"
    ],
    "confidence": 0.06637168141592921,
    "all_scores": {
      "Satavahana": 0.06637168141592921,
      "Rashtrakuta": 0.03982300884955752
    }
  },
  "121": {
    "paragraph": "వద్ద కన్హా క్రీ.పూ. పాలనలో జారీ చేసిన పురాతన శాతవాహన శాసనాన్ని కనుగొన్నారు. నానేఘాట్ వద్ద దొరికిన ఒక శాసనాన్ని మొదటి శాతకర్ణి భార్య అయిన నయనికా లేదా నాగనికా జారీ చేసింది నానేఘాటు వద్ద కనుగొన్న మరొక శాసనాన్ని పాలియోగ్రాఫిక్ ప్రాతిపదికన అదే కాలానికి చెందినదిగా గుర్తించారు. మహారాష్ట్రకు ఉత్తరాన ఉన్న మధ్యప్రదేశ్ లోని సాంచి వద్ద రెండవ శాతకర్ణి కాలానికి చెందిన శాసనాన్ని కనుగొన్నారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.04353562005277045,
    "all_scores": {
      "Satavahana": 0.04353562005277045
    }
  },
  "122": {
    "paragraph": "ఇతర శాతవాహన శాసనాల్లో ఎక్కువ భాగాన్ని పశ్చిమ దక్కనులో కనుగొన్నారు. మరోవైపు తూర్పు దక్కనులో లభించిన ఎపిగ్రాఫిక్ ఆధారాలలో సా.శ. వ శతాబ్దానికి ముందు శాతవాహనుల గురించిన ప్రస్తావన లేదు. నెవాసా వద్ద కన్హాకు చెందినవని భావిస్తున్న ఒక ముద్ర కొన్ని నాణేలు లభించాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.08235294117647059,
    "all_scores": {
      "Satavahana": 0.08235294117647059
    }
  },
  "123": {
    "paragraph": "శాతకర్ణి కి చెందినవని భావిస్తున్న నాణేలు మహారాష్ట్రలోని నాసిక్ నెవాసా పౌని తూర్పు దక్కన్ ప్రస్తుత మధ్యప్రదేశ్ లోని ప్రదేశాలతో పాటు కూడా లభించాయి. ఈ సాక్ష్యం ఆధారంగా కొంతమంది చరిత్రకారులు శాతవాహనులు తమ రాజధాని ప్రతిష్ఠానపురం చుట్టుపక్కల ప్రాంతంలో మొదట అధికారంలోకి వచ్చారని ఆపై తమ భూభాగాన్ని తూర్పు దక్కన్ కు విస్తరించారని వాదించారు. తొలి శాసనాలు చాలా తక్కువ సంఖ్యలో లభించడాన్ని బట్టి వారు పశ్చిమ దక్కనుకు చెంది ఉంటారని భావించడం తాత్కాలికం మాత్రమేనని కార్లా సినోపోలీ హెచ్చరించింది. కన్హాకు చెందిన పాండవ్లేని శాసనంలో మహా మాత్ర అనే పదాన్ని ప్రస్తావించింది.",
    "kingdoms": [
      "Satavahana",
      "Rashtrakuta"
    ],
    "confidence": 0.02608695652173913,
    "all_scores": {
      "Satavahana": 0.02608695652173913,
      "Rashtrakuta": 0.016304347826086956
    }
  },
  "124": {
    "paragraph": "ఇది శాతవాహనులు మౌర్య పరిపాలనా నమూనాను అనుసరించారని సూచిస్తుంది. తూర్పు దక్కను ఆంధ్ర ప్రాంతం ప్రాంతానికి స్థానికులు అయినందున శాతవాహనులు ఆంధ్రులు అని సి. మార్గబంధు సిద్ధాంతీకరించాడు. వారు మౌర్య సామంతులుగా పనిచేసిన తరువాత పశ్చిమ దక్కనులో తమ సామ్రాజ్యాన్ని మొదట స్థాపించినప్పటికీ.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06521739130434784,
    "all_scores": {
      "Satavahana": 0.06521739130434784
    }
  },
  "125": {
    "paragraph": "హిమాన్షు ప్రభా రే ఈ సిద్ధాంతాన్ని వ్యతిరేకిస్తూ ఆంధ్ర అనేది మొదట ఒక జాతిని సూచించే పదమని శాతవాహనుల తరువాత చాలాకాలం తరువాత గానీ అది భౌగోళిక ప్రాంతాన్ని సూచించేదిగా మారలేదనీ పేర్కొంది. విద్యా దేహెజియా ప్రకారం. పురాణాల రచయితలు శాతవాహన కాలం తరువాత వ్రాయబడి ఉండవచ్చు తూర్పు దక్కనులో శాతవాహనులు ఉండడాన్ని బట్టి వారు ఆ ప్రాంతానికే చెందినవారని తప్పుగా భావించి వారిని ఆంధ్రుల ని అని తప్పుగా పేర్కొని ఉంటారని వాదించింది. పురాణాలు శాతవాహన రాజులను ఆంధ్రభృత్యః అని పిలిచాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.047722342733188726,
    "all_scores": {
      "Satavahana": 0.047722342733188726
    }
  },
  "126": {
    "paragraph": "ఆంధ్ర అనేది ఒక గిరిజన పేరు. ప్రస్తుత తెలుగు భూముల తెలంగాణ ఆంధ్ర ప్రదేశ్ ల లోని ప్రాదేశిక పేరు. ఈ ప్రాదేశిక సూచన శాతవాహనుల కాలం ముగిసిన తర్వాత మాత్రమే వాడుకలోకి వచ్చింది. అంటే ఆంధ్ర అనే పదం కేవలం ఆంధ్ర తెగను మాత్రమే సూచిస్తుంది ఋగ్వేదం ప్రకారం వీరు యమునా నది ఒడ్డున ఉత్తర భారతదేశంలో ఉద్భవించారు .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.0711864406779661,
    "all_scores": {
      "Satavahana": 0.0711864406779661
    }
  },
  "127": {
    "paragraph": "అంతేగానీ ఇది ప్రస్తుత ఆంధ్ర ప్రాంతాన్ని లేదా తెలుగు ప్రజలను సూచించదు. ఆంధ్రభృత్యులు ఆంధ్ర సేవకులు అనే పదం రెండు విషయాలను సూచించవచ్చు ఒకటి ఆంధ్రులు మౌర్యులు లేదా శుంగులకు సామంతులై ఉండవచ్చు. మరొకటి కొంతమంది పండితుల ప్రకారం ఇది ఆంధ్రా పాలకులకు చెందిన కొందరు సేవకులను సూచిస్తుంది. కొంతమంది పరిశోధకులు ఈ రాజవంశం ప్రస్తుత కర్ణాటకలో ఉద్భవించిందని ంలో కొంతమంది ఆంధ్ర పాలకులకు విధేయత చూపారని సూచిస్తున్నారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07537688442211056,
    "all_scores": {
      "Satavahana": 0.07537688442211056
    }
  },
  "128": {
    "paragraph": "ప్రస్తుత బళ్లారి జిల్లాలోని ప్రాదేశిక విభాగం శాతవాహని శాతహని శాతవాహనిహర లేదా శాతహని రత్తా శాతవాహన కుటుంబానికి మాతృభూమి అని వి.ఎస్. సుక్తాంకర్ సిద్ధాంతీకరించాడు. తొలి శాతవాహనులకు చెందిన శాసనం ఒక్కటి కూడా బళ్లారి జిల్లాలో లభించలేదని బళ్లారి జిల్లాలో ఉన్న ఏకైక శాతవాహన శాసనం శాతవాహన చరిత్ర తరువాతి దశకు చెందిన పులుమావిదని సూచిస్తూ డాక్టరు గోపాలాచారి సుక్తాంకర్ సిద్ధాంతాన్ని సవాలు చేశాడు. కర్ణాటకలోని కనగనహళ్లి గ్రామంలో సా.పూ.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05319148936170213,
    "all_scores": {
      "Satavahana": 0.05319148936170213
    }
  },
  "129": {
    "paragraph": "మొదటి శతాబ్దం సా.శ. మొదటి శతాబ్దం మధ్య కాలానికి చెందిన ఒక స్థూపంపై చిముకా సిముకా శాతకణి శాతకర్ణి ఇతర శాతవాహన పాలకుల చిత్రాలను వర్ణించే సున్నపురాయి ఫలకాలు ఉన్నాయి. చరిత్ర శాతవాహనుల గురించిన సమాచారాన్ని పురాణాలు కొన్ని బౌద్ధ జైన గ్రంథాలు రాజవంశం శాసనాలు నాణేలు వాణిజ్యంపై దృష్టి సారించే విదేశీ గ్రీకు రోమను వ్రాతల నుండి సేకరించారు. ఈ మూలాలు అందించిన సమాచారం రాజవంశం సంపూర్ణ చరిత్రను సంపూర్ణ నిశ్చయత్మకంగా పునర్నిర్మించడానికి సరిపోదు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.0382830626450116,
    "all_scores": {
      "Satavahana": 0.0382830626450116
    }
  },
  "130": {
    "paragraph": "ఫలితంగా శాతవాహన కాలక్రమం గురించి బహుళ సిద్ధాంతాలు ఉన్నాయి. స్థాపన . మూస మూస . నానేఘాటులోని శాతవాహన శాసనంలోని రాయల్సు జాబితాలో సిముకాను మొదటి రాజుగా పేర్కొన్నారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.13043478260869565,
    "all_scores": {
      "Satavahana": 0.13043478260869565
    }
  },
  "131": {
    "paragraph": "రాజవంశం మొదటి రాజు సంవత్సరాలు పరిపాలించాడని అతని పేరును సిషుకా సింధుకా చిస్మాకా షిప్రకా మొదలైనవిగా పేర్కొనాలని వివిధ పురాణాలు చెబుతున్నాయి. వ్రాతప్రతులను తిరిగి తిరిగి కాపీ చేసిన ఫలితంగా ఇవి సిముకా వికృత రూపబేధం ఏర్పడిందని అని విశ్వసిస్తున్నారు. అందుబాటులో ఉన్న సాక్ష్యాల ఆధారంగా సిముకా పేరును కూడా నిశ్చయంగా చెప్పలేము. కింది సిద్ధాంతాల ఆధారంగా శాతవాహన పాలన ం క్రీ.పూ.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05706521739130435,
    "all_scores": {
      "Satavahana": 0.05706521739130435
    }
  },
  "134": {
    "paragraph": "మత్స్య పురాణం ఆంధ్ర రాజవంశం సుమారు సంవత్సరాలు పరిపాలించినట్లు పేర్కొంది. వ శతాబ్దం ంలో శాతవాహన పాలన ముగిసినందున వారి పాలన ాన్ని క్రీస్తుపూర్వం వ శతాబ్దం నాటిదని భావిస్తున్నారు. మెగస్తనీసు రాసిన ఇండీకా క్రీస్తుపూర్వం అండారే అనే శక్తివంతమైన తెగ గురించి ప్రస్తావించింది. దీని రాజు పదాతిదళం అశ్వికదళం ఏనుగుల సైన్యాన్ని కలిగియున్నాడు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06382978723404255,
    "all_scores": {
      "Satavahana": 0.06382978723404255
    }
  },
  "135": {
    "paragraph": "అండారేను ఆంధ్రరాజుగా గుర్తించినట్లయితే ఇది క్రీస్తుపూర్వం వ శతాబ్దం నుండి మయ్యే శాతవాహన పాలనకు అదనపు సాక్ష్యంగా పరిగణించబడుతుంది. బ్రహ్మాండ పురాణం నలుగురు కాన్వారాజులు సంవత్సరాలు భూమిని పరిపాలిస్తుంది అని పేర్కొంది. అప్పుడు అది తిరిగి ఆంధ్రలకు వెళ్తుంది అని పేర్కొంది. ఈ ప్రకటన ఆధారంగా ఈ సిద్ధాంత ప్రతిపాదకులు మౌర్య పాలన తరువాత శాతవాహన పాలన మైందని తరువాత మద్యకాలంలో కన్వాల పాలన సాగిందని ఆ తరువాత శాతవాహన పాలన పునరుజ్జీవనం అని వాదించారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.0481651376146789,
    "all_scores": {
      "Satavahana": 0.0481651376146789
    }
  },
  "136": {
    "paragraph": "ఈ సిద్ధాంతంలో ఒక సంస్కరణ ఆధారంగా మౌర్యుల తరువాత సిముకా వచ్చాడు. సిద్ధాంతం వైవిధ్యం ఏమిటంటే కాన్వాలను పడగొట్టడం ద్వారా శాతవాహన పాలనను పునరుద్ధరించిన వ్యక్తి సిముకా పురాణాల సంకలనం అతన్ని రాజవంశం స్థాపకుడిగా భావించాయి. శాతవాహన పాలకుడు క్రీ.పూ. మొదటి శతాబ్దంలో మై సా.శ.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07924528301886793,
    "all_scores": {
      "Satavahana": 0.07924528301886793
    }
  },
  "139": {
    "paragraph": ". మూస మూస మూస సిముకా తరువాత అతని సోదరుడు కన్హా కృష్ణ అని కూడా పిలుస్తారు పశ్చిమాన నాసికు వరకు రాజ్యాన్నివిస్తరించాడు. ఆయన వారసుడు మొదటి శాతకర్ణి పశ్చిమ మాల్వా అనుపా నర్మదా లోయ విదర్భలను జయించాడు. తరువాత ఆయన ఉత్తర భారతదేశం మీద గ్రీకు దండయాత్రల వల్ల కలిగే గందరగోళాన్ని సద్వినియోగం చేసుకున్నాడు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.0410958904109589,
    "all_scores": {
      "Satavahana": 0.0410958904109589
    }
  },
  "140": {
    "paragraph": "అశ్వమేధ రాజసూయలతో సహా వేదకాల యాగాలు చేశాడు. బౌద్ధులకు బదులుగా ఆయన బ్రాహ్మణులను పోషించి వారికి గణనీయమైన సంపదను విరాళంగా ఇచ్చాడు. కళింగ రాజు ఖారవేలుడు హాథీగుంఫా శాసనం శాతకణి లేదా శతకమిని అనే రాజును గురించి ప్రస్తావించింది. వీరిలో కొందరు మొదటి శాతకర్ణిగా గుర్తించారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.09090909090909091,
    "all_scores": {
      "Satavahana": 0.09090909090909091
    }
  },
  "142": {
    "paragraph": "బెనర్జీ శైలేంద్ర నాథ్ సేన్ అభిప్రాయం ఆధారంగా ఖారవేల శాతకర్ణికి వ్యతిరేకంగా సైన్యాన్ని పంపించాడు. భగవాన్ లాల్ అభిప్రాయం ఆధారంగా శాతకర్ణి తన రాజ్యం మీద ఖారవేల దాడి చేయకుండా ఉండాలని కోరుకున్నాడు. అందువల్లన అతను గుర్రాలు ఏనుగులు రథాలు మనుషులను ఖారవేలునికి నివాళిగా పంపించాడు. సుధాకరు చటోపాధ్యాయ అభిప్రాయం ఆధారంగా శాతకర్ణికి వ్యతిరేకంగా ముందుకు సాగడంలో విఫలమైన తరువాత ఖరవేల సైన్యం తన మార్గాన్ని మళ్ళించింది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05970149253731343,
    "all_scores": {
      "Satavahana": 0.05970149253731343
    }
  },
  "143": {
    "paragraph": "అలైను డానియోలౌ అభిప్రాయం ఆధారంగా ఖారవేలుడు శాతకర్ణితో స్నేహంగా ఉన్నాడు. ఎటువంటి ఘర్షణలు లేకుండా ఆయన రాజ్యాన్ని దాటాడు. శాతకర్ణి వారసుడు రెండవ శాతకర్ణి సంవత్సరాలు పాలించాడు. ఈ సమయంలో ఆయన శుంగుల నుండి తూర్పు మాల్వాను స్వాధీనం చేసుకున్నాడు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.10126582278481011,
    "all_scores": {
      "Satavahana": 0.10126582278481011
    }
  },
  "144": {
    "paragraph": "ఇది సాంచి బౌద్ధ ప్రాంతంలో ప్రవేశించడానికి వీలు కల్పించింది. దీనిలో మౌర్య సామ్రాజ్యం నిర్మించిన స్థూపాలు షుంగా స్థూపాల చుట్టూ అలంకరించబడిన ద్వారాలను నిర్మించిన ఘనత ఆయనకు దక్కింది. రెండవ శాతకర్ణి సాంచిలోని శాసనం ద్వారా ప్రఖ్యాతి పొందాడు. అతని తరువాత లంబోదర వచ్చాడు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.045627376425855515,
    "all_scores": {
      "Satavahana": 0.045627376425855515
    }
  },
  "145": {
    "paragraph": "లంబోదర కుమారుడు వారసుడు అపిలకా నాణేలు తూర్పు మధ్యప్రదేశులో కనుగొనబడ్డాయి. సాంచి కళ శాతవాహనులు సాంచి బౌద్ధ స్థూపం అలంకారంలో పాల్గొన్నారు. ఇది రెండవ శాతకర్ణి రాజు కింద భారీగా మరమ్మతులు చేయబడింది. ద్వారలలో ఒకటైన బ్యాలస్ట్రేడు క్రీ.పూ తరువాత నిర్మించబడింది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.0632411067193676,
    "all_scores": {
      "Satavahana": 0.0632411067193676
    }
  },
  "146": {
    "paragraph": "ఇవి శాతవాహనులచే నియమించబడినట్లు భావిస్తున్నారు. రెండవ శాతకర్ణి రాజశిల్పి ఆనంద సృష్టించినది అని దక్షిణ ద్వారం మీద ఒక శాసనం నమోదు చేసింది. శాతవాహన చక్రవర్తి శాతకర్ణి హస్థకళాఖండం దక్షిణ ద్వారం అగ్రశ్రేణి చట్రం ఒక బహుమతిగా ఒక శాసనం నమోదు చేస్తుంది రాజా సిరి శాతకర్ణి కళాఖండం ఫోర్మాను అయిన వసితి కుమారుడు ఆనంద బహుమతి . .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05238095238095238,
    "all_scores": {
      "Satavahana": 0.05238095238095238
    }
  },
  "150": {
    "paragraph": ". . . నహాపనా నాయకత్వంలో మొదటి పశ్చిమ సాత్రపాల దండయాత్ర ఒక కుంతల శాతకర్ణి గురించి గుప్త సూచనలు మినహా అపిలకా వారసుల గురించి పెద్దగా తెలియదు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.08695652173913043,
    "all_scores": {
      "Satavahana": 0.08695652173913043
    }
  },
  "151": {
    "paragraph": "రాజవంశం తరువాతి ప్రసిద్ధ పాలకుడు హేలా మహారాష్ట్ర ప్రాకృతంలో గహా సత్తసాయిని స్వరపరిచాడు. హాలుడి మాదిరిగా ఆయన నలుగురు వారసులు కూడా చాలా తక్కువ కాలం మొత్తం సంవత్సరాలు పరిపాలించారు. ఇది శాతవాహనులకు సమస్యాత్మక సమయాన్ని సూచిస్తుంది. శాసనాలు నాణేల ఆధారాలు శాతవాహనులు ఇంతకుముందు ఉత్తర దక్కను పీఠభూమి ఉత్తర కొంకణ తీర మైదానాలను నియంత్రించారని ఈ రెండు ప్రాంతాలను కలిపే పర్వత మార్గాలను నియంత్రించారని సూచిస్తుంది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.04488778054862843,
    "all_scores": {
      "Satavahana": 0.04488778054862843
    }
  },
  "152": {
    "paragraph": "సమయంలో వారి ఉత్తరప్రాంత పొరుగువారు పశ్చిమ క్షత్రపాలు ఈ ప్రాంతాలలో వారి ప్రభావాన్ని విస్తరించారు. పాశ్చాత్య క్షత్ర పాలకుడు నహాపన తన రాజప్రతినిధి అల్లుడు రిషభదత్త శాసనాలు ధ్రువీకరించినట్లుగా మాజీ శాతవాహన భూభాగాన్ని పరిపాలించినట్లు తెలుస్తుంది. మొదటి పునరుద్ధరణ . .",
    "kingdoms": [
      "Satavahana",
      "Rashtrakuta"
    ],
    "confidence": 0.08015267175572519,
    "all_scores": {
      "Satavahana": 0.08015267175572519,
      "Rashtrakuta": 0.05725190839694656
    }
  },
  "154": {
    "paragraph": "శాతవాహన శక్తిని గౌతమిపుత్ర శాతకర్ణి పునరుద్ధరించాడు. ఆయన శాతవాహన పాలకులలో గొప్పవాడిగా పరిగణించబడ్డాడు చార్లెసు హిగ్హాం తన పాలనను సుమారు . ఎస్. నాగరాజు పాలన నాటిది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.10122699386503067,
    "all_scores": {
      "Satavahana": 0.10122699386503067
    }
  },
  "157": {
    "paragraph": "ఖఖరత కుటుంబాన్ని నహాపన క్షారత కుటుంబం పాతుకుపోయిన వారు శాతవాహన జాతి కీర్తిని పునరుద్ధరించారు. నాసికు లోని పాండవ్లేని గుహల గుహ నెం . వద్ద రాజమాత గౌతమి బాలాశ్రీ వివరణ. గౌతమిపుత్ర తరువాత అతని కుమారుడు వసిష్టిపుత్ర శ్రీ పులమావి లేదా పులుమయి వచ్చారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.08571428571428572,
    "all_scores": {
      "Satavahana": 0.08571428571428572
    }
  },
  "158": {
    "paragraph": "శైలేంద్ర నాథ్ సేన్ అభిప్రాయం ఆధారంగా పులుమావి సా.శ.. నుండి పరిపాలించారు. చార్లెసు హిఘం అభిప్రాయం ఆధారంగా సా.శ.. లో సింహాసనాన్ని అధిష్టించాడు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.0851063829787234,
    "all_scores": {
      "Satavahana": 0.0851063829787234
    }
  },
  "159": {
    "paragraph": "పెద్ద సంఖ్యలో శాతవాహన శాసనాలలోని పులుమావి చిహ్నాలతో నాణేలు రాజ్యమంతటా పంపిణీ చేయబడ్డాయి. ఆయన గౌతమిపుత్ర భూభాగాన్ని కొనసాగించాడని రాజ్యాన్ని సుసంపన్నంగా పరిపాలించాడని ఇది సూచిస్తుంది. అతను బళ్లారి ప్రాంతాన్ని శాతకర్ణి రాజ్యంలో చేర్చాడని నమ్ముతారు. కోరమాండలు తీరంలో డబులు మాస్టు ఉన్న నౌకలను కలిగి ఉన్న అతని నాణేలు సముద్ర వాణిజ్యం నావికా శక్తిలో పాల్గొనడాన్ని సూచిస్తున్నాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.04032258064516129,
    "all_scores": {
      "Satavahana": 0.04032258064516129
    }
  },
  "160": {
    "paragraph": "అమరావతిలో పాత స్థూపం అతని పాలనలో పునరుద్ధరించబడింది. మొదటి రుద్రదామను నాయకత్వంలో రెండవ సాత్రపాల దండయాత్ర . పులుమావి వారసుడు అతని సోదరుడు వశిశ్ఠిపుత్ర శాతకర్ణి. ఎస్.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.09146341463414635,
    "all_scores": {
      "Satavahana": 0.09146341463414635
    }
  },
  "162": {
    "paragraph": "మొదటి రుద్రాదమను జునాగఢు శాసనం ఆయన దక్షిణాపథ దక్కను ప్రభువు శాతకర్ణిని రెండుసార్లు ఓడించాడని పేర్కొంది. దగ్గరి సంబంధాల కారణంగా ఆయన ఓడిపోయిన పాలకుడి ప్రాణాలతో విడిచిపెట్టాడని కూడా ఇది పేర్కొంది మంచి నివేదికను పొందిన రుద్రదామను ... ఆయన రెండుసార్లు న్యాయమైన పోరాటంలో దక్షిణాపాథ ప్రభువు అయిన శాతకర్ణిని పూర్తిగా ఓడించినప్పటికీ వారి దగ్గర సంబంధం కారణంగా అతనిని నాశనం చేయలేదు. జునాగఢు శాసనం.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06233766233766234,
    "all_scores": {
      "Satavahana": 0.06233766233766234
    }
  },
  "163": {
    "paragraph": "డి. ఆర్. భండార్కరు దినేషుచంద్ర సర్కారు ప్రకారం రుద్రదామను చేతిలో గౌతమిపుత్ర శాతకర్ణి ఓడిపోయినప్పటికీ ఓడిపోయిన పాలకుడు ఆయన కుమారుడు వశిష్టపుత్ర పులుమావి అని . .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07547169811320756,
    "all_scores": {
      "Satavahana": 0.07547169811320756
    }
  },
  "164": {
    "paragraph": "రాప్సను విశ్వసించాడు. ఓడిపోయిన పాలకుడు వశిష్టిపుత్ర వారసుడు శివస్కంద లేదా శివశ్రీ పులుమాయి లేదా పులుమావి అని శైలేంద్ర నాథు సేన్ చార్లెసు హిఘం విశ్వసించారు. జునాగఢు శాసనం. తన విజయాల ఫలితంగా రుద్రాదమను పూహే నాసికు తీవ్రమైన దక్షిణ భూభాగాలను మినహాయించి గతంలో నహాపన చేతిలో పట్టుబడిన అన్ని పూర్వ భూభాగాలను తిరిగి పొందాడు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.0380952380952381,
    "all_scores": {
      "Satavahana": 0.0380952380952381
    }
  },
  "165": {
    "paragraph": "శాతవాహన ఆధిపత్యాలు అమరావతి చుట్టూ దక్కను తూర్పు మధ్య భారతదేశంలో వాటి అసలు స్థావరానికి పరిమితం చేయబడ్డాయి. రెండవ పునరుద్ధరణ . ప్రధాన శాతవాహన రాజవంశానికి చెందిన ి వ్యక్తి శ్రీ యజ్ఞ శాతకర్ణి క్లుప్తంగా శాతవాహన పాలనను పునరుద్ధరించారు. ఎస్.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.061702127659574474,
    "all_scores": {
      "Satavahana": 0.061702127659574474
    }
  },
  "168": {
    "paragraph": "ఆయన పాశ్చాత్య క్షత్రపాలు కోల్పోయిన భూభాగాన్ని చాలావరకు తిరిగి పొంది వారిని అనుకరిస్తూ వెండి నాణేలను జారీ చేశాడు. ఆయన పాలన ి సంవత్సరాలలో అభిరాలు రాజ్యం ఉత్తర భాగాలను నాసికు ప్రాంతం చుట్టూ స్వాధీనం చేసుకున్నాడు. పతనం యజ్ఞ శాతకర్ణి తరువాత బహుశా కేంద్రీయ శక్తి క్షీణించిన కారణంగా రాజవంశం దాని భూస్వామ్యవాదుల అభివృద్ధి ఫలితంగా త్వరగా పతనం అయింది. మరోవైపు పశ్చిమ సాత్రపాలు గుప్త సామ్రాజ్యం ప్రభావంతో అంతరించిపోయే వరకు తరువాత రెండు శతాబ్దాలుగా అభివృద్ధి చెందుతూనే ఉన్నాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.025806451612903226,
    "all_scores": {
      "Satavahana": 0.025806451612903226
    }
  },
  "169": {
    "paragraph": "యజ్ఞశ్రీ తరువాత మాధారిపుత్ర స్వామి ఈశ్వరసేన ఆధికారానికి వచ్చాడు. తదుపరి రాజు విజయ సంవత్సరాలు పరిపాలించాడు. ఆయన కుమారుడు వశిష్టీపుత్ర శ్రీ చాధశాతకర్ణి సంవత్సరాలు పరిపాలించాడు. ప్రధాన శ్రేణి ి రాజు పులుమావి సి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.057692307692307696,
    "all_scores": {
      "Satavahana": 0.057692307692307696
    }
  },
  "170": {
    "paragraph": ". ఆయన పాలనలో నాగార్జునకొండ అమరావతిలో అనేక బౌద్ధ స్మారక కట్టడాలు నిర్మించబడ్డాయి. మధ్యప్రదేశ్ కూడా అతని రాజ్యంలో భాగంగా ఉంది. వ పులుమావి మరణం తరువాత శాతవాహన సామ్రాజ్యం ఐదు చిన్న రాజ్యాలుగా విభజించబడింది ఉత్తర భాగం శాతవాహనుల అనుషంగిక శాఖచే పాలించబడుతుంది ఇది వ శతాబ్దం ంలో ముగిసింది నాసికు చుట్టూ పశ్చిమ భాగం అభిరాకు పాలనలో ఉంది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06192660550458716,
    "all_scores": {
      "Satavahana": 0.06192660550458716
    }
  },
  "172": {
    "paragraph": "మూస . ఉత్తర దక్కను ప్రాంతం శాతవాహన భూభాగంలో ఉంది. ఇది ప్రస్తుత ఆంధ్రప్రదేశ్ మహారాష్ట్ర తెలంగాణ రాష్ట్రాలలో విస్తరించి ఉంది. కొన్ని సమయాలలో వారి పాలన ప్రస్తుత గుజరాతు కర్ణాటక మధ్యప్రదేశ్ వరకు కూడా విస్తరించింది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.1,
    "all_scores": {
      "Satavahana": 0.1
    }
  },
  "173": {
    "paragraph": "గౌతమిపుత్ర శాతకర్ణి తల్లి గౌతమి బాలశ్రీ జారీ చేసిన నాసికు ప్రశస్తి శాసనం తన కుమారుడు ఉత్తరాన గుజరాతు నుండి దక్షిణాన ఉత్తర కర్ణాటక వరకు విస్తరించి ఉన్న విస్తృతమైన భూభాగాన్ని పరిపాలించాడని పేర్కొంది. ఈ భూభాగాల మీద గౌతమిపుత్రకు సమర్థవంతమైన నియంత్రణ ఉందా అనేది స్పష్టంగా లేదు. ఏదేమైనా ఈ భూభాగాలపై అతని నియంత్రణ ఎక్కువ కాలం కొనసాగలేదని చారిత్రక ఆధారాలు సూచిస్తున్నాయి. అంతేకాకుండా ఈ రాజ్యం నిరంతరాయంగా లేదు ఈ ప్రాంతంలలోని చాలా ప్రాంతాలు వేటగాళ్ళు ఇతర గిరిజన వర్గాల నియంత్రణలో ఉన్నాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.025052192066805843,
    "all_scores": {
      "Satavahana": 0.025052192066805843
    }
  },
  "174": {
    "paragraph": "శాతవాహన రాజధాని కాలంతో మారుతూనే ఉంది. నాసికు శాసనం గౌతమిపుత్రను బెనకటక ప్రభువుగా అభివర్ణిస్తుంది. ఇది అతని రాజధాని పేరు అని సూచిస్తుంది. టోలెమీ వ శతాబ్దం ప్రతిష్ఠన ఆధునిక పైథాను ను పులుమావి రాజధానిగా పేర్కొన్నాడు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07746478873239437,
    "all_scores": {
      "Satavahana": 0.07746478873239437
    }
  },
  "175": {
    "paragraph": "ఇతర సమయాలలో శాతవాహన రాజధానులలో అమరావతి ధరణికోట జూన్నారు ఉన్నాయి. ఎం. కె. ధవాలికరు అసలు శాతవాహన రాజధాని జూన్నారు వద్ద ఉందని సిద్ధాంతీకరించారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.11170212765957446,
    "all_scores": {
      "Satavahana": 0.11170212765957446
    }
  },
  "176": {
    "paragraph": "కాని వాయవ్య దిశ నుండి శకులు కుషాణుల చొరబాట్ల కారణంగా ప్రతిష్ఠానకు మార్చవలసి వచ్చింది. అనేక శాతవాహన యుగ శాసనాలు మత ఆశ్రమాలకు నిధులను కేటాయించాయి. ఈ శాసనాలలో దాతల నివాసాలుగా ఎక్కువగా ప్రస్తావించబడిన స్థావరాలలో సోపారా కల్యాణి భారుచా గుర్తించబడని చౌలు సముద్ర ఓడరేవులు ఉన్నాయి. ఎక్కువగా పేర్కొన్న లోతట్టు స్థావరాలలో ధెనుకాకట గుర్తించబడనివి జూన్నారు నాసికు పైథాను కరాదు ఉన్నాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.04838709677419355,
    "all_scores": {
      "Satavahana": 0.04838709677419355
    }
  },
  "177": {
    "paragraph": "పశ్చిమ దక్కను లోని ఇతర ముఖ్యమైన శాతవాహన ప్రదేశాలలో గోవర్ధన నెవాసా టెరు వడ్గావు మాధవ్పూరు ఉన్నారు. తూర్పు దక్కనులో అమరావతి ధులికట్ట కోటలింగల పెద్దాబంకూరు ఉన్నాయి. నిర్వహణావిధానం శాతవాహనులు శాస్త్రాలు ఆధారిత విధానాలతో పరిపాలన మార్గదర్శకాలను అనుసరించారు. వారి ప్రభుత్వం మౌర్యపాలన కంటే తక్కువ స్థిరత్వం కలిగి ఉంది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.049999999999999996,
    "all_scores": {
      "Satavahana": 0.049999999999999996
    }
  },
  "179": {
    "paragraph": "మహాసేనపతి రెండవ పులుమావి పాలనలో పౌరనిర్వహణాధికారి పులుమావి పాలనలో కింద జనపద ప్రతినిధులు నియమించబడ్డారు మహాతలవర గొప్ప కాపలాదారు రాజకుమారులు కుమారాలు భూభాగాల ప్రతినిధులుగా నియమించబడ్డారు. శాతవాహన రాజకీయాల అతిపెద్ద భౌగోళిక ఉపవిభాగం అహారా . అహారాలను పాలించటానికి నియమించబడిన గవర్నర్ల పేర్లను అనేక శాసనాలు సూచిస్తాయి ఉదా. గోవర్ధనహర మామలహర సతవనిహర కపురహర .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.04714285714285714,
    "all_scores": {
      "Satavahana": 0.04714285714285714
    }
  },
  "180": {
    "paragraph": "శాతవాహనులు అధికారిక పరిపాలనా ఆదాయ సేకరణ నిర్మాణ విధానాన్ని నిర్మించడానికి ప్రయత్నించారని ఇది సూచిస్తుంది. గౌతమిపుత్ర శాతకర్ణి శాసనాలు ఒక పెట్టుబడిదారి విధాన ఉనికిని సూచిస్తున్నాయి. అయినప్పటికీ ఈ నిర్మాణం ఎంత స్థిరంగా ప్రభావవంతంగా ఉందో తెలియదు. ఉదాహరణకు నాసికు గుహ లోని రెండు శాసనాలలో సన్యాసి వర్గాలకు వ్యవసాయ భూమిని విరాళంగా ఇచ్చారని సూచిస్తున్నాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.045845272206303724,
    "all_scores": {
      "Satavahana": 0.045845272206303724
    }
  },
  "182": {
    "paragraph": "ఈ చార్టరును లోటా అనే మహిళ ఆమోదించినట్లుగా పేర్కొంది. పురావస్తు శాస్త్రవేత్త జేముస్ బర్గెసు వివరణ ఆధారంగా గౌతమిపుత్ర తల్లి ప్రధాన సేవకురాలుగా భావిస్తున్నారు. శాతవాహన యుగ శాసనాలు నాగరా నగరం నిగామా మార్కెటు పట్టణం గామా గ్రామం అనే మూడు రకాల స్థావరాలను పేర్కొన్నాయి. ఆర్థికం .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07749077490774908,
    "all_scores": {
      "Satavahana": 0.07749077490774908
    }
  },
  "183": {
    "paragraph": "వ్యవసాయం తీవ్రతరం చేయడంతో ఇతర వస్తువుల ఉత్పత్తి అధికరించిన కారణంగా శాతవాహనులు భారత ఉపఖండంలో వెలుపల వాణిజ్యం వంటి ఆర్థిక విస్తరణలో పాల్గొన్నారు ప్రయోజనం పొందారు . శాతవాహనుల కాలంలో సారవంతమైన నదీతీరాల వెంట ముఖ్యంగా ప్రధాన నదీతీరాల వెంట బృహత్తరమైన స్థావరాలు స్థాపించబడ్డాయి. అడవుల నిర్మూలన ఆనకట్టల నిర్మాణం వ్యవసాయ భూముల విస్తీర్ణం అధికరించింది. శాతవాహన కాలంలో ఖనిజ వనరుల ప్రాంతాలు బాగా ఉపయోగించి ఉండవచ్చు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.04477611940298508,
    "all_scores": {
      "Satavahana": 0.04477611940298508
    }
  },
  "184": {
    "paragraph": "ఈ ప్రాంతాలలో కొత్త స్థావరాలు వెలుగులోకి వచ్చాయి. ఇటువంటి ప్రాంతాలలో వాణిజ్యం చేతిపనులను సిరామికు సామాను వంటివి సులభతరం చేశాయి. శాతవాహన కాలంలో పెరిగిన చేతిపనుల ఉత్పత్తి కోటలింగాల వంటి ప్రదేశాలలో పురావస్తు పరిశోధనల నుండి లభించిన వస్తువులు సాక్ష్యంగా ఉన్నాయి. అలాగే హస్తకళాకారుల గురించి ఎపిగ్రాఫికు సూచనల ఆధారంగా స్పష్టంగా తెలుస్తుంది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06325301204819277,
    "all_scores": {
      "Satavahana": 0.06325301204819277
    }
  },
  "185": {
    "paragraph": "శాతవాహనులు భారత సముద్ర తీరాన్ని నియంత్రించారు. ఫలితంగా వారు రోమను సామ్రాజ్యంతో పెరుగుతున్న భారతీయ వాణిజ్యాన్ని ఆధిపత్యం చేశారు. ఎరిథ్రేయను సముద్ర పెరిప్లసు రెండు ముఖ్యమైన శాతవాహన వాణిజ్య కేంద్రాల గురించి ప్రస్తావించింది ప్రతిష్ఠనా ఠగర. ఇతర ముఖ్యమైన పట్టణ కేంద్రాలలో కొండపూరు బనవాసి మాధవపూరు ఉన్నాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.060200668896321065,
    "all_scores": {
      "Satavahana": 0.060200668896321065
    }
  },
  "186": {
    "paragraph": "శాతవాహన రాజధాని ప్రతిష్ఠానపురాన్నిను సముద్రంతో అనుసంధానించే ఒక ముఖ్యమైన ప్రదేశంగా నానాఘాటు ఉంది. మతం . . .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.169811320754717,
    "all_scores": {
      "Satavahana": 0.169811320754717
    }
  },
  "187": {
    "paragraph": "శాతవాహనులు హిందువులుగా బ్రాహ్మణ హోదాను పొందారు అయినప్పటికీ వారు బౌద్ధ మఠాలకు ఉదారంగా విరాళాలు ఇచ్చారు. శాతవాహన కాలంలో సామాన్య ప్రజలు సాధారణంగా ఒక నిర్దిష్ట మత సమూహానికి ప్రత్యేకంగా మద్దతు ఇవ్వలేదు. బౌద్ధ సన్యాసి గుహ గోడల మీద నమోదు చేయబడిన నయనికా నానఘాటు శాసనం ఆమె భర్త మొదటి శాతకర్ణి అశ్వమేధ యాగం రాజసూయ యాగం అగ్న్యాధేయ యాగం వంటి అనేక వేదకాల యాగాలను చేశారని పేర్కొంది. ఈ యాగాలకు బ్రాహ్మణ పూజారులకు హాజరైన వారికి చెల్లించిన గణనీయమైన రుసుమును శాసనం నమోదు చేస్తుంది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.03455723542116631,
    "all_scores": {
      "Satavahana": 0.03455723542116631
    }
  },
  "189": {
    "paragraph": "అయినప్పటికీ ఆర్. జి. భండార్కరు ఈ పదాన్ని బ్రాహ్మణుల ఏకైక రక్షకుడు అని వ్యాఖ్యానించాడు. శాతవాహన కాలంలో దక్కను ప్రాంతంలో అనేక బౌద్ధ సన్యాసుల ప్రదేశాలు వెలువడ్డాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.13043478260869565,
    "all_scores": {
      "Satavahana": 0.13043478260869565
    }
  },
  "190": {
    "paragraph": "ఏదేమైనా ఈ మఠాలు శాతవాహన ప్రభుత్వం మధ్య ఉన్న సంబంధాలు స్పష్టంగా లేవు. కన్హా పాలనలో జారీ చేసిన పాండవ్లేని గుహల శాసనం ఈ గుహను శ్రమణుల వేదయేతర సన్యాసులు మహా మత్రా ఆఫీసర్ ఇన్ ఛార్జ్ ఆధ్వర్యంలో తవ్వినట్లు పేర్కొంది. దీని ఆధారంగా కన్హా బౌద్ధమతం వైపు మొగ్గు చూపారని. బౌద్ధ సన్యాసుల సంక్షేమానికి అంకితమైన పరిపాలనా విభాగాన్ని కలిగి ఉన్నారని సుధాకరు చటోపాధ్యాయ తేల్చిచెప్పారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.057534246575342465,
    "all_scores": {
      "Satavahana": 0.057534246575342465
    }
  },
  "191": {
    "paragraph": "ఏదేమైనా కార్లా ఎం. సినోపోలి బౌద్ధ మఠాలకు శాతవాహన రాజులు విరాళాలు ఇచ్చినట్లు కొన్ని రికార్డులు ఉన్నప్పటికీ చాలావరకు విరాళాలు ఇతర ప్రముఖులు చేసినట్లు పేర్కొన్నారు. ఈ దాతలలో సర్వసాధారణం వ్యాపారులు చేసినట్లు భావిస్తున్నారు. చాలా మఠాలు ముఖ్యమైన వాణిజ్య మార్గాల్లో ఉన్నాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07865168539325842,
    "all_scores": {
      "Satavahana": 0.07865168539325842
    }
  },
  "192": {
    "paragraph": "వ్యాపారులు బహుశా మఠాలకు విరాళం ఇచ్చారు. ఎందుకంటే ఈ స్థలాలు విశ్రాంతి గృహాలుగా పనిచేస్తూ వాణిజ్యంలో ప్రత్యక్షంగా పాల్గొనడం ద్వారా వాణిజ్యాన్ని సులభతరం చేశాయి. బౌద్ధేతరులకు ముఖ్యంగా బ్రాహ్మణులకు చేసిన విరాళాలతో సహా స్వచ్ఛంద విరాళాలను ప్రదర్శించడానికి ఈ మఠాలు ఒక ముఖ్యమైన వేదికగా కనిపిస్తాయి. నుడి శాతవాహన శాసనాలు నాణెం ఇతిహాసాలు నడిమి ఇండో ఆర్యను నుడులలో ఉన్నాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05817174515235457,
    "all_scores": {
      "Satavahana": 0.05817174515235457
    }
  },
  "193": {
    "paragraph": "ఈ నుడిని కొంతమంది ఇటీవలి పండితులు ప్రాకృతం అని పిలుస్తారు. కాని ప్రాకృత అనే మాటను విస్తృతంగా నిర్వచించినట్లయితే మటుకే ఈ పదజాలం సరైనదిగా పరిగణించబడుతుంది. మధ్య ఇండో ఆర్యన్ నుడి పూర్తిగా సంస్కృతం కాదు . శాతవాహన రాజు హాలా గురించిన కథనాలున్న గహా సత్తసాయి సంకలనంలో వాడిన సాహిత్య ప్రాకృతం కంటే శాసనాల నుడి వాస్తవానికి సంస్కృతానికి దగ్గరగా ఉంది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.062130177514792904,
    "all_scores": {
      "Satavahana": 0.062130177514792904
    }
  },
  "194": {
    "paragraph": "శాతవాహనులు చాలా అరుదుగా రాజకీయ శిలాశాసనాలలో సంస్కృతాన్ని వాడినారు. నాసికు ప్రషస్తికి దగ్గరగా ఉన్న గౌతమిపుత్ర శాతకర్ణి సంబంధిత ఒక శిలాశాసనం చనిపోయిన రాజును బహుశా గౌతమీపుత్ర వివరించడానికి వసంత తిలకమిత్రలోని సంస్కృత శ్లోకాలను ఉపయోగిస్తుంది. సన్నాటి వద్ద ఉన్న ఒక సంస్కృత శాసనం గౌతమిపుత్ర శాతకర్ణిని సూచిస్తుంది. వారికి సంబంధించిన ఒకానొక నాణెంలో సంస్కృత పురాణం కూడా ఉంది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.054644808743169404,
    "all_scores": {
      "Satavahana": 0.054644808743169404
    }
  },
  "195": {
    "paragraph": "శాతవాహనులు ఒక వైపు మధ్య ఇండో ఆర్యన్ భాషను మరోవైపు ఆది తెలుగు నుడిని కలిగి ఉన్న ద్విభాషా నాణేలను కూడా విడుదల చేశారు. శిలాశాసనాలు . . .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.13533834586466165,
    "all_scores": {
      "Satavahana": 0.13533834586466165
    }
  },
  "196": {
    "paragraph": ". శాతవాహన కాలం నుండి అనేక బ్రాహ్మి లిపి శాసనాలు అందుబాటులో ఉన్నాయి. అయితే వీటిలో చాలావరకు వ్యక్తిగతంగా బౌద్ధ సంస్థలకు ఇచ్చిన విరాళాల సంబంధిత వివరాలు మినహా రాజవంశం గురించి ఎక్కువ సమాచారం ఇవ్వవు. శాతవాహన రాజులు జారీ చేసిన ప్రధానంగా మతపరమైన విరాళాలకు సంబంధించిన శాసనాలు కొన్నింటిలో పాలకుల గురించి సామ్రాజ్య నిర్మాణం గురించి కొంత సమాచారం ఉంటుంది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06140350877192982,
    "all_scores": {
      "Satavahana": 0.06140350877192982
    }
  },
  "197": {
    "paragraph": "నాసికు వ గుహలో లభించిన శిలాశాసనం అన్నింటికంటే పురాతనం ఈ గుహ కంహా కాలంలో ఉన్న మహామాత్రా సమను నాసికు నివాసితమని సూచిస్తుంది. నానేఘాటు వద్ద శాతకర్ణి భార్య అయిన నయనికా జారీ చేసిన శాసనం కనుగొనబడింది. ఇది మొదటి నాయనికా వంశాన్ని నమోదు చేస్తుంది. రాజ కుటుంబం చేసిన వేదకాల యాగాలను ప్రస్తావించింది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.041666666666666664,
    "all_scores": {
      "Satavahana": 0.041666666666666664
    }
  },
  "198": {
    "paragraph": "నానేఘాటులోని మరో శాసనం శాతవాహన రాజుల పేర్లను కలిగి ఉంది. వాటి బాస్ రిలీఫ్ పోర్ట్రెయిట్లపై లేబులుగా కనిపిస్తుంది. చిత్తరువులు ఇప్పుడు పూర్తిగా క్షీణించాయి. కాని శాసనం పాలియోగ్రాఫికు ప్రాతిపదికన నాయనికా శాసనానికి సమకాలీనమని నమ్ముతారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.09051724137931035,
    "all_scores": {
      "Satavahana": 0.09051724137931035
    }
  },
  "199": {
    "paragraph": "తరువాతి పురాతన శాతవాహన యుగం శాసనం సాంచి వద్ద మొదటి స్థూపం శిల్పకళా గేట్వే మూలకం మీద కనిపిస్తుంది. సిరి శాతకర్ణి శిల్పకారుల ఫోర్మాను కుమారుడు ఆనంద ఈ మూలకాన్ని దానం చేసినట్లు పేర్కొంది. ఈ శాసనం బహుశా రెండవ శాతకర్ణి పాలన కాలానికి చెందినదై ఉంటుందని భావించబడుతుంది. నాణేలు .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06133828996282528,
    "all_scores": {
      "Satavahana": 0.06133828996282528
    }
  },
  "200": {
    "paragraph": ". . మూస . మూస గౌతమిపుత్ర శాతకర్ణి రాజుతో మొదలుపెట్టి వారి పాలకుల చిత్రాలతో తమ సొంత నాణేలను జారీ చేసిన తొలి భారతీయ పాలకులు శాతవాహనులు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.12030075187969924,
    "all_scores": {
      "Satavahana": 0.12030075187969924
    }
  },
  "201": {
    "paragraph": "ఆయన ఓడించిన పడమటి క్షత్రపాల నుండి ఈ పద్ధతి తీసుకోబడింది. పడమటి సాత్రపాలు వాయవ్య దిక్కులో ఇండో గ్రీకు రాజుల నాణేల లక్షణాలను అనుసరిస్తున్నారు. దక్కను ప్రాంతంలో శాతవాహన కాలానికి చెందిన సీసం రాగి పోటిను లోహాలతో జారీచేసిన వేలాది నాణేలు కనుగొనబడ్డాయి కొన్ని బంగారు వెండి నాణేలు కూడా అందుబాటులో ఉన్నాయి. ఈ నాణేలు ఏకరీతి రూపకల్పన లేదా పరిమాణాన్ని కలిగి ఉండవు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.059829059829059825,
    "all_scores": {
      "Satavahana": 0.059829059829059825
    }
  },
  "202": {
    "paragraph": "శాతవాహన భూభాగంలో చాలా సభా స్థానాలు ఉన్నాయని సూచిస్తున్నాయి. ఇది నాణేల్లో ప్రాంతీయ వ్యత్యాసాలకు దారితీస్తుంది. శాతవాహనుల నాణాలు అన్ని చోటులలో అన్ని కాలాలలో మినహాయింపు లేకుండా ప్రాకృత మాండలికాన్ని వాడినాయి. అదనంగా కొన్ని ఒకవైపు ద్రావిడ మరొకవైపు ప్రాకృత నుడులతో అచ్చివేయబడిన నాణాలు కూడా ఉన్నాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07191780821917808,
    "all_scores": {
      "Satavahana": 0.07191780821917808
    }
  },
  "203": {
    "paragraph": "తెలుగు నుడి మాదిరిగానే ద్రావిడ లిపిలో ఉన్నాయి. కొన్ని వైవిధ్యాలకు బ్రాహ్మి లిపి మాదిరిగానే . మిక్కిలి నాణేలు చాలా పాలకుల ఉదా. శాతవాహన శాతకర్ణి పులుమావి సాధారణమైన శీర్షికలు లేదా మాట్రానింలను కలిగి ఉంటాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07389162561576355,
    "all_scores": {
      "Satavahana": 0.07389162561576355
    }
  },
  "204": {
    "paragraph": "కాబట్టి నాణేల ద్వారా ధ్రువీకరించబడిన పాలకుల లెక్కను కచ్చితంగా నిర్ణయించలేము. మంది పాలకుల పేర్లు వివిధ నాణేల మీద కనిపిస్తాయి. ఈ పాలకులలో కొందరు శాతవాహన చక్రవర్తుల కంటే స్థానిక ఉన్నతవర్గాలుగా కనిపిస్తారు. శాతవాహన నాణేలు వాటి కాలక్రమం నుడి ముఖ లక్షణాలకు గిరజాల జుట్టు పొడవాటి చెవులు బలమైన పెదవులు ప్రత్యేకమైన సూచనలు ఇస్తాయి.",
    "kingdoms": [
      "Satavahana",
      "Rashtrakuta"
    ],
    "confidence": 0.06542056074766354,
    "all_scores": {
      "Satavahana": 0.06542056074766354,
      "Rashtrakuta": 0.04672897196261682
    }
  },
  "205": {
    "paragraph": "వారు ప్రధానంగా సీసం రాగి నాణేలను జారీ చేశారు వారి పోర్ట్రెయిటు మాదిరి వెండి నాణేలు సాధారణంగా పడమటి క్షత్ర రాజుల నాణేల మీద అచ్చివేయబడ్డాయి. శాతవాహన నాణేలు ఏనుగులు సింహాలు గుఱ్ఱాలు చైత్యాలు స్థూపాలు వంటి వివిధ సాంప్రదాయ గుర్తులను కూడా చూపిస్తాయి. అలాగే ఉజ్జయిని గుర్తు నాలుగు వృత్తాలు కలిగిన శిలువ. శాతవాహనుల నాణెములు శతసహస్రములు దిరికినవి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.062130177514792904,
    "all_scores": {
      "Satavahana": 0.062130177514792904
    }
  },
  "207": {
    "paragraph": "వీటిలో శిముక శాతవాహనుని నాణెములు లేఖనములయందు సాతవాహనస సతవాహణస సిరిచిముకసాతవాహన అను పేరుకల నాణెములు ఉన్నాయి. అందు నావాసా వద్ద దొరికిన సంఖ్యగల నాణెములు మరొకొన్ని హైదరాబాదు ఔరంగాబాదు ఓరుగల్లు కరీంనగర్ కోటిలింగాల వద్ద దొరికినాయి. కృష్ణశాతకరి నాణెములు ఈనాణెముల లేఖనములయందు రాజ్ఞః శ్రీకృష్ణశాతకర్ణి పేరు ఉంది. ఇవి మహారాష్ట్రలో కల నవాసా చంద మండలములయందు దొరికినవి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.046348314606741575,
    "all_scores": {
      "Satavahana": 0.046348314606741575
    }
  },
  "208": {
    "paragraph": "శ్రీశాతకర్ణి నాణెములు సిరిసాతకణిస సిరిపాతకణస అను లేఖనములు గల అనేకనాణెములు ఉన్నాయి.అవి రాజ్ఞః శ్రీశాతకర్ణ రాజుయొక్క నాణెములు.ఇవి పడమటి భారత ప్రదేశాల్లో దొరికిన సంఖ్యల నాణెములు. ఇవి కొండపూర్ నాసిక్ ఉజ్జయిని త్రిపురి కథియవాడ్ బాలాపూర్ అమరావతి చేబ్రోలు మాచెర్ల నాగార్జునకొండ మొదలయిన చోట్లలో దొరికినవి. నాగనికా శ్రీశాతకర్ణుల వెండినాణెములు జూన్నార దగ్గర దొరికిన వెండినాణెముల మీద ముందువైపు రాజ్ఞః సిరిసాత నాగనికాయ అను లేఖనము ఉంది. ఇది అశ్వమేధయాగ సందర్భములోని నాణెము.ఇవి హైదరాబాదు ఖమ్మం నాగార్జునకొండ బీదర్ మొదలగు ప్రాంతములలో లభించినవి.",
    "kingdoms": [
      "Satavahana",
      "Rashtrakuta"
    ],
    "confidence": 0.019886363636363636,
    "all_scores": {
      "Satavahana": 0.019886363636363636,
      "Rashtrakuta": 0.017045454545454544
    }
  },
  "209": {
    "paragraph": "స్కందశాతకర్ణి నాణెములు రాజ్ఞ సిరిఖదసాతకణిస అను లేఖనము కల నాణెములు అలతికలవు.స్కందశాతకర్ణి పులమావి తర్వాతివాడు శివస్కందశాతకర్ని.ఇవి కృష్ణా గోదావరి తీరములయందు లభించినవి. హాలిని నాణెములు రాజ్ఞ సిరిసతస సిరిసదస సిరిసాతస అను లేఖనములు ఈరాజు పేరుమీద అలతికలవు. సంఖ్య గల నాణెములు ఉన్నాయి.ఇవి కౌండన్యపురమునందు మాళవదేశమునందు ఉజ్జయిని త్రిపురి హైదరాబాదు కృష్ణా గోదావరి తీరములయందు లభించినవి. మాఠరీపుత్ర శివస్వాతిశకసేనుని నాణెములు మాఠరీపుతస సకసదస సకసెనన శకసేనస్య పేరుగల లేఖనములు నాణెములు లభించినవి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.024896265560165977,
    "all_scores": {
      "Satavahana": 0.024896265560165977
    }
  },
  "210": {
    "paragraph": "సంఖ్య గల నాణెములు లభించినవి. ఇవి తర్హాళానిధి అమరావతి బ్రహ్మపురి కృష్ణా గోదావరి తీరములయందు లభించినవి. ఇతర ఉదాహరణలు . .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.08974358974358974,
    "all_scores": {
      "Satavahana": 0.08974358974358974
    }
  },
  "213": {
    "paragraph": ". శాతవాహనులు సంస్కృతానికి బదులుగా ప్రాకృత భాషను పోషించారు. శాతవాహన రాజు హేలా గహ సత్తాసాయి దీనిని గతే సప్తషాత సంస్కృతం గాధాసప్తశతి అని పిలిచే మహారాష్ట్ర కవితల సంకలనాన్ని సంకలనం చేయడానికి ప్రసిద్ధి చెందారు. అయితే భాషా ఆధారాల నుండి ఇప్పుడు ఉన్న రచన తరువాతి శతాబ్దం లేదా రెండు సంవత్సరాల్లో తిరిగి సవరించబడిందని తెలుస్తోంది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05642633228840125,
    "all_scores": {
      "Satavahana": 0.05642633228840125
    }
  },
  "214": {
    "paragraph": "జీవనోపాధికి వ్యవసాయం ప్రధాన మార్గమని ఈ పుస్తకం ద్వారా స్పష్టమైంది. ఇందులో అనేక రకాల అతీంద్రియవిశ్వాసాలు కూడా ఉన్నాయి. అదనంగా హాలా మంత్రి గుణధ్య బృహత్కథ రచయిత. శిల్పాలు మధుకరు కేశవు ధవాలికరు ఇలా వ్రాశాడు శాతవాహన శిల్పాలు దాని స్వంత విలక్షణమైన లక్షణాలను కలిగి ఉన్నప్పటికీ దురదృష్టవశాత్తు స్వతంత్ర పాఠశాలగా గుర్తించబడలేదు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06583072100313479,
    "all_scores": {
      "Satavahana": 0.06583072100313479
    }
  },
  "215": {
    "paragraph": "ంలోనే శిల్పకళ ాన్ని సూచించే భాజా విహారా గుహలో క్రీ.పూ కాలానికి చెందిన శాతవాహన రాజ్యంలో కళలకు గుర్తుగా ఉంది. ఇది శిల్పాలతో అలంకరించబడి ఉంది. స్తంభాలు కూడా తామరపీఠంతో సింహిక లాంటి పౌరాణిక జంతువుల మకుటంతో నిర్మించబడి ఉంటాయి. చంకమాలో ఉత్తర పశ్చిమ స్తంభం మీద సంభవించే ప్యానెలు ద్వారం బుద్ధుడి జీవితంలో చాలా ముఖ్యమైన సంఘటనను చిత్రీకరిస్తుంది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.040178571428571425,
    "all_scores": {
      "Satavahana": 0.040178571428571425
    }
  },
  "216": {
    "paragraph": "ఇరువైపులా రెండు నిచ్చెనలలా కనిపించే శిల్పాలతో బుద్ధుడు నడిచిన విహార ప్రదేశం ఉంది. బుద్ధుడు జ్ఞానోదయం పొందిన తరువాత ఇక్కడ బోధి చెట్టు దగ్గర నాలుగు వారాలు గడిపాడు. వీటిలో మూడవ వారం ఆయన విహార ప్రదేశం చంకమ వెంట నడుస్తూ గడిపాడు. పైన పేర్కొన్న కొన్ని ప్రధాన శాతవాహన శిల్పాలతో పాటు మరికొన్ని శిల్పాలు ఉన్నాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.0695364238410596,
    "all_scores": {
      "Satavahana": 0.0695364238410596
    }
  },
  "217": {
    "paragraph": "అవి ద్వారపాల గజలక్ష్మి శాలభంజికలు రాజుల ఊరేగింపు అలంకార స్తంభం మొదలైనవి ఉన్నాయి. కంచు . శాతవాహనులకు కారణమైన అనేక లోహ బొమ్మలు కనుగొనబడ్డాయి. బ్రహ్మపురిలో ప్రత్యేకమైన కంచు వస్తువుల నిల్వ కూడా కనుగొనబడింది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.10344827586206896,
    "all_scores": {
      "Satavahana": 0.10344827586206896
    }
  },
  "218": {
    "paragraph": "అక్కడ లభించిన స్తువుల గురించి వ్రాయబడిన అనేక వ్యాసాలు భారతీయులే కాక రోమను ఇటాలియను ప్రభావం కూడా ప్రతిబింబించాయి. వస్తువులు దొరికిన ఇంటి నుండి పోసిడాను చిన్న విగ్రహం ద్రాక్షాసారాయి పాత్రలు చిత్రపటాలు ఆండ్రోమెడ ఫలకం కూడా లభించాయి. అష్మోలియను మ్యూజియంలోని చక్కటి ఏనుగు బ్రిటిషు మ్యూజియంలోని యక్షి చిత్రం పోషెరిలో ఛత్రపతి శివాజీ మహారాజు వాస్తు సంగ్రహాలయంలో భద్రపరచబడిన కార్నుకోపియా అలంకరించిన కొమ్ముబూర . కూడా శాతవాహన కాలానికి చెందినవని భావిస్తున్నారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.046875,
    "all_scores": {
      "Satavahana": 0.046875
    }
  },
  "219": {
    "paragraph": "నిర్మాణం అమరావతి స్థూపం శిల్పాలు శాతవాహన కాలాల నిర్మాణ అభివృద్ధిని సూచిస్తాయి. వారు అమరావతిలో అడుగుల ఎత్తు బౌద్ధ స్థూపాలను నిర్మించారు. వారు గోలి జగ్గియాపేట గంతసాల అమరావతి భట్టిప్రోలు శ్రీ పార్వతం వద్ద పెద్ద సంఖ్యలో స్థూపాలను నిర్మించారు. శాతవాహనచే పోషించబడిన వ వ గుహలు అజంతా చిత్రాలను కలిగి ఉన్నాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07,
    "all_scores": {
      "Satavahana": 0.07
    }
  },
  "220": {
    "paragraph": "వారు గుహల అంతటా చిత్రలేఖనాలతో అలకరించడం మైనట్లు కనిపిస్తుంది. అశోకుడి స్థూపాలు విస్తరించబడ్డాయి. అంతకుముందు ఇటుకలు కలప పనులు రాతి పనులతో భర్తీ చేశారు. ఈ స్మారక కట్టడాలలో అమరావతి నాగార్జునకొండ స్థూపాలు అత్యంత ప్రసిద్ధమైనవి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.04729729729729729,
    "all_scores": {
      "Satavahana": 0.04729729729729729
    }
  },
  "221": {
    "paragraph": "చిత్రలేఖనాలు భారతదేశంలో చరిత్రపూర్వ రాతి కళను మినహాయించి శాతవాహనుల కాలంనాటికి చెందిన మిగిలి ఉన్న నమూనాలు అజంతా గుహల వద్ద మాత్రమే కనుగొనబడతాయి. అజంతా కళాత్మక కార్యకలాపాలలో రెండు దశలు ఉన్నాయి శాతవాహన పాలనలో మొదటిది క్రీస్తుపూర్వం నుండి వ శతాబ్దాలకు చెందిన హినాయనా గుహలు తవ్వినప్పుడు వ శతాబ్దం రెండవ భాగంలో ఒకటకుల ఆధ్వర్యంలో రూపొందించబడినవి. ప్రకృతి వైపరీత్యాలు కొన్ని విధ్వంసాల కారణంగా అజంతా గుహలు భారీగా నష్టపోయాయి. శాతవాహనులకు సంబంధించిన కొన్ని శకలాలు రెండూ స్థూపంలో ఉన్న చైత్య గ్రిహాలలోని గుహలలో మాత్రమే మిగిలి ఉన్నాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.04038461538461539,
    "all_scores": {
      "Satavahana": 0.04038461538461539
    }
  },
  "222": {
    "paragraph": "అజంతా వద్ద శాతవాహన కాలం నాటి అతి ముఖ్యమైన చిత్రలేఖనం వ గుహలోని ఛదంత జాతక కానీ అది కూడా చిన్నది మాత్రమే. ఇది పౌరాణిక కథకు సంబంధించిన ఆరు దంతాలతోఉన్న బోధిసత్వుని ఏనుగు చిత్రలేఖనం. మగ ఆడ ఇద్దరి మానవ బొమ్మలు అసలైన శాతవాహనులు సాంచి ద్వారంలోని వారి ఫిజియోగ్నమీ దుస్తులు ఆభరణాలకు సంబంధించి వారి సహచరులతో దాదాపు సమానంగా ఉంటాయి. ఒకే తేడా ఏమిటంటే సాంచి శిల్పాలు వారి బరువులో కొంత భాగాన్ని తగ్గించాయి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.046153846153846156,
    "all_scores": {
      "Satavahana": 0.046153846153846156
    }
  },
  "223": {
    "paragraph": "అమరవతి కళలు శాతవాహన పాలకులు బౌద్ధ కళ వాస్తుశిల్పానికి చేసిన కృషికి ప్రఖ్యాతిగాంచారు. వారు ఆంధ్రప్రదేశ్ లోని అమరావతి వద్ద స్థూపంతో సహా కృష్ణా నది లోయలో గొప్ప స్థూపాలను నిర్మించారు. స్థూపాలను పాలరాయి స్లాబులలో అలంకరించి బుద్ధుని జీవితంలోని దృశ్యాలు చెక్కారు. వీటిని స్లిం సొగసైన శైలిలో చిత్రీకరించారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05267558528428093,
    "all_scores": {
      "Satavahana": 0.05267558528428093
    }
  },
  "224": {
    "paragraph": "అమరావతి శైలి శిల్పం ఆగ్నేయాసియా శిల్పకళను కూడా ప్రభావితం చేసింది. . . .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.14788732394366197,
    "all_scores": {
      "Satavahana": 0.14788732394366197
    }
  },
  "225": {
    "paragraph": ". పాలకుల జాబితా శాతవాహన రాజుల కాలక్రమం గురించి బహుళ పురాణాలలో ప్రస్తావించబడింది. ఏదేమైనా రాజవంశంలోని రాజుల సంఖ్య రాజుల పేర్లు వారి పాలన కాలం గురించిన వివరణలలో వివిధ పురాణాలలో అసమానతలు ఉన్నాయి. అదనంగా పురాణాలలో జాబితా చేయబడిన కొంతమంది రాజులు పురావస్తు ఆధారాల ద్వారా ధ్రువీకరించబడలేదు.",
    "kingdoms": [
      "Satavahana",
      "Rashtrakuta"
    ],
    "confidence": 0.07420494699646643,
    "all_scores": {
      "Satavahana": 0.07420494699646643,
      "Rashtrakuta": 0.053003533568904596
    }
  },
  "226": {
    "paragraph": "అదేవిధంగా నాణేలు శాసనాల ఆధారంగా తెలిసిన కొంతమంది రాజులు ఉన్నారు. వీరి పేర్లు పురాణ జాబితాలో లేవు. శాతవాహన రాజుల పునర్నిర్మాణాలను చరిత్రకారులు రెండు వర్గాలుగా విభజిస్తారు. మొదటిది వర్గం ఆధారంగా శాతవాహన రాజులు సుమారు సంవత్సరాల కాలంలో మంది శాతవాహన రాజులు పరిపాలించారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07924528301886793,
    "all_scores": {
      "Satavahana": 0.07924528301886793
    }
  },
  "227": {
    "paragraph": "మౌర్య సామ్రాజ్యం పతనం అయిన వెంటనే సిముకా పాలనతో శాతవాహన శకం మైంది. ఈ అభిప్రాయాలను పురాణాలు అధికంగా ధ్రువీకరిస్తున్నాయి. అయినప్పటికీ ఇది ఇప్పుడు అధికంగా ఖండించబడింది. పునర్నిర్మాణాల రెండవ విస్తృతంగా ఆమోదించబడిన వర్గం ప్రకారం శాతవాహన పాలన క్రీ.పూ.",
    "kingdoms": [
      "Satavahana",
      "Rashtrakuta"
    ],
    "confidence": 0.08571428571428572,
    "all_scores": {
      "Satavahana": 0.08571428571428572,
      "Rashtrakuta": 0.061224489795918366
    }
  },
  "228": {
    "paragraph": "మొదటి శతాబ్దంలో మైంది. ఈ వర్గంలోని కాలక్రమం రాజులను తక్కువ సంఖ్యలో కలిగి ఉంది. పురాణ రికార్డులను పురావస్తు వ్రాతపూర్వక ఆధారాలతో మిళితం చేస్తుంది. శాతవాహన రాజ్యం స్థాపించబడిన తేదీకి సంబంధించి అనిశ్చితి కారణంగా శాతవాహన రాజుల పాలనల గురించి సంపూర్ణ తేదీలు ఇవ్వడం కష్టం.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07924528301886793,
    "all_scores": {
      "Satavahana": 0.07924528301886793
    }
  },
  "229": {
    "paragraph": "అందువలన చాలా మంది ఆధునిక విద్యావేత్తలు చారిత్రాత్మకంగా ధ్రువీకరించబడిన శాతవాహన రాజుల పాలనలకు సంపూర్ణ తేదీలను కేటాయించరు. కాలనిర్ణయం చేసేవారు ఒకరితో ఒకరు చాలా భిన్నంగా ఉంటారు. హిమాన్షు ప్రభా రే పురావస్తు ఆధారాల ఆధారంగా ఈ క్రింది కాలక్రమాన్ని అందిస్తుంది సిముకా క్రీ.పూ కి ముందు కన్హా క్రీ.పూ. మొదటి శాతకర్ణి క్రీ.పూ రెండవ శాతకర్ణి క్రీ.పూ.",
    "kingdoms": [
      "Satavahana",
      "Rashtrakuta"
    ],
    "confidence": 0.04881656804733728,
    "all_scores": {
      "Satavahana": 0.04881656804733728,
      "Rashtrakuta": 0.04437869822485207
    }
  },
  "230": {
    "paragraph": "హేలా వాస్సలు శాతవాహన రాజులతో క్షత్రపాలు నహాపన సా.శ.. గౌతమిపుత్ర శాతకర్ణి సా.శ.. పులుమావి క్రీ.పూ వశిష్టీపుత్ర శాతకర్ణి సా.శ.. శివ శ్రీ పులుమావి సా.శ..",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.10000000000000002,
    "all_scores": {
      "Satavahana": 0.10000000000000002
    }
  },
  "231": {
    "paragraph": "శివ స్కంద శాతకర్ణి సా.శ.. యజ్ఞ శ్రీ శాతకర్ణి విజయ శాతకర్ణి ఆగ్నేయ దక్కను ప్రాంతీయ పాలకులు చంద్ర శ్రీ రెండవ పులుమావి. అభిరా ఇస్వసేన మాధారిపుత్ర సకసేన హరితిపుత్ర శాతకర్ణి పురాణాలలోని జాబితా వివిధ పురాణాలు శాతవాహన పాలకుల విభిన్న జాబితాల వివరణ ఇస్తాయి. మత్స్య పురాణం ఆంధ్ర రాజులు సంవత్సరాలు పరిపాలించారని పేర్కొంది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.04823151125401929,
    "all_scores": {
      "Satavahana": 0.04823151125401929
    }
  },
  "233": {
    "paragraph": "కాని దాని వివిధ లిఖిత ప్రతులు వరుసగా రాజులను మాత్రమే పేర్కొని పాలన వరుసగా . సంవత్సరాలు ఉన్నట్లు పేర్కొన్నది. ఈ రాజులలో చాలామంది చారిత్రక ఆధారాల ద్వారా ధ్రువీకరించబడలేదు. మరోవైపు నామమాత్రపు సాక్ష్యాలతో ధ్రువీకరించబడిన కొంతమంది శాతవాహన రాజులు రుద్ర శాతకర్ణి వంటివారు పురాణాలలో అస్సలు ప్రస్తావించబడలేదు.",
    "kingdoms": [
      "Satavahana",
      "Rashtrakuta"
    ],
    "confidence": 0.05500000000000001,
    "all_scores": {
      "Satavahana": 0.05500000000000001,
      "Rashtrakuta": 0.05
    }
  },
  "237": {
    "paragraph": "పురాణాలలో కృష్ణ ను కన్వా రాజు సుషర్మానును పడగొట్టిన మొదటి రాజు సోదరుడిగా వర్ణించారు. మిగతా రాజులందరినీ వారి పూర్వీకుల కుమారులుగా అభివర్ణించారు. ఆంధ్ర భృత్యాల మొదటి రాజును స్కంద పురాణం కుమారి ఖండంలో శూద్రక లేదా సురకా అని కూడా పిలుస్తారు క్రింద పట్టికలో లేదు . పాలకుడు నాణ్యాలు శిలాశాసనాలు భాగవతపురాణం బ్రహ్మాండపురాణం మత్స్యపురణం వాయుపురాణం విష్ణు పాలనాకాలం ప్రత్యామ్నాయ పేర్లు రాజ్యాలు సిముక సిసుక మత్స్య సింధుక వాయు సిప్రక విష్ణు చిస్మక బ్రహ్మాండ క్రస్న కంహా మొదటి శాతకర్ణి శాతకర్ణ భాగవత మల్లకర్ణి సం.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.02395209580838323,
    "all_scores": {
      "Satavahana": 0.02395209580838323
    }
  },
  "239": {
    "paragraph": "క్రీ.పూ. పూర్ణోత్సంగా . క్రీ.పూ క్రీ.పూ స్కంధస్థంభి మ . క్రీ.పూ వ శాతకర్ణి .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.15789473684210525,
    "all_scores": {
      "Satavahana": 0.15789473684210525
    }
  },
  "243": {
    "paragraph": "క్రీ.పూ. మృగేంద్ర శాతకర్ణి మ. సా.శ.. సా.శ..",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.27906976744186046,
    "all_scores": {
      "Satavahana": 0.27906976744186046
    }
  },
  "244": {
    "paragraph": "కునతల శాతకర్ణి మ. క్రీ.పూ. క్రీ.పూ. వ శాతకర్ణి .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.25,
    "all_scores": {
      "Satavahana": 0.25
    }
  },
  "245": {
    "paragraph": "క్రీ.పూ. సా.శ.. మొదటి పులుమావి . సా.శ..",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.3076923076923077,
    "all_scores": {
      "Satavahana": 0.3076923076923077
    }
  },
  "247": {
    "paragraph": "సా.శ.. మండలక అకా పుట్టలక లేదా వ పులుమావి . సా.శ.. పురింద్రసేన .సా.శ..",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.17391304347826086,
    "all_scores": {
      "Satavahana": 0.17391304347826086
    }
  },
  "248": {
    "paragraph": "సా.శ.. సుందర శాతకర్ణి మ. సా.శ.. సా.శ..",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.3157894736842105,
    "all_scores": {
      "Satavahana": 0.3157894736842105
    }
  },
  "249": {
    "paragraph": "చకోర శాతకర్ణి . సా.శ.. సా.శ.. శివస్వాతి మ.సా.శ..",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.25,
    "all_scores": {
      "Satavahana": 0.25
    }
  },
  "250": {
    "paragraph": "సా.శ.. గౌతమిపుత్ర శాతకర్ణి .సా.శ.. సా.శ.. వసిష్టీపుత్ర అకా పులుమావి .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.17391304347826086,
    "all_scores": {
      "Satavahana": 0.17391304347826086
    }
  },
  "251": {
    "paragraph": "సా.శ.. సా.శ.. శివశ్రీ శాతకర్ణి మ. సా.శ..",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.30000000000000004,
    "all_scores": {
      "Satavahana": 0.30000000000000004
    }
  },
  "252": {
    "paragraph": "సా.శ.. శివస్కంద శాతకర్ణి .సా.శ.. సా.శ.. శ్రీ యజ్ఞ శాతకర్ణి మ.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.19672131147540983,
    "all_scores": {
      "Satavahana": 0.19672131147540983
    }
  },
  "253": {
    "paragraph": "సా.శ.. సా.శ.. విజయ శాతకర్ణి . సా.శ..",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.3333333333333333,
    "all_scores": {
      "Satavahana": 0.3333333333333333
    }
  },
  "254": {
    "paragraph": "సా.శ.. చంద్ర శ్రీ శాతకర్ణి మ.సా.శ.. సా.శ.. వ పులుమావి .సా.శ..",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.19672131147540983,
    "all_scores": {
      "Satavahana": 0.19672131147540983
    }
  },
  "256": {
    "paragraph": "ఈ కాలములో శాతవాహనులు మాళవతో సహా తమ రాజ్యములోని కొన్ని ప్రాంతాలు పశ్చిమ క్షాత్రపులకు కోల్పోయారు. గ్రీకు శాసనముతో భారతీయ యక్షుడు అమరావతి సా.శ.. వ శతాబ్దం ఆ తర్వాత కాలములో గౌతమీపుత్ర శాతకర్ణి శాలివాహనుడు పా. పశ్చిమ క్షాత్రప పాలకుడు నహపాణను ఓడించి శాతవాహనులు కోల్పోయిన ప్రాంతాలను తిరిగి చేజిక్కించుకొని వంశ ప్రతిష్ఠను పునరుద్ధరించాడు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05272727272727272,
    "all_scores": {
      "Satavahana": 0.05272727272727272
    }
  },
  "257": {
    "paragraph": "ఈయన గొప్ప హిందూమతాభిమాని. శాలివాహనుడు తన శాసనములలో శకులు పశ్చిమ క్షాత్రప యవనులు ఇండో గ్రీకులు పల్లవులు ఇండో పార్థియన్లు యొక్క నాశకుడు అన్న బిరుదు స్వీకరించాడు. గౌతమీపుత్ర శాతకర్ణి లో శక చక్రవర్తి విక్రమాదిత్యను ఓడించి శాలివాహన యుగం లేదా శక యుగానికి నాందిపలికాడు. శాలివాహన యుగాన్ని నేటికీ మరాఠీ ప్రజలు దక్షిణ భారతీయులు పాటిస్తున్నారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.060810810810810814,
    "all_scores": {
      "Satavahana": 0.060810810810810814
    }
  },
  "258": {
    "paragraph": "మహారాష్ట్రలో నేటికీ ప్రజల హృదయాలలో మరొక గొప్ప మరాఠా యోధుడు శివాజీ చక్రవర్తితో పాటు గౌతమీపుత్ర శాతకర్ణికి ప్రత్యేక స్థానం ఉంది. గౌతమీపుత్ర శాతకర్ణి తరువాత ఆయన కుమారుడు వాసిష్టీపుత్ర పులోమావి పా. సింహాననాన్ని అధిష్టించాడు. ఈయన ముఖచిత్ర సహిత నాణేలు ముద్రింపజేసిన తొలి శాతవాహన చక్రవర్తి.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.12014134275618375,
    "all_scores": {
      "Satavahana": 0.12014134275618375
    }
  },
  "259": {
    "paragraph": "ఈయన సోదరుడు వాసిష్టీపుత్ర శాత పశ్చిమ క్షత్రాప వంశానికి చెందిన మొదటి రుద్రవర్మ యొక్క కుమార్తెను పెళ్ళిచేసుకున్నాడు. అయితే స్వయంగా తన మామ చేతిలో యుద్ధరంగాన ఓడిపోయి శాతవాహనుల ప్రతిష్ఠకు బలానికి తీరని నష్టం కలుగజేశాడు. అప్పటి నుండి శ్రీయజ్ఞ శాతకర్ణి రాజ్యానికి వచ్చేవరకు శాతవాహనుల పరిస్థితి పెద్దగా మారలేదు. శ్రీయజ్ఞ శాతకర్ణి శకులపై తీవ్ర పోరాటము సాగించి శాతవాహనులు కోల్పోయిన భూభాగాన్ని కొంతవరకు తిరిగి పొందాడు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.03931203931203931,
    "all_scores": {
      "Satavahana": 0.03931203931203931
    }
  },
  "260": {
    "paragraph": "సాంస్కృతిక అభివృద్ధి బుద్ధుని పై మరుని దాడి విగ్రహ రూపము సా.శ.. వ శతాబ్దం శాతవాహన చక్రవర్తులలో హాలుడు పా. మహారాష్ట్రీ ప్రాకృత కావ్య సంగ్రహం గాహా సత్తసయి సంస్కృతం గాథా సప్తశతి కి గాను ప్రసిద్ధి చెందాడు. అయితే భాషాపరిశీలన ఆధారాల వలన ఇప్పుడు లభ్యమవుతున్న ప్రతి ఆ తరువాత ఒకటీ రెండు శతాబ్దాలలో తిరగరాయబడినది అని ఋజువైనది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06645569620253164,
    "all_scores": {
      "Satavahana": 0.06645569620253164
    }
  },
  "261": {
    "paragraph": "శాతవాహన సామ్రాజ్యం మరాఠీ భాషకు మూల భాష అయిన మహారాష్ట్రీ ప్రాకృత భాష యొక్క అభివృద్ధికి దోహదం చేసింది. శాతవాహన చక్రవర్తులలో కెల్లా గొప్పవాడైన శాలివాహనుడు గౌతమీపుత్ర శాతకర్ణి ప్రతిష్ఠానపురం ఇప్పటి పైఠాన్ యొక్క సాంస్కృతిక అభివృద్ధికి కృషిచేశాడని భావిస్తారు. ప్రపంచ ప్రసిద్ధ పైఠానీ చీర శాతవాహన కాలములోనే అభివృద్ధి చెందినది. శాతవాహనులు ఆనాటి కళలను కట్టడాలను ప్రోత్సహించారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05381471389645776,
    "all_scores": {
      "Satavahana": 0.05381471389645776
    }
  },
  "262": {
    "paragraph": "వారు కట్టించిన కట్టాడాలు స్థూపాలు నేటికీ కృష్ణానదీ పరీవాహక ప్రాంతాలలో చూడవచ్చు. అమరావతి లోని బౌద్ధ స్థూపం చాలా ప్రసిద్ధి చెందింది. ఈ స్థూపాలలో ఉపయోగించిన చలువరాతి కట్టడాలు గౌతమ బుద్ధుని శిల్పాలు వారి కళాతృష్ణకు ఆనాటి పరిస్థితులకు అద్దం పడతాయి. శాతవాహనులు ఆగ్నేయ ఆసియాను ఒక తాటి క్రిందకు తేవడంలో సఫలం అయ్యారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05032467532467532,
    "all_scores": {
      "Satavahana": 0.05032467532467532
    }
  },
  "263": {
    "paragraph": "మహాయాన బౌద్ధం ఆంధ్ర నుంచి ఆగ్నేయ ఆసియాకు వ్యాప్తి చెందడానికి వీరి నౌకాయానం వీరు చేసిన వర్తక వాణిజ్యాలు ఎంతో దోహదం చేశాయి. ఆంధ్ర శిల్పకళ వీరి ద్వారా ఆగ్నేయ ఆసియాలో కూడా వ్యాప్తి చెందింది. ఈకాలం కవులు గుణాడ్యుడు తెలంగాణ తొలి లిఖిత కవి హాలుడు శాతవాహన వ రాజు కవివత్సలుడు గాథాసప్తశతి క్షీణదశ గౌతమీపుత్ర యజ్ఞ శాతకర్ణి యొక్క నాణెం పా. .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05015197568389057,
    "all_scores": {
      "Satavahana": 0.05015197568389057
    }
  },
  "264": {
    "paragraph": "శాతవాహనులు తమ శత్రువులను విజయవంతముగా అడ్డుకున్నా తరచూ జరిగిన సాయుధ ఘర్షణలు సామంతుల విజృంభణతో కు వంశం క్షీణించింది. రమారమి సం.లో శాతవాహనుల శకం అంతరించింది. ఆయా రాజవంశాలు శాతవాహనుల ఆధీనములో ఉన్న ప్రాంతాలను తమలో తాము పంచుకున్నాయి. రాజ్యం యొక్క వాయవ్య భాగాన్ని యాదవులు ఆక్రమించి ప్రతిష్ఠానపురం రాజధానిగా శాతవాహనుల తరువాత పాలన సాగించారు.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.05120481927710843,
    "all_scores": {
      "Satavahana": 0.05120481927710843
    }
  },
  "265": {
    "paragraph": "దక్షిణ మహారాష్ట్రలో రాష్ట్రకూటులు ఉత్తర కర్ణాటకలో వనవాసికి చెందిన కాదంబులు. కృష్ణా గుంటూరు ప్రాంతంలో ఇక్ష్వాకులు లేదా శ్రీపర్వతీయులు . శాతవాహన పరిపాలనానంతర సమయములో చిన్న చిన్న రాజ్యాలు వెలిశాయి. వారిలో పేరొందిన రాజులు పల్లవులు.",
    "kingdoms": [
      "Rashtrakuta",
      "Satavahana"
    ],
    "confidence": 0.10903083700440529,
    "all_scores": {
      "Rashtrakuta": 0.10903083700440529,
      "Satavahana": 0.09251101321585903
    }
  },
  "266": {
    "paragraph": "వీరు కాంచీపురం రాజధానిగా పరిపాలన గావించారు. వీరి మొదటి రాజు సింహవర్మ సా.శ.. . శాతవాహన రాజుల పౌరాణిక జాబితా మత్స్య పురాణం పై ఆధారితమైన ఈ రాజుల జాబితా సమగ్రమైనది.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.13124999999999998,
    "all_scores": {
      "Satavahana": 0.13124999999999998
    }
  },
  "268": {
    "paragraph": "కృష్ణ పా. బిసిఈ పరిపాలన సం. శ్రీ మల్లకర్ణి లేక శ్రీ శాతకర్ణి పరిపాలన సం. పూర్నోత్సంగుడు పరిపాలన సం.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.12121212121212122,
    "all_scores": {
      "Satavahana": 0.12121212121212122
    }
  },
  "269": {
    "paragraph": "స్కంధస్తంభి పరిపాలన సం. శాతకర్ణి క్రీ.పూ. పరిపాలన సం. లంబోదర పరిపాలన సం.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.16666666666666666,
    "all_scores": {
      "Satavahana": 0.16666666666666666
    }
  },
  "271": {
    "paragraph": "మేఘస్వాతి లేక సౌదస పరిపాలన సం. స్వాతి లేక స్వమి పరిపాలన సం. స్కందస్వాతి పరిపాలన సం. మహేంద్ర శాతకర్ణి లేక మృగేంద్ర స్వాతికర్ణ రెండవ శాతకర్ణి పరిపాలన సం.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.07947019867549669,
    "all_scores": {
      "Satavahana": 0.07947019867549669
    }
  },
  "272": {
    "paragraph": "కుంతల శాతకర్ణి లేక కుంతల స్వాతికర్ణ పరిపాలన సం. స్వాతికర్ణ పరిపాలన సం. పులోమావి లేక పాటుమావి పరిపాలన సం. రిక్తవర్ణ లేక అరిస్టకర్మ పరిపాలన సం.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.0851063829787234,
    "all_scores": {
      "Satavahana": 0.0851063829787234
    }
  },
  "274": {
    "paragraph": "సుందర శాతకర్ణి పరిపాలన సం. కరోక శాతకర్ణి లేక కరోక స్వాతికర్ణ పరిపాలన సం. శివస్వాతి పరిపాలన సం. గౌతమీపుత్ర శాతకర్ణి లేక గౌతమీపుత్ర శాలివాహనుడిగా ప్రసిద్ధి చెందాడు పా.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.12272727272727273,
    "all_scores": {
      "Satavahana": 0.12272727272727273
    }
  },
  "275": {
    "paragraph": "సిఈ పరిపాలన సం. వశిష్టపుత్ర శ్రీపులమావి లేక పులోమ పులిమన్ పా. సిఈ పరిపాలన సం. శివశ్రీ శాతకర్ణి పా.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.12244897959183673,
    "all_scores": {
      "Satavahana": 0.12244897959183673
    }
  },
  "276": {
    "paragraph": "లేక శివశ్రీ పరిపాలన సం. శివస్కంద శాతకర్ణి పరిపాలన సం. యజ్ఞశ్రీ శాతకర్ణి పా. సిఈ పరిపాలన సం.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.20604395604395603,
    "all_scores": {
      "Satavahana": 0.20604395604395603
    }
  },
  "277": {
    "paragraph": "విజయశ్రీ శాతకర్ణి పరిపాలన సం. చంద్రశ్రీ శాతకర్ణి పరిపాలన సం. మూడవ పులమాయి సం. ఆంధ్రరాజులలో కడపటి చక్రవర్తియైన ఈ మూడవపులమాయి మరణానంతరము దేశమల్లకల్లోలము అయినని డిగెన్సు ఓలెనాచెన్ అను నాతడువ్రాసెను.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06153846153846154,
    "all_scores": {
      "Satavahana": 0.06153846153846154
    }
  },
  "278": {
    "paragraph": "ఈపులమాయి అధికారులలో ఒకడు గంగానదీ ప్రాంతభూములను ఆక్రమించుకొని చీనాచక్రవర్తిఅగు టెయింటుసాంగు వద్దనుండి హ్యూంట్జి అనువాడుకొందరు రాయబారులతో వచ్చుచున్నాడని విని వారలను పట్టుకొనుటకై సేనలను పంపెనని బహుకష్టముతో హ్యూంట్జి పారిపోయి టిబెట్టు దేశానికి పారిపోయెనని ఆదేశపు రాజైన త్సోంగ్లస్తాన్ అను నాతడు వానికి కొంతసైన్యమిచ్చెనని ఆతడాసైన్యముతో మరలవచ్చి పులమాయి శత్రువుని ఓడించి వానిని బెదరించి ఓడగొట్టెనని డిగెన్సు వ్రాసియున్నాడు.ఇందువలన పులమాయికి చైనాదేశస్థులకు మైత్రికలదని తెలియుచున్నది. శకరాజుల నిరంతరవైర ఆంధ్రసామ్రాజ్య పతనమునకు కారణము అని చెప్పవచ్చును.శకరాజులు ఆంధ్రరాజ్యమును సా.శ.. లో కాలచూర్య ఆంధ్రులను ఓడించిరి.కాకతీయులవద్ద సేనానాయకులుగా ఉండిన రెడ్డి వెలమనాయకులు కాకతీయాంధ్రసామ్రాజ్యనిర్మూలనముతో స్వతంత్రించి ప్రత్యేక రాజ్యములు స్థాపించి శాతవాహనుల రాజులదగ్గర ఉన్నతోద్యోగములు పొందిన పల్లవులు ఆంధ్రసామ్రాజ్య విచ్ఛిత్తితో స్వతంత్రించి పల్లవసామ్రాజ్యమును స్థాపించిరి. శాతవాహనుల నాణాలమీద శ్రీవత్స చిహ్నం మొదట శాతవాహనుల నాణాలమీద కనిపించే చిహ్నాలలో శ్రీవత్స చిహ్నం లక్ష్మీ దేవి ప్రత్యేకమైనది.దీనికి విశేషమయిన ప్రాముఖ్యం ఉంది.",
    "kingdoms": [
      "Satavahana",
      "Kakatiya"
    ],
    "confidence": 0.020771513353115726,
    "all_scores": {
      "Satavahana": 0.020771513353115726,
      "Kakatiya": 0.01483679525222552
    }
  },
  "279": {
    "paragraph": "శ్రీవత్సం అష్టమంగళాలలో ఒకటన్నది సువిదితం. విష్ణువు యొక్క విగ్రహం శ్రీవత్సాంకితవక్షం కలదిగా వరాహమిహిరుడు వివరించాడు.ప్రాచీన నాణేలమీద శిల్పాలలో ఈ చిహ్నానికి శివ విష్ణువులు ఇద్దరితో సంబందం ఉంది. భాగవతం యొక్క దశలో దీనికి వీరపూజ వీరవాదం తో దగ్గర సంబంధం కలిగి ఉండేది. ఇదే మొదటి శాతవాహనుల నాణాల మీద కనిపించే చిహ్నం.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.06818181818181818,
    "all_scores": {
      "Satavahana": 0.06818181818181818
    }
  },
  "281": {
    "paragraph": "సాతవాహనుల నాణాలలో మొదటివాటిలో ఈ చిహ్నం తన సాధారణ స్వరూపంలో కనిపించటమేకాక సంపూర్ణ మానవ స్వరూపంలో కూడా కనిపిస్తుంది.ఈ వంశానికి చెందిన రాజులందరిలో బలవంతుడైన రెండవశాతకర్ణి ఒక వయిపు లక్ష్మికల నాణాలు వెలువరించాడు. ఈ విధంగా అతడు తన ప్రజలకి తన కులదైవం మీద ఎంతభక్తిఉందో నిరూపించుకున్నాడు.ఈ రకం నాణాలు సైరాన్ కౌండిన్యపుర్ విదిశ ప్రాంతాలలో దొరికాయి. బయటి లింకులు ఆంధ్రుల చరిత్ర దుర్గాప్రసాద్ భారతదేశ రాజవంశాలు అజంతా గుహలు పాదపీఠికలు తెలంగాణ చరిత్ర డా.సుంకిరెడ్డి నారాయణరెడ్డి పేజీ . .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.025369978858350954,
    "all_scores": {
      "Satavahana": 0.025369978858350954
    }
  },
  "384": {
    "paragraph": "... ఇవి కూడా చూడండి శాతవాహన అనంతరీకులు గౌతమీపుత్ర శాతకర్ణి ఇండో గ్రీకు సామ్రాజ్యం ఇండో స్కైథియన్ సామ్రాజ్యం ఇండో పార్థియన్ సామ్రాజ్యం పశ్చిమ క్షాత్రపులు కుషాణులు ఆంధ్ర ప్రదేశ్ మూలాలు . . .",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.10904255319148937,
    "all_scores": {
      "Satavahana": 0.10904255319148937
    }
  },
  "386": {
    "paragraph": "క్రీ.పూ. మౌర్యులు క్రీ.పూ. క్రీ.పూ. శాతవాహనులు క్రీ.పూ.",
    "kingdoms": [
      "Satavahana"
    ],
    "confidence": 0.32727272727272727,
    "all_scores": {
      "Satavahana": 0.32727272727272727
    }
  },
  "388": {
    "paragraph": "? ఇక్ష్వాకులు బృహత్పలాయనులు ఆనంద గోత్రీకులు శాలంకాయనులు విష్ణుకుండినులు పల్లవులు పూర్వమధ్య యుగము మహాపల్లవులు రేనాటి చోడులు చాళుక్యులు రాష్ట్రకూటులు తూర్పు చాళుక్యులు పూర్వగాంగులు చాళుక్య చోళులు కాకతీయులు అర్వాచీన గాంగులు ఉత్తరమధ్య యుగము ముసునూరి నాయకులు ఓఢ్ర గజపతులు రేచెర్ల పద్మనాయకులు కొండవీటి రెడ్డి రాజులు రాజమహేంద్రవరం రెడ్డి రాజులు బహమనీ రాజ్యము విజయనగర సామ్రాజ్యము ఆధునిక యుగము అరవీటి వంశము పెమ్మసాని నాయకులు కుతుబ్ షాహీ యుగము నిజాము రాజ్యము బ్రిటిషు రాజ్యము స్వాతంత్ర్యోద్యమము ఆంధ్ర రాష్ట్రం ఏర్పాటు హైదరాబాదు రాష్ట్రం ఏర్పాటు ఆంధ్ర ప్రదేశ్ అవతరణ ఏకీకృత ఆంధ్ర ప్రదేశ్ చరిత్ర ఆంధ్ర ప్రదేశ్ చరిత్ర తెలుగు సాహిత్యం నన్నయకు ముందు నన్నయ యుగము శివకవి యుగము తిక్కన యుగము ఎఱ్ఱన యుగము శ్రీనాథ యుగము రాయల యుగము దాక్షిణాత్య యుగము క్షీణ యుగము ఆధునిక యుగము వ శతాబ్ది చారిత్రక నగరాలు పిఠాపురం భట్టిప్రోలు వేంగి ధాన్యకటకము కొలనుపాక ఓరుగల్లు విజయపురి రాజమహేంద్రవరం కళింగపట్నం హంపి సింహపురి హైదరాబాదు చారిత్రక వ్యక్తులు గణపతిదేవుడు రుద్రమదేవి కృష్ణదేవరాయలు శాలివాహనుడు చాళుక్యులు సా.శ. శతాబ్దాల మధ్య దక్షిణ భారతదేశంలో చాలా భాగం మధ్య భారతదేశంలో కొంతవరకు పరిపాలించిన రాజవంశం. ఈ కాలంలో వీరు ఒకదానితో ఒకటి సంబంధం కలిగిన మూడు ప్రత్యేక వంశాలుగా పరిపాలన చేశారు.",
    "kingdoms": [
      "Rashtrakuta",
      "Kakatiya",
      "Vijayanagara"
    ],
    "confidence": 0.021615720524017466,
    "all_scores": {
      "Rashtrakuta": 0.021615720524017466,
      "Kakatiya": 0.015196506550218342,
      "Vijayanagara": 0.013537117903930132,
      "Satavahana": 0.010480349344978166,
      "Chalukya": 0.006550218340611353,
      "Chola": 0.006550218340611353
    }
  },
  "389": {
    "paragraph": "చాళుక్యులలో అన్నింటికన్నా ప్రాచీనమైన వారు సా.శ వ శతాబ్దం మధ్య వాతాపి ప్రస్తుతం బాదామి కేంద్రంగా పరిపాలించిన బాదామి చాళుక్యులు. వీరు ప్రస్తుతం కర్ణాటకలోని సిర్సి సమీపంలో ఉన్న బనవాసి కేంద్రంగా పరిపాలించిన కదంబ రాజ్యం క్షీణించినప్పుడు తమ స్వాతంత్య్రాన్ని ప్రకటించుకున్నారు. రెండవ పులకేశి పాలనలో వేగంగా ప్రాముఖ్యతను సంతరించుకున్నారు. రెండవ పులకేశి మరణించిన తర్వాత తూర్పు దక్కను ప్రాంతాన్ని పరిపాలించే తూర్పు చాళుక్యులు స్వతంత్య్ర రాజ్యంగా ఏర్పడ్డారు.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.02017937219730942,
    "all_scores": {
      "Chalukya": 0.02017937219730942
    }
  },
  "390": {
    "paragraph": "వీరు ప్రస్తుతం ఆంధ్రప్రదేశ్ లో ఉన్న వేంగి ప్రాంతం కేంద్రంగా వ శతాబ్దం దాకా పరిపాలించారు. పశ్చిమ దక్కను ప్రాంతంలో వ శతాబ్దం మధ్యలో రాష్ట్రకూటుల ప్రాబల్యంతో బాదామి చాళుక్యుల ప్రాభవం మసక బారింది. అయితే వారి వారసులైన పశ్చిమ చాళుక్యులు వ శతాబ్దం ి నాటికి మళ్ళీ బలం పుంజుకున్నారు. వీరు కళ్యాణి ప్రస్తుతం కర్ణాటకలోని బసవకల్యాణ్ ప్రాంతం నుంచి సుమారు వ శతాబ్దం దాకా పరిపాలించారు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.05472972972972973,
    "all_scores": {
      "Rashtrakuta": 0.05472972972972973,
      "Chalukya": 0.024324324324324326
    }
  },
  "391": {
    "paragraph": "దక్షిణ భారతదేశ చరిత్రలో చాళుక్యుల పరిపాలన ఒక మైలురాయి వంటిది. కర్ణాటక చరిత్రలో స్వర్ణయుగం వంటిది. దక్షిణ భారతదేశంలో రాజకీయ వాతావరణం చిన్న చిన్న రాజ్యాల నుంచి పెద్ద సామ్రాజ్యాల స్థాపనకు బాదామి చాళుక్యుల ప్రాబల్యంతోనే మైంది. దక్షిణ భారతదేశం కేంద్రంగా ఏర్పడ్డ రాజ్యం కావేరి నర్మద నదుల మధ్య ప్రాంతాన్నంతటినీ ఏకీకృతం చేసి తన పాలనలోకి తెచ్చుకుంది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.02639296187683285,
    "all_scores": {
      "Chalukya": 0.02639296187683285
    }
  },
  "392": {
    "paragraph": "ఈ సామ్రాజ్యం ప్రాబల్యంతో మెరుగైన పరిపాలన విదేశీ వాణిజ్యం చాళుక్యుల వాస్తు నిర్మాణశైలి లాంటివి పురుడు పోసుకున్నాయి. వ శతాబ్దంలో రాష్ట్రకూటులు కన్నడ సాహిత్యాన్ని ప్రోత్సహించగా పశ్చిమ చాళుక్యులు కూడా జైన వీర శైవసంప్రదాయాలలో అదే ప్రోత్సాహాన్ని కొనసాగించారు. వ శతాబ్దంలో తూర్పు చాళ్యుకులు తెలుగు సాహిత్యాన్ని ప్రోత్సహించారు. వంశ మూలాలు కర్ణాటక స్థానికులు సా.శ సంవత్సరంలో మూడవ బాదామి గుహాలయంలో చాళుక్య రాజు మంగలేశుడు వేయించిన పురాతన కన్నడ శాసనం పట్టదకల్ విరూపాక్ష ఆలయంలో విజయ స్తంభంమీద చెక్కిన పురాతన కన్నడ శాసనం సా.శ.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.04833984375,
    "all_scores": {
      "Rashtrakuta": 0.04833984375,
      "Chalukya": 0.017578125
    }
  },
  "394": {
    "paragraph": "వి. రమేష్ కర్మాకర్ మొదలైన చరిత్ర కారులందరూ కలిసి బాదామి చాళుక్య సామ్రాజ్య స్థాపకులు కర్ణాటక స్థానికులే అని ఏకాభిప్రాయానికి వచ్చారు. సా.శ. వ శతాబ్దమునాటి ఇక్ష్వాకుల శాసనములో కండచిలికి రెమ్మనక అనువాడు ఇక్ష్వాకుల సామంతుడని ఉంది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.04,
    "all_scores": {
      "Chalukya": 0.04
    }
  },
  "397": {
    "paragraph": "అందులో అయోధ్య నుంచి ఒక పాలకుడు దక్షిణం వైపు వచ్చి పల్లవులను ఓడించి పల్లవ యువరాణిని వివాహం చేసుకున్నాడు. ఆమెకు కలిగిన విజయాదిత్య అనే సంతానం ఒకటవ పులకేశి తండ్రి అని పేర్కొన్నారు. అయితే చరిత్రకారులు . .",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.15075376884422112,
    "all_scores": {
      "Chalukya": 0.15075376884422112
    }
  },
  "398": {
    "paragraph": "రమేష్ చోప్రా శాస్త్రి ప్రకారం జయసింహ మొదటి పులకేశి తాత ఇంకా రణరాగ అతని తండ్రి అని నిర్ధారించే బాదామి చాళుక్య శాసనాలు ఉన్నాయని పేర్కొన్నారు. కామత్ మోరేస్ వ శతాబ్దంలో దక్షిణ భారత రాజకుటుంబ వంశాన్ని ఉత్తర రాజ్యానికి అనుసంధానించడం ఒక ప్రసిద్ధ పద్ధతి అని పేర్కొన్నారు. బాదామి చాళుక్యుల రికార్డులు అయోధ్య మూలానికి సంబంధించిన మూలాలేమీ లేవు. చాలామంది చరిత్రకారులు ఉత్తర భారత వలస సిద్ధాంతాన్ని కొట్టివేసినప్పటికీ శాసనాల నిపుణుడైన కె.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.0330188679245283,
    "all_scores": {
      "Chalukya": 0.0330188679245283
    }
  },
  "400": {
    "paragraph": "చరిత్రకారులు జాన్ హౌబెన్ కామత్ శాసనాల అధ్యయ నిపుణుడైన డి.సి. సిర్కార్ బాదామి చాళుక్య శాసనాలు కన్నడ సంస్కృతంలో ఉన్నాయని గమనించారు. చరిత్రకారుడు . .",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.06164383561643835,
    "all_scores": {
      "Chalukya": 0.06164383561643835
    }
  },
  "401": {
    "paragraph": "రావు ప్రకారం వారి శాసనాలు వారిని కర్ణాటులు అని పేర్కొన్నాయి. వారి పేర్లు ప్రియగాల్లం మరియు నోడుత్తగెల్వోం వంటి దేశీయ కన్నడ బిరుదులను కలిగి ఉన్నాయి. కొంతమంది చాళుక్య రాకుమారుల పేర్లు అరస అంటే రాజు అని అర్థం స్వచ్ఛమైన కన్నడ పదంతో ముగుస్తాయి. రాష్ట్రకూట శాసనాలు బాదామి చాళుక్యులను కర్ణాటకబల అని పిలిచాయి.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.09966777408637875,
    "all_scores": {
      "Rashtrakuta": 0.09966777408637875,
      "Chalukya": 0.02990033222591362
    }
  },
  "403": {
    "paragraph": "కొంతమంది చరిత్రకారుల ప్రకారం చాళుక్యులు వ్యవసాయదారుల నుండి ఉద్భవించారు. చారిత్రక ఆధారాలు సంస్కృత కన్నడ భాషలలోని శాసనాలు బాదామి చాళుక్యుల చరిత్రకు ముఖ్యమైన ఆధారాలు. మంగళేశ బాదామి గుహ శాసనాలు కప్పే ఆరభట్ట శాసనాలు రెండవ పులకేశి వేయించిన పెద్దవడుగూరు శాసనం కంచి కైలాసనాథ ఆలయ శాసనం రెండవ విక్రమాదిత్యుడికి చెందిన పట్టదకల్ విరూపాక్ష దేవాలయ శాసనం అన్నీ కన్నడ భాషలో చాళుక్యుల మరిన్ని ఆధారాలను అందిస్తున్నాయి. ఒకటో పులకేశి బాదామి కొండ శాసనం మంగళేశ మహాకూట స్తంభ శాసనం రెండవ పులకేశి యొక్క ఐహోళే శాసనం పాత కన్నడ లిపిలో వ్రాయబడిన ముఖ్యమైన సంస్కృత శాసనాలకు ఉదాహరణలు.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.02717391304347826,
    "all_scores": {
      "Chalukya": 0.02717391304347826
    }
  },
  "404": {
    "paragraph": "చాళుక్యుల పాలనలో తమిళకం తమిళ దేశం అని పిలవబడే భారతీయ ద్వీపకల్పంలోని ప్రాంతాలలో సంస్కృతంతో పాటు శాసనాల యొక్క ప్రధాన భాషగా కన్నడ రాకను చూసింది. కన్నడ ఇతిహాసాలతో కూడిన బాదామి చాళుక్యుల అనేక నాణేలు కనుగొన్నారు. ఈ కాలంలో కన్నడ భాష అభివృద్ధి చెందిందని ఇవన్నీ సూచిస్తున్నాయి. ఆ కాలంలో విదేశీ యాత్రికుల ప్రయాణ కథనాలు చాళుక్యుల సామ్రాజ్యం గురించి ఉపయోగకరమైన సమాచారాన్ని అందించాయి.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.02425876010781671,
    "all_scores": {
      "Chalukya": 0.02425876010781671
    }
  },
  "411": {
    "paragraph": "ఎందుకంటే ఇది కేవలం ఒకే రకంగా ధ్వనించే పేర్లను కలగలిపి వంశవృక్షాలను తయారు చేసిందని అభిప్రాయపడ్డాడు. చాళుక్యుల చారిత్రక యుగాలు చాళుక్యులు సుమారు సంవత్సరాలపాటు దక్కను పీఠభూమి ప్రాంతాన్ని పరిపాలించారు. ఈ కాలంలో వీరు సన్నిహిత సంబంధాలు కలిగిన మూడు రాజవంశాలుగా పరిపాలన చేశారు. అవి బాదామి చాళుక్యులు లేదా పూర్వ చాళుక్యులు.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.028662420382165606,
    "all_scores": {
      "Chalukya": 0.028662420382165606
    }
  },
  "412": {
    "paragraph": "వీరు సా.శ నుంచి వ శతాబ్దం మధ్యలో పరిపాలించారు. తర్వాత పాలించిన రెండు సోదర రాజవంశాలు. ఒకటి కళ్యాణి చాళుక్యులు లేదా పశ్చిమ చాళుక్యులు లేదా తర్వాతి చాళుక్యులు. రెండవ వంశం వేంగి చాళుక్యులు లేదా తూర్పు చాళుక్యులు.",
    "kingdoms": [
      "Rashtrakuta",
      "Chalukya"
    ],
    "confidence": 0.05048076923076923,
    "all_scores": {
      "Rashtrakuta": 0.05048076923076923,
      "Chalukya": 0.04326923076923077
    }
  },
  "413": {
    "paragraph": "బాదామి చాళుక్యులు వ శతాబ్దంలో ఉత్తర భారతదేశానికి చెందిన గుప్త వంశం వారి వారసులు క్షీణించిన తర్వాత వింధ్య పర్వతాలకు దక్షిణంగా దక్కన్ ప్రాంతంలోనూ ప్రాచీన తమిళ రాజ్యంలో తమిళకం కొన్ని మార్పులు సంభవించాయి. చిన్న చిన్న రాజ్యాల నుంచి పెద్ద సామ్రాజ్యాల ఏర్పాటుకు బాటలు ఏర్పడ్డాయి. సా.శ లో ఒకటవ పులకేశి ఈ చాళుక్య సామ్రాజ్యాన్ని స్థాపించాడు. ఇతను వాతాపిని ప్రస్తుతం కర్ణాటక రాష్ట్రం భాగల్ కోట జిల్లాకు చెందిన బాదామి తన స్వాధీనంలోని తీసుకుని రాజధానిగా చేసుకున్నాడు.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.029735682819383262,
    "all_scores": {
      "Chalukya": 0.029735682819383262
    }
  },
  "414": {
    "paragraph": "అలా ఒకటవ పులకేశి అతని వారసులు బాదామి చాళుక్యులు అని పిలవబడ్డారు. వీరి సామ్రాజ్యంలో కర్ణాటక రాష్ట్రం దక్కన్ ప్రాంతానికి చెందిన ఆంధ్రప్రదేశ్ లో చాలా భాగం ఉన్నాయి. ఎరేయా అనే పూర్వ నామం కలిగిన రెండవ పులకేశి దక్కన్ ప్రాంతాన్నంతా తన ఆధీనంలోకి తెచ్చుకున్నాడు. బాదామి చాళుక్యుల వంశంలో అందరికన్నా ఎక్కువ ప్రఖ్యాతి గాంచిన పాలకుడు ఇతనే.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.027692307692307697,
    "all_scores": {
      "Chalukya": 0.027692307692307697
    }
  },
  "416": {
    "paragraph": "ఆ తరువాత ఆగ్నేయ దక్కనులో విష్ణుకుండినులను ఓడించాడు. పల్లవ నరసింహవర్మన లో బాదామి మీద దాడి చేసి తాత్కాలికంగా ఆక్రమించి ఈ విజయాన్ని తిప్పికొట్టారు. ఈ పోరాటంలో రెండవ పులకేశి మరణించాడని భావిస్తున్నారు. రెండవ పులకేశి మరణించిన తరువాత పదమూడు సంవత్సరాల కాలానికి బాదామిని పల్లవులు ఆక్రమించిన సమయంలో అంతర్గత వైరుధ్యాల కారణంగా బాదామి చాళుక్య రాజవంశం పదమూడు సంవత్సరాల పాటు క్షీణదశను అనుభవించింది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.04699738903394256,
    "all_scores": {
      "Chalukya": 0.04699738903394256
    }
  },
  "417": {
    "paragraph": "తర్వాత వచ్చిన ఒకటో విక్రమాదిత్యుడు పల్లవులను బాదామి నుండి తరిమివేసి సామ్రాజ్యక్రమాన్ని పునరుద్ధరించాడు. ఈ విజయానికి చిహ్నంగా అతనికి రాజమల్ల అనే బిరుదును అందుకున్నాడు. విక్రమాదిత్యుని మనవడమైన విజయాదిత్యుడు సంవత్సరాల సుసంపన్నమైనది పాలన చేసాడు. ఆయన పాలనలో ప్రసిద్ధ ఆలయాలు నిర్మించబడ్డాయి.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.06842105263157894,
    "all_scores": {
      "Chalukya": 0.06842105263157894
    }
  },
  "418": {
    "paragraph": "విజయాదిత్యుని కొడుకు రెండవ విక్రమాదిత్యుడి పాలనలో ఈ సామ్రాజ్యం తిరిగి శిఖరాగ్రం చేరుకుంది. ఆయన తొండైమండలం భూభాగం మీద పదేపదే దండయాత్రలు చేసి పల్లవ రెండవ నందివర్మ మీద సాధించిన విజయాలకు ప్రజల పట్ల ఆయన చూపిన దయాదాక్షిణ్యాలకు పల్లవ రాజధాని కాంచిపురం స్మారక చిహ్నాలు నిర్మించినందుకు కూడా పేరుగాంచాడు. ఈ విధంగా ఆయన పల్లవులు గతంలో చాళుక్యులను అవమానించినందుకు ప్రతీకారం తీర్చుకున్నాడు. కైలాసనాథ ఆలయంలో విజయ స్తంభం మీద కన్నడ శాసనాన్ని చెక్కాడు.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.06912442396313365,
    "all_scores": {
      "Chalukya": 0.06912442396313365
    }
  },
  "419": {
    "paragraph": "ఆయన పాలనలో దక్షిణ గుజరాతు మీద అరబు చొరబాటుదారుడు ఉమయ్యదు కాలిఫేటు దాడి చేశాడు. చాళుక్య పాలనలో ఉన్న నవ్సరీ చాళుక్య గవర్నరు పులకేసి అరబ్బులను ఓడించి తరిమికొట్టాడు. తరువాత ఆయన కలాభ్రా పాలకుడిని లొంగదీసుకోవడంతో పాటు తమిళ దేశంలోని ఇతర సాంప్రదాయ రాజ్యాలైన పాండ్యులు చోళులు చేరులను అధిగమించాడు. ి చాళుక్య రాజు రెండవ కీర్తివర్మను లో రాష్ట్రకూట రాజు దంతిదుర్గుడు పడగొట్టాడు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.07808219178082192,
    "all_scores": {
      "Rashtrakuta": 0.07808219178082192,
      "Chola": 0.02054794520547945
    }
  },
  "420": {
    "paragraph": "వారి శిఖరాగ్రస్థాయిలో చాళుక్యులు దక్షిణాన కావేరి నుండి ఉత్తరాన నర్మదా వరకు విస్తరించి ఉన్న విస్తారమైన సామ్రాజ్యాన్ని పరిపాలించారు. కల్యాణి చాళుక్యులు దక్కను ప్రాంతం చాలావరకు రాష్ట్రకూటుల పాలనలో సంవత్సరాల నిద్రాణస్థితిలో ఉన్న తరువాత లో చాళుక్యులు తమ అధికారాన్ని పునరుద్ధరించారు. ఈ చాళుక్యుల వంశవృక్షం ఇప్పటికీ నీయాంశమైంది. ఒక సిద్ధాంతం ప్రకారం పశ్చిమ చాళుక్యుల కాలానికి సంబంధించిన సాహిత్య శాసనాత్మక ఆధారాలు బాదామి చాళుక్యులు సాధారణంగా ఉపయోగించే బిరుదునామాలను వీరు కూడా ఉపయోగించడాన్ని బట్టి వీరు వ శతాబ్దపు ప్రసిద్ధ బాదామి చాళుక్య రాజవంశానికి చెందినవారేనని తెలుస్తున్నది.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.05272407732864676,
    "all_scores": {
      "Rashtrakuta": 0.05272407732864676,
      "Chalukya": 0.015817223198594025
    }
  },
  "421": {
    "paragraph": "మరోవైపు ఇతర పశ్చిమ చాళుక్య శిలాశాసనాలు వీరు పూర్వ చాళుక్యులతో సంబంధం లేని ఒక ప్రత్యేకమైన వంశావళి అని సూచిస్తున్నాయి. తార్దావడికి బీజాపూరు జిల్లా చెందిన రాష్ట్రకూటుల పరిపాలనలో భూస్వామి అయిన రెండవ తైలపుడు సా.శ రాష్ట్రకూట చక్రవర్తి అయిన రెండవ కర్కుడిని ఓడించి పశ్చిమ దక్కనులో చాళుక్య పాలనను తిరిగి స్థాపించాడు. పశ్చిమ చాళుక్యులు సంవత్సరాలకు పైగా పరిపాలించారు. వీరు చోళులు ఇంకా వారి బంధువులైన వేంగి చాళుక్యులతో నిరంతరం సంఘర్షణలు కొనసాగించారు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.0684931506849315,
    "all_scores": {
      "Rashtrakuta": 0.0684931506849315,
      "Chalukya": 0.017123287671232876,
      "Chola": 0.017123287671232876
    }
  },
  "423": {
    "paragraph": "ఆయన నాయకత్వంలో పాశ్చాత్య చాళుక్యులు వేంగి ఆంధ్ర తీర ప్రాంతం మీద చోళుల ప్రభావాన్ని అంతం చేసి దక్కనులో ఆధిపత్య శక్తిగా మారారు. కన్నడ సాహిత్యం సంస్కృత సాహిత్యం అభివృద్ధిలో పాశ్చాత్య చాళుక్య కాలం ఒక ముఖ్యమైన యుగంగా గుర్తించబడింది. వ శతాబ్దం లో హొయసల సామ్రాజ్యం పాండ్యులు కాకతీయ దేవగిరి సీనా యాదవుల రాకతో వారు తమ క్షీణదశకు చేరుకున్నారు. వేంగీ చాళుక్యులు సా.శ.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.05084745762711865,
    "all_scores": {
      "Kakatiya": 0.05084745762711865,
      "Chalukya": 0.0211864406779661,
      "Chola": 0.01694915254237288
    }
  },
  "424": {
    "paragraph": "లో రెండవ పులకేశి ఆధునిక ఆంధ్రప్రదేశ్ తీరప్రాంతంలో అక్కడక్కడా ఉనికిలో ఉన్న విష్ణుకుండినుల అధికారాన్ని అణిచివేసి తన సోదరుడైన కుబ్జ విష్ణువర్ధనుడిని సా.శ లో రాజప్రతినిధిగా నియమించాడు. అందువలన తూర్పు చాళుక్యులు కన్నడ రాజవంశానికి చెందినవారు. రెండవ పులకేశి మరణం తరువాత వేంగి ప్రతినిధిత్వ స్థాయి నుండి స్వతంత్ర రాజ్యంగా అభివృద్ధి చెంది తన రాజ్యపరిధిలో నెల్లూరు విశాఖపట్నం మధ్య ప్రాంతాన్ని విలీనం చేసుకుంది. వ శతాబ్దం మధ్యలో బాదామి చాళుక్య సామ్రాజ్యం క్షీణించిన తరువాత పశ్చిమ దక్కను కొత్త పాలకులైన రాష్ట్రకూటాలు తూర్పు చాళుక్యుల మధ్య ప్రాదేశిక వివాదాలు చెలరేగాయి.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.05405405405405406,
    "all_scores": {
      "Rashtrakuta": 0.05405405405405406,
      "Chalukya": 0.014864864864864866
    }
  },
  "425": {
    "paragraph": "తరువాతి రెండు శతాబ్దాలలో తూర్పు చాళుక్యులు రాష్ట్రకూటులకు సామంతులై ఉన్నారు. రెండవ విజయాదిత్యుడు . సాధించిన అరుదైన సైనిక విజయం కాకుండా మొదటి భీముడు . పాలనలో మాత్రమే ఈ చాళుక్యులు స్వతంత్ర రాజ్యంగా ఆధిపత్యం నిలుపుకున్నారు.",
    "kingdoms": [
      "Chalukya",
      "Rashtrakuta"
    ],
    "confidence": 0.136986301369863,
    "all_scores": {
      "Chalukya": 0.136986301369863,
      "Rashtrakuta": 0.136986301369863
    }
  },
  "426": {
    "paragraph": "మొదటి బీమా మరణం తరువాత రాష్ట్రకూటులు ఆంధ్ర ప్రాంతంలో వేంగి వ్యవహారాలలో వరుస వివాదాలు జోక్యం చేసుకున్నారు. లో తూర్పు చాళుక్యుల అదృష్టం మలుపు తిరిగింది. వారి రాజు అయిన దనార్ణవుడుని సా.శ లో తెలుగు చోడ రాజైన భీముడితో జరిగిన యుద్ధంలో మరణించాడు. ఆ తరువాత చోడ భీముడు సంవత్సరాలు ఈ ప్రాంతంలో తన పాలన సాగించాడు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.08222591362126247,
    "all_scores": {
      "Rashtrakuta": 0.08222591362126247,
      "Chalukya": 0.024916943521594688
    }
  },
  "427": {
    "paragraph": "ఈ సమయంలో దనార్ణవుని ఇద్దరు కుమారులు చోళ రాజ్యంలో ఆశ్రయం పొందారు. చోడ భీముడు చోళ భూభాగమైన తొండైమండలం మీద దాడి చేయడం యుద్ధరంగంలో మరణించడం చోళ చాళుక్య సంబంధాలలో కొత్త శకానికి తెరతీసింది. దనార్ణవుని పెద్ద కుమారుడు మొదటి శక్తివర్మను చోళరాజైన మొదటి రాజరాజ చోళుడి నియంత్రణలో వేంగిరాజ్యానికి రాజుగా నియమించారు. చోళులు తీరప్రాంత ఆంధ్ర రాజ్యం మధ్య ఈ కొత్త సంబంధం పశ్చిమ చాళుక్యులకు ఆమోదయోగ్యం కాలేదు.",
    "kingdoms": [
      "Chalukya",
      "Chola"
    ],
    "confidence": 0.038461538461538464,
    "all_scores": {
      "Chalukya": 0.038461538461538464,
      "Chola": 0.019230769230769232
    }
  },
  "428": {
    "paragraph": "వారు అప్పటికే పశ్చిమ దక్కనులో రాష్ట్రకూటులను ఓడించి ప్రధాన శక్తిగా ఎదిగారు. వారు వేంగి ప్రాంతంలో పెరుగుతున్న చోళ ప్రభావాన్ని తగ్గించడానికి విఫల ప్రయత్నం చేసారు. ంలో తూర్పు చాళుక్యులు కన్నడ భాష సాహిత్యాన్ని ప్రోత్సహించారు. అయినప్పటికీ కొంతకాలం తర్వాత స్థానిక అంశాలు ప్రాధాన్యత సంతరించుకున్నాయి.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.10238907849829351,
    "all_scores": {
      "Rashtrakuta": 0.10238907849829351,
      "Chalukya": 0.025597269624573378,
      "Chola": 0.020477815699658702
    }
  },
  "429": {
    "paragraph": "తరువాత వారు తెలుగు భాషకు ప్రాముఖ్యత ఇచ్చాయి. తూర్పు చాళుక్యులు తెలుగు సాహిత్యాన్ని ప్రోత్సహించారు. ముదిగొండ చాళుక్యులు పూర్వ మధ్య యుగమున తెలుగు దేశములో వేంగీ చాళుక్యుల పక్షము వహించి రాష్ట్రకూటులనెదిర్చి కాకతీయులను కూడా ప్రతిఘటించిన రాజవంశము ముదిగొండ చాళుక్యులు. ఖమ్మం ప్రాంతములోని ముదిగొండ వీరి రాజధాని.",
    "kingdoms": [
      "Rashtrakuta",
      "Kakatiya"
    ],
    "confidence": 0.099009900990099,
    "all_scores": {
      "Rashtrakuta": 0.099009900990099,
      "Kakatiya": 0.04950495049504951
    }
  },
  "431": {
    "paragraph": "వీరిలో ముఖ్యులు మూడవ కుసుమాయుధుడు బొట్టు బేతరాజు కుసుమాదిత్యుడు. వేములవాడ చాళుక్యులు ఇప్పటి కరీంనగరు జిల్లాలోని వేములవాడ రాజధానిగా పాలించిన చాళుక్య రాజవంశమును వేములవాడ చాళుక్యులందురు. తొలుత వీరు ఇందూరు నిజామాబాద్ ప్రాంతములోని పోదనపురము బోధన్ నుండి పాలించెడివారు. సాతవాహన సామ్రాజ్యములో అశ్మక రాష్ట్రమునకు ఇది రాజధాని.",
    "kingdoms": [
      "Kakatiya"
    ],
    "confidence": 0.03322784810126582,
    "all_scores": {
      "Kakatiya": 0.03322784810126582
    }
  },
  "432": {
    "paragraph": "ఈ ప్రాంతమును సపాదలక్ష సబ్బినాడు పోదననాడు అని కూడా అంటారు. సాతవాహనుల తరువాత నాలుగు శతాబ్దముల చరిత్ర తెలియడం లేదు. రాష్ట్రకూట రాజగు దంతిదుర్గ పోదననాడులో సామంతునిగా వినయాదిత్య యుద్ధమల్లుని క్రీ. శ.",
    "kingdoms": [
      "Chalukya",
      "Rashtrakuta"
    ],
    "confidence": 0.15463917525773196,
    "all_scores": {
      "Chalukya": 0.15463917525773196,
      "Rashtrakuta": 0.14690721649484537
    }
  },
  "433": {
    "paragraph": "నియమించాడు. ఈతడు దంతిదుర్గ దండయాత్రలలో విజయములు సాధించి రాజు మన్ననలు పొందాడు. బాదామి చాళుక్యుల అధికారము కూలద్రోయుటలో యుద్ధమల్లుడు మిక్కిలి తోడ్పడ్డాడు. యుద్ధమల్లుని కుమారుడు మొదటి అరికేసరి క్రీ.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.13917525773195877,
    "all_scores": {
      "Rashtrakuta": 0.13917525773195877,
      "Chalukya": 0.04639175257731959
    }
  },
  "435": {
    "paragraph": "ఇతని కొడుకు రెండవ యుద్ధమల్లుడు. ఇతని గురించి విశేషములు తెలియరాలేదు. రెండవ యుద్ధమల్లుని కుమారుడు బద్దెగ మహావీరుడు. రాష్ట్రకూటులకు సాయముగా బద్దెగ కాకర్త్య గుండన వేంగి పై దాడి చేశారు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.16666666666666666,
    "all_scores": {
      "Rashtrakuta": 0.16666666666666666,
      "Chalukya": 0.041666666666666664
    }
  },
  "436": {
    "paragraph": "బద్దెగ మనుమడు ఇమ్మడి అరికేసరి ఈ వంశములో అందరికంటే గొప్పవాడు. రాష్టకూటులతొ సంబంధములు నెరపి వేంగి మాన్యఖేటము కొరవి లలో తన ప్రాబల్యము పెంపు చేశాడు. పసిద్ధ కన్నడ కవి పంప అరికేసరి ఆస్థానములో ఉండి విక్రమార్జునవిజయము అనబడు తొలి కన్నడ కావ్యము రచించాడు. ఇతడు కమ్మనాడుకు చెందిన వాడు.",
    "kingdoms": [
      "Rashtrakuta",
      "Chalukya"
    ],
    "confidence": 0.04395604395604395,
    "all_scores": {
      "Rashtrakuta": 0.04395604395604395,
      "Chalukya": 0.027472527472527472
    }
  },
  "437": {
    "paragraph": "వాస్తుకళ సా.శ సంవత్సరంలో పట్టదకల్ లో ద్రవిడ నిర్మాణ శైలిలో నిర్మించిన విరూపాక్ష దేవాలయం దక్షిణ భారత శిల్పకళా అభివృద్ధి చెందడంలో బాదామి చాళుక్యులది చాలా ముఖ్యమైన పాత్ర. ఉమాపతి వరలబ్ధులు అని పిలవబడే ఈ వంశ రాజులు అనేక శివాలయాలు నిర్మించారు. వీళ్ళు తమ నిర్మాణ శైలిని చాళుక్య వాస్తుశైలి కర్ణాట ద్రవిడ శైలి అని పిలిచారు. వీరు ప్రస్తుతం ఉత్తర కర్ణాటకలోని భాగల్ కోట్ జిల్లాలో సుమారు వందకి పైగా నిర్మాణాలు గుహాలయాలు నిర్మించారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.060859188544152745,
    "all_scores": {
      "Vijayanagara": 0.060859188544152745,
      "Chalukya": 0.021479713603818618
    }
  },
  "439": {
    "paragraph": "ఇవి ప్రాథమికంగా శిల్పకళాపరమైనవి. చాళ్యుకులు విస్తారమైన సామ్రాజ్యాన్ని పరిపాలించినప్పటికీ చాళుక్యుల నిర్మాణకేంద్రాలు ఆలయ నిర్మాణ కార్యకలాపాలను చాలావరకు చాళుక్యుల హృదయ భూభాగంలోని చిన్న ప్రాంతంలో ఆధునిక కర్ణాటక రాష్ట్రంలోని ఐహోళె బాదామి పట్టదకల్ ఇంకా మహాకూటలో కేంద్రీకరించాయి. వారి ఆలయ నిర్మాణ కార్యకలాపాలను మూడు దశలుగా వర్గీకరించవచ్చు. దశ వ శతాబ్దం ి త్రైమాసికంలో మైంది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.024456521739130432,
    "all_scores": {
      "Chalukya": 0.024456521739130432
    }
  },
  "440": {
    "paragraph": "ఈ దశలో అనేక గుహాలయాలు ఏర్పడ్డాయి. వాటిలో ముఖ్యమైనవి ఐహోళెలోని మూడు ప్రాథమిక గుహాలయాలు ఒక వైదిక ఒక జైన మరియు ఒక అసంపూర్ణ బౌద్ధ ఆలయాలు . తరువాతవి బాదామిలోని నాలుగు అభివృద్ధి చెందిన గుహాలయాలు వీటిలో మూడవ గుహలోని వైష్ణవ దేవాలయం నాటిది . బాదామిలోని ఈ గుహాలయాలు ఒకే విధంగా ఉంటాయి.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.06569343065693431,
    "all_scores": {
      "Chalukya": 0.06569343065693431
    }
  },
  "441": {
    "paragraph": "వాటిలో ప్రతి ఒక్కటి వెలుపలి భాగం సాదాగా ఉంటుంది. కానీ అనూహ్యంగా పూర్తి చేసిన లోపలి భాగంలో స్తంభాల వరండా మంటపం రాతిలోకి లోతుగా చెక్కిన పూజలు అందుకునే దైవం వెలసిన గర్భగుడి ఉన్నాయి. బాదామిలో మూడు గుహల దేవాలయాలు వైదికమైనవి ఒకటి జైన దేవాలయం. వేద దేవాలయాలలో హరిహర మహిషాసురమర్ధిని వరాహ నరసింహ త్రివిక్రమ అనంత శయనుడైన విష్ణువు మరియు నటరాజు చిత్రాలను బాగా చెక్కారు.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.05056179775280899,
    "all_scores": {
      "Chalukya": 0.05056179775280899
    }
  },
  "442": {
    "paragraph": "వీరి రెండవ దశలో ఐహోళె బాదామిలో నిర్మించారు. ఐహోళెలో దాదాపు డెబ్బై నిర్మాణాలు ఉన్నాయి. దీనిని భారతీయ ఆలయ నిర్మాణాల పుట్టినిల్లు అని పిలుస్తారు. ఈ దేవాలయాల యొక్క కచ్చితమైన కాలం నీయాంశమైనప్పటికీ ఈ నిర్మాణాలు సా.శ సంవత్సరంలో మైనట్లు ఏకాభిప్రాయం ఉంది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.07317073170731708,
    "all_scores": {
      "Chalukya": 0.07317073170731708
    }
  },
  "444": {
    "paragraph": "ఈ కాలానికి చెందిన ఇతర ద్రవిడ శైలి ఆలయాలు నాగరాల్ లోని నాగనాథ ఆలయం బానంటిగుడి ఆలయం మహాకూటేశ్వర ఆలయం మహాకూటలోని మల్లికార్జున ఆలయం దిగువ శివాలయ ఆలయం మాలెగిట్టి శివాలయ ఆలయం ఎగువ బాదామిలోని జంబులింగేశ్వర ఆలయం. చాళుక్యుల నిర్మాణ కేంద్రానికి వెలుపల బాదామికి ఆగ్నేయంగా కి.మీ దూరంలో చాళుక్యుల శైలికి సంబంధించిన నిర్మాణంతో వ శతాబ్దపు ి నాటి సండూరులోని అసాధారణమైన పార్వతి ఆలయం ఉంది. ఇది అడుగుల పొడవు అడుగుల వెడల్పుతో మధ్యస్థ పరిమాణం ఉంటుంది. ఇది నగర అనబడే ఉత్తరభారత శైలి గోపురం ద్రవిడ దక్షిణ భారత శైలి భాగాలను కలిగి ఉంది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.03529411764705882,
    "all_scores": {
      "Chalukya": 0.03529411764705882
    }
  },
  "445": {
    "paragraph": "దీనికి మంటపం లేదు. బారెల్ వాల్ట్ తో కప్పబడిన అంతరాలయాన్ని కలిగి ఉంది. ఆలయం యొక్క అస్థిరమైన పునాది నిర్మాణ పథకం వ శతాబ్దంలో చాలా తర్వాత ప్రజాదరణ పొందింది. ప్రస్తుతం యునెస్కో ప్రపంచ వారసత్వ ప్రదేశంగా గుర్తించబడిన వ శతాబ్దంలో నిర్మించబడిన పట్టదకల్ లోని నిర్మాణాత్మక దేవాలయాలు బాదామి చాళుక్యుల వాస్తుశిల్పం యొక్క పరాకాష్ఠ పరిణతి చెందిన దశను సూచిస్తుంది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.025787965616045846,
    "all_scores": {
      "Chalukya": 0.025787965616045846
    }
  },
  "446": {
    "paragraph": "బాదామిలోని భూతనాథ దేవాలయాల సమూహం కూడా ఈ కాలం నాటివే. పట్టదకల్ వద్ద పది దక్షిణ ద్రావిడ శైలిలో ఆరు మరియు ఉత్తర నాగర శైలిలో నాలుగు ఆలయాలు ఉన్నాయి. వీటిలో సంగమేశ్వర ఆలయం విరూపాక్ష దేవాలయం మరియు మల్లికార్జున ఆలయం దక్షిణాది శైలిలో ప్రసిద్ధి చెందినవి. పాపనాథ దేవాలయం మరియు గలగనాథ దేవాలయం నగర ద్రవిడ కలయిక శైలిలో ప్రయత్నాలు.",
    "kingdoms": [
      "Vijayanagara",
      "Chalukya"
    ],
    "confidence": 0.08069620253164557,
    "all_scores": {
      "Vijayanagara": 0.08069620253164557,
      "Chalukya": 0.056962025316455694
    }
  },
  "447": {
    "paragraph": "విరూపాక్ష మరియు మల్లికార్జున దేవాలయాలు కాంచీపురం పల్లవులపై సైనిక విజయం సాధించిన తరువాత రాజు రెండవ విక్రమాదిత్యుడు ఇద్దరు రాణులచే నియమించబడినట్లు శాసన ఆధారాలు సూచిస్తున్నాయి. చాళుక్యుల వాస్తుశిల్పుల ప్రసిద్ధ పేర్లు రేవడి ఓవజ్జ నరసోబ్బ మరియు అనివారిత గుండ. పశ్చిమ చాళుక్యుల పరిపాలనా కాలం దక్కన్ వాస్తునిర్మాణ శైలి అభివృద్ధికి ముఖ్యమైన కాలం. వీరి శైలి వ శతాబ్దానికి చెందిన బాదామి చాళుక్యుల శైలికి వ శతాబ్దంలో ప్రాచుర్య పొందిన హొయసల శైలికి మధ్య భావనాత్మక వారధిగా పనిచేసింది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.019148936170212766,
    "all_scores": {
      "Chalukya": 0.019148936170212766
    }
  },
  "450": {
    "paragraph": "వ శతాబ్దానికి చెందిన నాలుగవ జైన గుహాలయంలో బాహుబలి వ శతాబ్దానికి చెందిన నాలుగవ జైన గుహాలయంలో బాహుబలి వ గుహాలయంలో విష్ణువు ప్రతిమ వ గుహాలయంలో విష్ణువు ప్రతిమ బాదామి చెరువుకి అభిముఖంగా ఉన్న భూతనాథ ఆలయాల సమూహం బాదామి చెరువుకి అభిముఖంగా ఉన్న భూతనాథ ఆలయాల సమూహం బాదామికి కి.మీ ఆగ్నేయంగా నెలకొని ఉన్న పార్వతి ఆలయం బాదామికి కి.మీ ఆగ్నేయంగా నెలకొని ఉన్న పార్వతి ఆలయం ఐహోళె దుర్గా దేవి ఆలయం ముందు దృశ్యం ఐహోళె దుర్గా దేవి ఆలయం ముందు దృశ్యం ఐహోళె మెగుటి జైన దేవాలయం ఐహోళె మెగుటి జైన దేవాలయం ద్రవిడ శైలిలో నిర్మితమయిన మల్లికార్జున ఆలయం పట్టదకల్ లో నగర శైలిలో నిర్మితమైన కాశీ విశ్వనాథ ఆలయం సా. శ ద్రవిడ శైలిలో నిర్మితమయిన మల్లికార్జున ఆలయం పట్టదకల్ లో నగర శైలిలో నిర్మితమైన కాశీ విశ్వనాథ ఆలయం సా. శ ఒకటవ గుహలో నాట్యం చేస్తున్న శివుడి విగ్రహం ఒకటవ గుహలో నాట్యం చేస్తున్న శివుడి విగ్రహం సా.శ కి చెందిన పాపనాథ ఆలయం ఇందులో దక్షిణ ఉత్తర భారతదేశాల శైలి కలిసిపోయి ఉంటుంది. సా.శ కి చెందిన పాపనాథ ఆలయం ఇందులో దక్షిణ ఉత్తర భారతదేశాల శైలి కలిసిపోయి ఉంటుంది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.01929260450160772,
    "all_scores": {
      "Chalukya": 0.01929260450160772
    }
  },
  "452": {
    "paragraph": "అదే కాలానికి చెందిన రాజు మూడవ సోమేశ్వరుడు పేరొందిన పండితుడు. ఈయన అన్ని కళలు విజ్ఞానశాస్త్రాలతో కూడిన మానసోల్లాస అనే విజ్ఞానసర్వస్వాన్ని రచించాడు. బాదామి చాళుక్యుల కాలం నుంచే పూర్వపు కన్నడ సాహిత్యం ఉన్నట్లు ప్రస్తావనలు ఉన్నాయి కానీ అవి ఏవీ అందుబాటులో లేవు. శాసనాల్లో మాత్రం కన్నడ భాషను సహజ భాషగా వర్ణించారు.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.029411764705882353,
    "all_scores": {
      "Chalukya": 0.029411764705882353
    }
  },
  "453": {
    "paragraph": "సుమారు కి చెందిన కప్పె ఆరభట్ట రికార్డులో త్రిపది ఛందస్సులో ఉన్న కన్నడ కవిత్వం ఉంది. జయకీర్తి ప్రస్తావించిన కర్ణాటేశ్వర కథ రెండవ పులకేశిని ప్రస్తుతిస్తూ రాసిన రచన ఈ కాలానికి చెందినదే. బాదామి చాళుక్యుల దేశం సైన్యం సువ్యవస్థితమైన చాళుక్య సైన్యం రెండవ పులకేశి వింద్యపర్వతాలను దాటి జైత్రయాత్ర సాగించేందుకు దోహదపడింది. వీరి సైన్యంలో కాల్బలం అశ్విక దళం గజ సైన్యం ఇంకా శక్తివంతమైనా నావికా దళం ఉండేది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.022959183673469385,
    "all_scores": {
      "Chalukya": 0.022959183673469385
    }
  },
  "454": {
    "paragraph": "చైనా యాత్రికుడు హువాన్ జాంగ్ చాళుక్య సైన్యంలో వందలకొద్దీ ఏనుగులు ఉండేవనీ వాటిని యుద్ధరంగంలోకి తీసుకెళ్ళే ముందు మద్యం సేవింపజేసేవారనీ రాశాడు. వీరి నావికాదళం సహాయంతోనే రేవతీ ద్వీపాన్ని ప్రస్తుతం గోవా తూర్పు తీరాన ఉన్న పూరీని జయించారు. రాష్ట్రకూటుల శాసనాలలో చాళుక్యుల సైన్య బలాన్ని కర్ణాటకబల అని వర్ణించేవారు. భూపరిపాలన చాళుక్యుల పరిపాలనా విధానం మగధ శాతవాహన పరిపాలనా విధానాన్ని పోలి ఉంటుంది.",
    "kingdoms": [
      "Rashtrakuta",
      "Satavahana"
    ],
    "confidence": 0.07731958762886598,
    "all_scores": {
      "Rashtrakuta": 0.07731958762886598,
      "Satavahana": 0.05412371134020618
    }
  },
  "456": {
    "paragraph": "స్థానిక సమావేశాలు మరియు సంఘాలు స్థానిక సమస్యలను పరిశీలించేవి. మహాజనల సమూహాలు బ్రాహ్మణులు ఘటిక అనబడే అగ్రహారాలను చూసుకునే వారు. బాదామిలో మంది మహాజనులు మరియు ఐహోల్ లో మంది మహాజనులు సేవ చేశారు. సరుకులపై హెర్జుంకా అనే పన్నులు విధించేవారు.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.07692307692307693,
    "all_scores": {
      "Chalukya": 0.07692307692307693
    }
  },
  "457": {
    "paragraph": "రవాణా జరిగే చిల్లర వస్తువులపై కిరుకుల పన్ను బిల్ కోడ్ అనే అమ్మకపు పన్ను తమలపాకులపై పన్నయా పన్ను భూమిపై సిద్ధాయా పన్ను రాజులకు వద్దరావుల పన్ను వసూలు చేసేవారు. నాణేలు ఉత్తర భారత సామ్రాజ్యాలతో పోలిస్తే బాదామి చాళుక్యులు భిన్నమైన ప్రమాణాలతో కూడిన నాణేలు ముద్రించారు. ఈ నాణేల మీద నాగరి కన్నడ పురాణాలు ఉండేవి. మంగలేశుడు వేయించిన నాణేల్లో ఒక వైపు దేవాలయం మరో వైపు రెండు దీపాల మధ్య రాజదండం ఉన్నాయి.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.023076923076923078,
    "all_scores": {
      "Chalukya": 0.023076923076923078
    }
  },
  "458": {
    "paragraph": "రెండవ పులకేశి నాణేల్లో ఒక వైపు పక్కకు తిరిగిన సింహం బొమ్మ మరో వైపు దేవాలయం ఉన్నాయి. ఈ నాణేలు ఒక్కొక్కటి నాలుగు గ్రాముల బరువు ఉన్నాయి. వీటిని పురాతన కన్నడ భాషలో హొణ్ హొణ్ణు అని వ్యవహరించేవారు. మతం బాదామి చాళుక్యుల కాలంలో శైవం వైష్ణవం రెండూ ప్రాచుర్యంలో ఉండేవి.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.03474903474903475,
    "all_scores": {
      "Chalukya": 0.03474903474903475
    }
  },
  "459": {
    "paragraph": "శైవానికి కాస్త ఎక్కువ ప్రాధాన్యత ఉండేదని తెలుస్తున్నది. పట్టదకల్ ఐహొళె మహాకూట ప్రాంతాల్లో అనేక దేవాలయాలు నిర్మించబడ్డాయి. ఉత్తర భారతదేశం నుంచి పురోహితులను ఆహ్వానించేవారు. వైదిక క్రతువులు వ్రతాలు దానాలు ప్రముఖంగా జరిగేవి.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.08181818181818182,
    "all_scores": {
      "Chalukya": 0.08181818181818182
    }
  },
  "460": {
    "paragraph": "బాదామి పాలకులు వేదకాలం నాటి హైందవ ధర్మాన్ని అనుసరించి ఐహోళెలో శివుడు విష్ణువు కార్తికేయుడు గణపతి శక్తి సూర్యుడు సప్తమాతృకలు మొదలైన హిందూ ప్రధాన దైవాలకు ఆలయాలు నిర్మించారు. బాదామి చాళుక్యులు అశ్వమేధయాగాన్ని కూడా చేశారు. సంతానానికి అధిదేవత అయిన లజ్జగౌరి దేవతను ఆరాధించారు. ఈ కాలంలోనే జైనమతం కూడా ఆదరణ పొందింది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.02922077922077922,
    "all_scores": {
      "Chalukya": 0.02922077922077922
    }
  },
  "464": {
    "paragraph": "ఈ ప్రభావం వల్ల ఆయా భాషల సాహిత్యం మరింత ఇనుమడించింది. హిందూ న్యాయచట్టం పశ్చిమ చాళుక్య ప్రభువైన నాలుగో విక్రమాదిత్యుని ఆస్థానంలో ఉండిన విజ్ఞానేశ్వరుడు రాసిన మితాక్షర అనే గ్రంథం నుంచి ప్రభావితమైంది. పశ్చిమ చాళుక్యుల కాలంలోనే దక్షిణ భారతదేశంలో భక్తి ఉద్యమం ఊపందుకుంది. ప్రతి సంవత్సరం పట్టదకల్ బాదామి ఐహోళెలో కర్ణాటక ప్రభుత్వం మూడు రోజుల పాటు సంగీతం నృత్యంతో కూడిన చాళుక్య ఉత్సవాలు నిర్వహిస్తుంది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.022959183673469385,
    "all_scores": {
      "Chalukya": 0.022959183673469385
    }
  },
  "465": {
    "paragraph": "వ దశకంలో కన్నడ నటుడు రాజ్ కుమార్ నటించిన ఇమ్మడి పులకేశి అనే చిత్రం రెండవ పులకేశి జీవితాన్ని కాలాన్ని ప్రతిబింబిస్తుంది. రాష్ట్రకూటులు చరిత్ర పరికరాల పెట్టె స్వరూపం దాచు పాఠ్యం చిన్న ప్రామాణిక పెద్ద వెడల్పు ప్రామాణిక వెడల్పుగా రంగు ఆటోమాటిగ్గా ప్రకాశవంతంగా చీకటిగా మాన్యఖేట రాష్ట్రకూటులు స్థాయి రాజధాని మాన్యఖేట సామాన్య భాషలు కన్నడ సంస్కృతం మతం ప్రభుత్వం చరిత్ర స్థాపన పతనం రాష్ట్రకూటులు సా.శ. వ శతాబ్దాల మధ్య భారత ఉపఖండంలోని పెద్ద భాగాలను పాలించిన రాజవంశం. పురాతన రాష్ట్రకూట శాసనమైన వ శతాబ్దపు రాగి పలక మధ్య లేదా పశ్చిమ భారతదేశంలోని మనపురా అనే నగరం నుండి వారు చేసిన పాలనను వివరిస్తుంది.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.04180887372013652,
    "all_scores": {
      "Rashtrakuta": 0.04180887372013652
    }
  },
  "466": {
    "paragraph": "అదే సమయంలో అచలాపూర్ కన్నౌజ్ వంటి ఇతర ప్రాంతాలను పాలించిన రాజులు కూడా రాష్ట్రకూటులే. వీరు యాదవ వంశానికి చెందిన సాత్యకి వారసులమని తమ శాసనాలలో తెలియజేశారు. ఎలిచ్ పూర్ తెగ బాదామి చాళుక్యులకు పాలెగాళ్ళుగా ఉండేవారు. దంతిదుర్గుడు చాళుక్య రెండవ కీర్తివర్మను అధికారం నుండి కూలదోసి ఆధునిక కర్ణాటక లోని గుల్బర్గా ప్రాంతం కేంద్రంగా ఒక సామ్రాజ్యాన్ని నిర్మించాడు.సా.శ.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.06619718309859156,
    "all_scores": {
      "Rashtrakuta": 0.06619718309859156,
      "Chalukya": 0.025352112676056335
    }
  },
  "467": {
    "paragraph": "లో దక్షిణ భారతదేశంలో అధికారంలోకి వచ్చిన ఈ వంశం మాన్యఖేటకు చెందిన రాష్ట్రకూటులుగా పేరుబడింది. అదే సమయంలో బెంగాల్ యొక్క పాల వంశం మాళ్వాకు చెందిన ప్రతీహార రాజవంశాలు తూర్పు వాయవ్య భారతదేశంలో బలపడుతున్నాయి. అరబిక్ గ్రంథం సిల్సిలాత్ అల్ తవారిఖ్ రాష్ట్రకూటులను ప్రపంచంలోని నాలుగు ప్రధాన సామ్రాజ్యాలలో ఒకటిగా పేర్కొంది. ఈ కాలం వ వ శతాబ్దాల మధ్య సంపద్వంతమైన గంగా మైదానాల వనరుల కోసం త్రిముఖ పోరాటం జరిగింది.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.06801007556675064,
    "all_scores": {
      "Rashtrakuta": 0.06801007556675064
    }
  },
  "468": {
    "paragraph": "ఈ మూడు సామ్రాజ్యాలూ కొద్ది కొద్ది కాలాల పాటు కన్నౌజ్ వద్ద అధికార స్థానాన్ని స్వాధీనం చేసుకున్నాయి. మాన్యఖేటకు చెందిన రాష్ట్రకూటులు ఉచ్ఛస్థితిలో ఉన్న కాలంలో ఉత్తరాన గంగా యమునల దోయబ్ నుండి దక్షిణాన కన్యాకుమారి వరకూ ఉన్న విస్తారమైన సామ్రాజ్యాన్ని పరిపాలించారు. రాజకీయ విస్తరణ నిర్మాణ విజయాలు ప్రసిద్ధ సాహిత్య రచనల ఫలవంతమైన కాలం అది. ఈ రాజవంశం లోని తొలి రాజులు హిందూ మతాన్ని తరువాత రాజులు జైనమతాన్నీ అవలంబించారు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.05024509803921568,
    "all_scores": {
      "Rashtrakuta": 0.05024509803921568
    }
  },
  "469": {
    "paragraph": "వారి పాలనలో జైన గణిత శాస్త్రవేత్తలు పండితులు కన్నడ సంస్కృతాల్లో ముఖ్యమైన రచనలు చేశారు. ఈ రాజవంశం లోని అత్యంత ప్రసిద్ధ రాజు మొదటి అమోఘవర్షుడు కన్నడ భాషలో ఒక మైలురాయి సాహిత్య రచన అయిన కవిరాజమార్గ రాశాడు. ద్రావిడ శైలి వాస్తుశైలి ఉచ్ఛస్థితిని చేరుకుంది. దీనికి ఉత్తమ ఉదాహరణ ఆధునిక మహారాష్ట్రలోని ఎల్లోరాలోని కైలాసనాథ్ ఆలయంలో కనిపిస్తుంది.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.06287425149700598,
    "all_scores": {
      "Rashtrakuta": 0.06287425149700598
    }
  },
  "470": {
    "paragraph": "ఇతర ముఖ్యమైన నిర్మాణాలు కాశీవిశ్వనాథ ఆలయం ఆధునిక కర్ణాటకలోని పట్టడకల్ వద్ద ఉన్న జైన నారాయణ ఆలయం రెండూ యునెస్కో ప్రపంచ వారసత్వ ప్రదేశాలు . చరిత్ర మాన్యఖేట సామ్రాజ్యం రాష్ట్రకూట రాజవంశం యొక్క మూలం భారత చరిత్రలో ఒక వివాదాస్పద అంశం. క్రీస్తుపూర్వం వ శతాబ్దంలో అశోక చక్రవర్తి కాలం నాటి రాష్ట్రకూటుల పూర్వీకుల మూలం పట్ల వ శతాబ్దాల్లో ఉత్తర మధ్య భారతదేశంలోని దక్కన్ లోని చిన్నచిన్న రాజ్యాలను పరిపాలించిన అనేక రాష్ట్రకూట రాజవంశాల మధ్య సంబంధాల పట్లా ఈ వివాదాలు ఉన్నాయి. ఈ మధ్యయుగ రాష్ట్రకూటులకు వ శతాబ్దాల మధ్య పాలించిన మాన్యఖేటకు చెందిన రాష్ట్రకూటులకు కర్ణాటక రాష్ట్రంలోని గుల్బర్గా జిల్లాలోని ప్రస్తుత మల్ఖేడ్ సంబంధం కూడా నీయాంశమైంది.",
    "kingdoms": [
      "Rashtrakuta",
      "Chalukya"
    ],
    "confidence": 0.03588516746411483,
    "all_scores": {
      "Rashtrakuta": 0.03588516746411483,
      "Chalukya": 0.019138755980861243
    }
  },
  "471": {
    "paragraph": "రాష్ట్రకూట చరిత్రకు మూలాలు మధ్యయుగ శాసనాలు పాళీ భాషలోని ప్రాచీన సాహిత్యం సంస్కృత కన్నడ భాషలలోని సమకాలీన సాహిత్యం అరబ్ యాత్రికుల రచనలు. రాజవంశపు పారంపర్యం సూర్య వంశం చంద్రవంశం స్థానిక ప్రాంతం పూర్వీకుల స్థానం వగైరాల గురించి వివిధ సిద్ధాంతాలున్నాయి. శాసనాలు రాజ చిహ్నాలు రాష్ట్రిక వంటి పురాతన వంశం పేర్లు రట్ట రాష్ట్రకూట లట్టాలూర పురవరాధీశ్వర వగైరాలు యువరాజులు యువరాణుల పేర్లు నాణేలు వంటి అవశేషాల ఆధారంగా ఈ సిద్ధాంతాలను కాయించారు. తొలి రాష్ట్రకూటులు ఏ జాతికి భాషా సమూహానికి చెంది ఉండవచ్చనే విషయమై పండితులలో ఉంది.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.04852941176470588,
    "all_scores": {
      "Rashtrakuta": 0.04852941176470588
    }
  },
  "472": {
    "paragraph": "వాయవ్య భారతదేశంలోని జాతి సమూహాలు కన్నడిగ రెడ్డి మరాఠా పంజాబ్ ప్రాంతానికి చెందిన తెగలు సంభవనీయమైన జాతులు. అయితే నుండి వ శతాబ్దంలో ఈ రాజవంశానికి చెందిన పాలకులు కన్నడ భాషకు సంస్కృతానికి ఇచ్చినంత ప్రాముఖ్యతనిచ్చారనే విషయమై పండితుల్లో ఏకాభిప్రాయం ఉంది. రాష్ట్రకూట శాసనాల్లో కన్నడ సంస్కృతం రెండింటినీ ఉపయోగిస్తారు చరిత్రకారులు షెల్డన్ పొల్లాక్ జాన్ హౌబెన్ వంటి వారు ఎక్కువగా కన్నడలో ఉన్నాయని పేర్కొన్నారు పాలకులు రెండు భాషలలోని సాహిత్యాన్నీ ప్రోత్సహించారు. తొట్టతొలి కన్నడ రచనలు రాష్ట్రకూటుల ఆస్థానం లోని కవులు రచించినవే.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.058252427184466014,
    "all_scores": {
      "Rashtrakuta": 0.058252427184466014
    }
  },
  "473": {
    "paragraph": "ఈ రాష్ట్రకూటులు కన్నడిగులు అయినప్పటికీ వారొక ఉత్తర దక్కన్ భాషలో కూడా మాట్లాడగలిగేవారు. రాష్ట్రకూట సామ్రాజ్యంలో ఆధునిక కర్ణాటక మహారాష్ట్ర రాష్ట్రాలు పూర్తిగాను ఆంధ్రప్రదేశ్ తెలంగాణ లోని కొంత భాగమూ ఉన్నాయి. ఈ ప్రాంతాన్ని రాష్ట్రకూటులు రెండు శతాబ్దాల పాటు పాలించారు. సామన్ గఢ్ రాగి పలక శాసనం ప్రకారం దంతిదుర్గుడనే పాళెగాడు బహుశా బేరార్ లోని అచలాపుర మహారాష్ట్రలో ఆధునిక ఎలిచ్ పూర్ నుండి పాలించేవాడు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.08829113924050633,
    "all_scores": {
      "Rashtrakuta": 0.08829113924050633
    }
  },
  "474": {
    "paragraph": "లో అతడు రెండవ కీర్తివర్మకు చెందిన గొప్ప కర్ణాటక సైన్యాన్ని బాదామి చాళుక్యుల సైన్యాన్ని సూచిస్తూ బాదామిలో ఓడించి చాళుక్య సామ్రాజ్యపు ఉత్తర ప్రాంతాలను స్వాధీనం చేసుకున్నాడు. ఆ తరువాత అతను తన మామ పల్లవ రాజు నందివర్మన్ చాళుక్యుల నుండి కంచిని తిరిగి పొందటానికి సహాయం చేశాడు. మాళ్వాలోని గుర్జర్లను కళింగ కోసల శ్రీశైలం పాలకులను ఓడించాడు. ఇతనిని దంతివర్మ అని కూడా అంటారు.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.049586776859504134,
    "all_scores": {
      "Chalukya": 0.049586776859504134
    }
  },
  "475": {
    "paragraph": "అద్వితీయ బలపరాక్రమ సంపన్నుడు. అతడికి ఖడ్గావలోక వైరమేఘ అనే బిరుదులున్నాయి. దంతిదుర్గుని వారసుడు కృష్ణ నేటి కర్ణాటక కొంకణాల ప్రధాన భాగాలను తన ఆధీనంలోకి తెచ్చాడు. లో నియంత్రణలోకి తీసుకున్న ధ్రువధరవర్ష పాలనలో రాజ్యం కావేరి నదికి మధ్య భారతదేశం మధ్య ఉన్న భూభాగాలన్నింటినీ కలుపుకొని ఒక సామ్రాజ్యంగా విస్తరించింది.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.05637254901960784,
    "all_scores": {
      "Rashtrakuta": 0.05637254901960784
    }
  },
  "476": {
    "paragraph": "అతను కనౌజ్ పైకి దాడి చేసి అక్కడి గుర్జర ప్రతీహారులను బెంగాలు లోని పాల రాజులనూ ఓడించాడు. ఈ దండయాత్రలో అతడికి కీర్తి సంపదలు అపారంగా లభించాయిగానీ కొత్తగా భూభాగం పొందలేదు.తూర్పు చాళుక్యులు తాలకాడ్ లోని గాంగులను కూడా తన అధీనం లోకి తెచ్చుకున్నాడు. ఆల్టేకర్ సేన్ ల ప్రకారం అతడి పాలనలో రాష్ట్రకూటులు యావద్భారత వ్యాప్త శక్తిగా మారారు. విస్తరణ ధ్రువ ధరవర్ష మూడవ కుమారుడు మూడవ గోవిందుడు సింహాసనం అధిరోహించడం మునుపెన్నడూ లేని విజయవంతమైన శకానికి తెరదీసింది.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.04842342342342343,
    "all_scores": {
      "Rashtrakuta": 0.04842342342342343
    }
  },
  "477": {
    "paragraph": "ఈ సమయంలో రాష్ట్రకూటుల రాజధాని ఉన్న ప్రదేశం గురించి అనిశ్చితి ఉంది. అతని పాలనలో గంగా మైదానాలపై నియంత్రణ కోసం రాష్ట్రకూటులు పాలాలు ప్రతిహారుల మధ్య త్రివిధ వివాదాలు రేగాయి. ప్రతిహార చక్రవర్తి నాగభట్ట పైన పాలా చక్రవర్తి ధర్మపాలుడి పైనా మూడవ గోవిందుడు సాధించిన విజయాలను వివరిస్తూ అతడి గుర్రాలు హిమాలయాల్లోని చల్లటి నీళ్ళను తాగాయని అతని యుద్ధంలో ఏనుగులు పవిత్ర గంగా జలాలను తాగాయనీ సంజన్ శాసనం చెప్పింది. అతని సైనిక దండయాత్రలను అలెగ్జాండర్ తోటి మహాభారతంలోని అర్జునుడి తోటీ పోల్చారు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.05210526315789474,
    "all_scores": {
      "Rashtrakuta": 0.05210526315789474
    }
  },
  "478": {
    "paragraph": "కనౌజ్ ను స్వాధీనం చేసుకున్నాక అతడు దక్షిణంగా కదిలాడు. గుజరాత్ కోసల కౌశల్ గంగావాడి లను స్వాధీన పరచుకున్నాడు. కంచిలో పల్లవులను ఓడించాడు. వేంగిలో తనకు అనుకూలుడిని నియమించాడు.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.08771929824561403,
    "all_scores": {
      "Chalukya": 0.08771929824561403
    }
  },
  "479": {
    "paragraph": "సిలోన్ రాజు లొంగిప్యి దానికి గుర్తుగా రెండు విగ్రహాలను అతడికి సమర్పించుకున్నారు రాజు విగ్రహం అతని మంత్రి విగ్రహం . చోళులు పాండ్యులు కొంగు చేరరాజులు అందరూ ఆయనకు లొంగి కప్పం సమర్పించుకున్నారు. ఒక చరిత్రకారుడు చెప్పినట్లుగా హిమాలయ గుహల నుండి మలబార్ తీరం ఒడ్డు వరకు దక్కన్ దుందుభులు మోగాయి. రాష్ట్రకూట సామ్రాజ్యం ఇప్పుడు కేప్ కొమొరిన్ నుండి కన్నౌజ్ వరకూ బనారస్ నుండి భరూచ్ వరకు విస్తరించింది .",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.07904884318766067,
    "all_scores": {
      "Rashtrakuta": 0.07904884318766067,
      "Chola": 0.019280205655526992
    }
  },
  "480": {
    "paragraph": "మూడవ గోవిందుడి వారసుడు మొదటి అమోఘవర్షుడు మాన్యఖేటను తన రాజధానిగా చేసుకుని పెద్ద సామ్రాజ్యాన్ని పరిపాలించాడు. సామ్రాజ్య పతనం వరకూ మాన్యఖేటయే రాష్ట్రకూటుల రాజధానిగా ఉంది. అతను లో సింహాసనానికి వచ్చాడు కాని వరకు అతను భూస్వాములు మంత్రుల తిరుగుబాట్లను అణచానికే సరిపోయింది. అమోఘవర్ష తన ఇద్దరు కుమార్తెలను పశ్చిమ గాంగులకు ఇచ్చి పెళ్ళిళ్ళు చేసి వారితో శాంతి నెలకొల్పుకున్నాడు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.05722070844686648,
    "all_scores": {
      "Rashtrakuta": 0.05722070844686648
    }
  },
  "481": {
    "paragraph": "ఆపై వింగవల్లి వద్ద ఆక్రమించిన తూర్పు చాళుక్యులను ఓడించి వీరనారాయణ అనే బిరుదును పొందాడు . అతని పాలన గోవింద పాలన వలె ఉగ్రమైనది కాదు అతను తన పొరుగువారితో గంగా తూర్పు చాళుక్యులు పల్లవులతో స్నేహపూర్వక సంబంధాలు కొనసాగించడానికి ఇష్టపడ్డాడు వీరితో అతను వైవాహిక సంబంధాలను కూడా పెంచుకున్నాడు. అతని యుగం కళలు సాహిత్యం మతాల విషయంలో సుసంపన్నమైనది. రాష్ట్రకూట చక్రవర్తులలో అత్యంత ప్రసిద్ధుడిగా విస్తృతంగా కనిపించే మొదటి అమోఘవర్షుడు కన్నడ సంస్కృతంలో నిష్ణాతుడైన పండితుడు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.06578947368421052,
    "all_scores": {
      "Rashtrakuta": 0.06578947368421052
    }
  },
  "483": {
    "paragraph": "రెండవ కృష్ణుడి పాలనలో సామ్రాజ్యం తూర్పు చాళుక్యుల నుండి తిరుగుబాటును ఎదుర్కొంది. రాజ్యపు విస్తీర్ణం తగ్గి పశ్చిమ దక్కన్ గుజరాత్ ల వరకు పరిమితమైంది. రెండవ కృష్ణుడు గుజరాత్ శాఖకు ఉన్న స్వతంత్ర హోదాను ముగించి మాన్యఖేట ప్రత్యక్ష నియంత్రణలోకి తీసుకువచ్చాడు. మూడవ ఇంద్రుడు పరమారను ఓడించి మధ్య భారతదేశంలో రాష్ట్రకూటుల ప్రాబల్యాన్ని తిరిగి స్థాపించాడు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.07848837209302326,
    "all_scores": {
      "Rashtrakuta": 0.07848837209302326,
      "Satavahana": 0.03488372093023256
    }
  },
  "484": {
    "paragraph": "తరువాత గంగా యమునల దోయబ్ ప్రాంతాన్ని ఆక్రమించుకున్నాడు. వేంగిపై తమకున్న ప్రాబల్యాన్ని కొనసాగిస్తూ తమకు సాంప్రదాయికంగా శత్రువులైన ప్రతీహారులను పాలాలను ఓడించాడు. కన్నౌజ్ లో ఆయన సాధించిన విజయాల ప్రభావం నాల్గవ గోవింద చక్రవర్తి లో వేయించిన రాగి పలక శాసనం ప్రకారం చాలాకాలం పాటు కొనసాగింది. వరసగా పాలనకు వచ్చిన బలహీనమైన రాజుల కారణంగా సామ్రాజ్యం ఉత్తర తూర్పు భూభాగాలపై నియంత్రణ కోల్పోయింది.",
    "kingdoms": [
      "Chalukya"
    ],
    "confidence": 0.03937007874015748,
    "all_scores": {
      "Chalukya": 0.03937007874015748
    }
  },
  "485": {
    "paragraph": "ఆ తరువాత వచ్చిన చిట్ట ి గొప్ప రాష్ట్రకూట పాలకుడు మూడవ కృష్ణుడు సామ్రాజ్యాన్ని తిరిగి ఏకీకృతం చేశాడు. దాంతో ఇది నర్మదా నది నుండి కావేరి నది వరకు విస్తరించింది. ఉత్తర తమిళ దేశం తోండైమండలం కూడా సామ్రాజ్యంలో భాగమైంది. సిలోన్ రాజు కూడా కప్పం కట్టేవాడు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.12145748987854252,
    "all_scores": {
      "Rashtrakuta": 0.12145748987854252,
      "Satavahana": 0.048582995951417005
    }
  },
  "486": {
    "paragraph": "క్షీణత సా.శ. లో ఖొట్టిగ అమోఘవర్ష పాలనలో పరమార రాజు సియాకా హర్షుడు సామ్రాజ్యంపై దాడి చేసి రాష్ట్రకూటుల రాజధాని మాన్యఖేటను దోచుకున్నాడు. ఇది రాష్ట్రకూట సామ్రాజ్యం యొక్క ఖ్యాతిని తీవ్రంగా దెబ్బతీసింది. తత్ఫలితంగా దాని పతనానికి దారితీసింది.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.10010593220338981,
    "all_scores": {
      "Rashtrakuta": 0.10010593220338981
    }
  },
  "487": {
    "paragraph": "ఆధునిక బీజాపూర్ జిల్లాలోని తార్దావాడి ప్రాంతాన్ని పాలించే రాష్ట్రకూటుల పాళెగాడు రెండవ తైలపుడు ఈ ఓటమిని అవకాశంగా తీసుకొని స్వాతంత్ర్యం ప్రకటించుకున్నాడు. దాంతో రాష్ట్రకూటుల అంతిమ పతనం చాలా వేగంగా జరిగింది. ి చక్రవర్తి నాల్గవ ఇంద్రుడు శ్రావణబెళగొళ వద్ద సల్లేఖన జైన సన్యాసులు ఉపవాసం చేసి పొందే మరణం కు పాల్పడ్డాడు. రాష్ట్రకూటుల పతనంతో దక్కన్ ఉత్తర భారతదేశాల్లోని వారి పాళెగాళ్ళు సంబంధిత వంశాలు స్వాతంత్ర్యం ప్రకటించుకున్నాయి.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.07109004739336493,
    "all_scores": {
      "Rashtrakuta": 0.07109004739336493
    }
  },
  "488": {
    "paragraph": "పశ్చిమ చాళుక్యులు మాన్యఖేటను స్వాధీనం చేసుకున్నారు. వరకు దీనిని తమ రాజధానిగా చేసుకున్నారు. వ శతాబ్దంలో రాష్ట్రకూటుల ప్రధాన భూభాగంలో గొప్ప సామ్రాజ్యాన్ని నిర్మించారు. ఆధిపత్యం యొక్క దృష్టి కృష్ణ గోదావరి దోయబ్ లోని వేంగికి మారింది.",
    "kingdoms": [
      "Rashtrakuta",
      "Chalukya"
    ],
    "confidence": 0.09170305676855894,
    "all_scores": {
      "Rashtrakuta": 0.09170305676855894,
      "Chalukya": 0.06550218340611354
    }
  },
  "489": {
    "paragraph": "పశ్చిమ దక్కన్లోని రాష్ట్రకూటుల పూర్వపు పాళెగాళ్ళు చాళుక్యుల నియంత్రణలోకి వచ్చారు. ఇప్పటివరకు అణచివేయబడిన తంజావూరు చోళులు దక్షిణాన వారి ప్రబల శత్రువులుగా మారారు. ముగింపులో మాన్యఖేటకు చెందిన రాష్ట్రకూటుల పెరుగుదల భారతదేశంపై భారతదేశం యొక్క ఉత్తరాన కూడా గొప్ప ప్రభావాన్ని చూపింది. సమకాలీన భారతదేశంలో వారి సామ్రాజ్యం అతిపెద్దదని సులైమాన్ అల్ మసూడి ఇబ్న్ ఖుర్దాద్బా రాశారు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.05722070844686648,
    "all_scores": {
      "Rashtrakuta": 0.05722070844686648,
      "Chola": 0.020435967302452313
    }
  },
  "490": {
    "paragraph": "ప్రపంచంలోని నాలుగు గొప్ప సమకాలీన సామ్రాజ్యాలలో ఇది ఒకటని సులైమాన్ పేర్కొన్నాడు. వ శతాబ్దానికి చెందిన అరబ్బులు అల్ మసూది ఇబ్న్ ఖోర్దిద్ బిహ్ యొక్క యాత్రా కథనాల ప్రకారం హిందుస్తాన్ రాజులలో చాలామంది ప్రార్థన చేస్తున్నప్పుడు రాష్ట్రకూట రాజు వైపు ముఖాలు తిప్పుతారు. అతని రాయబారులకు సాష్టాంగ నమస్కారం చేస్తారు. రాష్ట్రకూట రాజును రాజాధిరాజు అని పిలుస్తారు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.08595988538681949,
    "all_scores": {
      "Rashtrakuta": 0.08595988538681949
    }
  },
  "491": {
    "paragraph": "వీరు సైన్యం బహు గొప్పది. వారి సామ్రాజ్యం కొంకణ్ నుండి సింధ్ వరకు విస్తరించింది. కొంతమంది చరిత్రకారులు ఈ సమయాన్ని ఇంపీరియల్ కన్నౌజ్ యుగం అని పిలుస్తారు. రాష్ట్రకూటులు కన్నౌజ్ ను విజయవంతంగా స్వాధీనం చేసుకుని దాని పాలకులపై కప్పం విధించి తమను తాము ఉత్తర భారతదేశపు ప్రభులుగాగా చూపించారు కాబట్టి ఈ యుగాన్ని ఇంపీరియల్ కర్ణాటక యుగం అని కూడా పిలుస్తారు.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.07194767441860465,
    "all_scores": {
      "Rashtrakuta": 0.07194767441860465
    }
  },
  "492": {
    "paragraph": "వ నుండి వ శతాబ్దాలలో మధ్య ఉత్తర భారతదేశంలో వారి రాజకీయ విస్తరణ సమయంలో రాష్ట్రకూటులులు లేదా వారి బంధువులు అనేక రాజ్యాలను సృష్టించారు. ఇవి మాతృ సామ్రాజ్యం కింద పాలించాయి లేదా పతనం తరువాత శతాబ్దాల పాటు పాలన కొనసాగించాయి లేదా చాలా కాలం తరువాత అధికారంలోకి వచ్చాయి. వీరిలో ప్రముఖులు గుజరాత్ లోని రాష్ట్రకూటులు ఆధునిక కర్ణాటకలోని సౌందట్టికి చెందిన రట్టాలు కన్నౌజ్ కు చెందిన గహదవాలాలు హస్తికుండి లేదా హత్తుండి నుండి పాలించిన రాజస్థాన్కు చెందిన రాష్ట్రకూటులు రాజపుతానా అని పిలుస్తారు దహల్ జబల్పూర్ వద్ద మండోర్ కు చెందిన రాథోడ్ లు జోధ్పూర్ దగ్గర ధనోప్ కు చెందిన రాథోడ్ లు ఆధునిక మహారాష్ట్రలోని మయూరగిరికి చెందిన రాష్ట్రకూటులు కన్నౌజ్ కు చెందిన రాష్ట్రకూటులు. సా.శ.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.052752293577981654,
    "all_scores": {
      "Rashtrakuta": 0.052752293577981654
    }
  },
  "493": {
    "paragraph": "వ శతాబ్దం ంలో రాజధిరాజ చోళుడు సిలోన్ ద్వీపాన్ని స్వాధీనం చేసుకోవడం అక్కడ నలుగురు రాజుల పతనానికి దారితీసింది. చరిత్రకారుడు కె. పిళ్ళే ప్రకారం జాఫ్నా రాజ్యానికి చెందిన రాజు మాదవరాజా రాష్ట్రకూట రాజవంశం నుండి అధికారాన్ని లాక్కున్నాడు. విజయనగర సామ్రాజ్యం చరిత్ర పరికరాల పెట్టె స్వరూపం దాచు పాఠ్యం చిన్న ప్రామాణిక పెద్ద వెడల్పు ప్రామాణిక వెడల్పుగా రంగు ఆటోమాటిగ్గా ప్రకాశవంతంగా చీకటిగా విజయనగర సామ్రాజ్యం విజయనగర సామ్రాజ్యం విజయనగర సామ్రాజ్యం స్థాయి సామ్రాజ్యము రాజధాని విజయనగరం సామాన్య భాషలు తెలుగు కన్నడ మతం హిందూ ధర్మం ప్రభుత్వం రాచరికం రాజు మొదటి బుక్క భుపతి రాయలు మూడవ శ్రీరంగరాయలు చరిత్ర స్థాపన ఏప్రిల్ పతనం హొయసల సామ్రాజ్యం కాకతీయులు పాండ్య రాజ్యం మైసూరు రాజ్యం కేళడి నాయకులు తంజావూరు నాయకులు మదురై నాయకులు చిత్రదుర్గ నాయకులు దక్షిణ ఆసియా చరిత్ర సారాంశం భారత ఉపఖండ చరిత్ర సొయనియన్ సా.శ.పూ.",
    "kingdoms": [
      "Rashtrakuta",
      "Vijayanagara",
      "Kakatiya"
    ],
    "confidence": 0.0379746835443038,
    "all_scores": {
      "Rashtrakuta": 0.0379746835443038,
      "Vijayanagara": 0.02531645569620253,
      "Kakatiya": 0.023417721518987345,
      "Chola": 0.007594936708860759
    }
  },
  "498": {
    "paragraph": "శ్రీలంక రాజ్యాలు దేశచరిత్రలు ప్రాంతీయ చరిత్రలు ప్రత్యేక చరిత్రలు విజయనగర సామ్రాజ్యం సంగమ వంశం మొదటి హరిహర రాయలు మొదటి బుక్క రాయలు రెండవ హరిహర రాయలు విరూపాక్ష రాయలు రెండవ బుక్క రాయలు మొదటి దేవ రాయలు రామచంద్ర రాయలు వీర విజయ బుక్క రాయలు రెండవ దేవ రాయలు మల్లికార్జున రాయలు రెండవ విరూపాక్ష రాయలు ప్రౌఢ రాయలు సాళువ వంశం సాళువ నరసింహదేవ రాయలు తిమ్మ భూపాలుడు రెండవ నరసింహ రాయలు తుళువ వంశం తుళువ నరస నాయకుడు వీరనరసింహ రాయలు శ్రీ కృష్ణదేవ రాయలు అచ్యుత దేవ రాయలు సదాశివ రాయలు ఆరవీడు వంశం అళియ రామ రాయలు తిరుమల దేవ రాయలు శ్రీరంగ రాయలు వెంకట శ్రీ రంగ రాయలు రామదేవ రాయలు వెంకట శ్రీరంగ రాయలు విజయనగర సామ్రాజ్యాన్ని కర్ణాట సామ్రాజ్యం అని పోర్చుగీసువారు బిస్నెగర్ రాజ్యం కూడా పిలుస్తారు . ఇది దక్షిణ భారతదేశంలోని దక్కను పీఠభూమి ప్రాంతంలో ఉంది. దీనిని లో సంగమ రాజవంశానికి చెందిన మొదటి హరిహర రాయుడు సోదరుడు మొదటి బుక్క రాయుడు స్థాపించారు. వీరు యాదవ వంశానికి చెందిన చంద్రవంశ క్షత్రియులు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.028258362168396767,
    "all_scores": {
      "Vijayanagara": 0.028258362168396767
    }
  },
  "499": {
    "paragraph": "వ శతాబ్దం ి నాటికి ఇస్లామికు దండయాత్రలను నివారించడానికి దక్షిణాది శక్తుల ప్రయత్నాల పరాకాష్ఠగా ఈ సామ్రాజ్యం ప్రాముఖ్యతను సంతరించుకుంది. ఇది వరకు కొనసాగినప్పటికీ లో తళ్ళికోట యుద్ధంలో దక్కను సుల్తానేట్ల సంయుక్త సైన్యాలుతో జరిగిన పోరాటంలో ఓటమి తరువాత దాని శక్తి క్షీణించింది. ఈ సామ్రాజ్యం దాని రాజధాని విజయనగరం పేరు మీద ఉంది. దీని శిథిలాలు ప్రస్తుత హంపి పరిసరాలలో ఉన్నాయి.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.03532608695652174,
    "all_scores": {
      "Vijayanagara": 0.03532608695652174
    }
  },
  "500": {
    "paragraph": "హంపి ప్రపంచ వారసత్వ సంపదగా గుర్తించబడింది. డొమింగో పేసు ఫెర్నావో నూన్సు నికోలో డా కాంటి వంటి మధ్యయుగ ఐరోపా ప్రయాణికుల రచనలు స్థానిక భాషలలోని సాహిత్యం దాని చరిత్ర గురించి కీలకమైన సమాచారాన్ని అందిస్తాయి. విజయనగరం వద్ద జరిపిన పురావస్తు త్రవ్వకాలలో సామ్రాజ్యం శక్తి సంపద వెల్లడయ్యాయి. దక్షిణ భారతదేశంలో విస్తరించిన సామ్రాజ్యం వారసత్వసంబంధిత అనేక స్మారక చిహ్నాలను కలిగి ఉంది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.03513513513513514,
    "all_scores": {
      "Vijayanagara": 0.03513513513513514
    }
  },
  "501": {
    "paragraph": "వీటిలో బాగా తెలిసినది హంపి వద్ద ఉన్న నిర్మాణ సమూహం. దక్షిణ మధ్య భారతదేశంలో వివిధ ఆలయ నిర్మాణ సంప్రదాయాలు విజయనగర నిర్మాణకళా శైలిలో నిర్మితమయ్యాయి. ఈ సంశ్లేషణ హిందూ దేవాలయాల నిర్మాణ ఆవిష్కరణలకు ప్రేరణనిచ్చింది. విజయనగరపాలన సమర్థవంతమైన పరిపాలన శక్తివంతమైన విదేశీ వాణిజ్యం నీటిపారుదల నీటి నిర్వహణ వ్యవస్థ వంటి కొత్త సాంకేతిక పరిజ్ఞానాన్ని తీసుకువచ్చింది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.038461538461538464,
    "all_scores": {
      "Vijayanagara": 0.038461538461538464
    }
  },
  "502": {
    "paragraph": "సామ్రాజ్యం ప్రోత్సాహంతో కన్నడ తెలుగు తమిళం సంస్కృతంలో లలిత కళలు సాహిత్యం కొత్త ఎత్తులకు చేరుకోగలిగింది. ప్రస్తుత రూపంలో కర్ణాటక సంగీతం ఉద్భవించింది. విజయనగర సామ్రాజ్యం దక్షిణ భారత చరిత్రలో హిందూ మత ప్రచారం చేయడం ద్వారా దక్షిణ భరతదేశాన్ని సమైక్యపరచి ప్రాంతీయతను అధిగమించింది. పేరు వెనుక చరిత్ర విజయనగర సామ్రాజ్యానికి మరొక పేరు కర్ణాట రాజ్య కర్ణాట సామ్రాజ్యం .",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.06843575418994413,
    "all_scores": {
      "Vijayanagara": 0.06843575418994413
    }
  },
  "503": {
    "paragraph": "దీనిని కొన్ని శాసనాలు విజయనగర కాలంలోని సాహిత్య రచనలు సంస్కృత రచన జాంబవతి కళ్యాణం కృష్ణదేవరాయ తెలుగు రచన వాసు చరితములు సాక్ష్యంగా ఉన్నాయి. ఆనెగొంది విజయనగర సామ్రాజ్యాన్ని హరిహర హక్క బుక్క అనే అన్నదమ్ములు లో స్ధాపించారు. వారి రాజధాని మొదట ఆనెగొంది. ఆనెగొంది ప్రస్తుతము తుంగభద్ర ఉత్తర తీరమున ఒక చిన్న పల్లె.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.06907894736842105,
    "all_scores": {
      "Vijayanagara": 0.06907894736842105
    }
  },
  "504": {
    "paragraph": "సామ్రాజ్యము బుక్కరాయని పరిపాలనలో అభివృద్ధి చెందిన తరువాత రాజధానిని తుంగభద్ర దక్షిణ తీరమున గల విజయనగరము నకు తరలించారు. ఈ సామ్రాజ్యం నుండి వరకు వర్ధిల్లింది. ి శతాబ్దాన్ని దీనికి క్షీణదశగా చెప్పుకోవచ్చు. సుల్తానుల సమాఖ్య వీరిని తళ్ళికోట యుద్ధంలో దారుణంగా ఓడించింది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.03992395437262357,
    "all_scores": {
      "Vijayanagara": 0.03992395437262357
    }
  },
  "507": {
    "paragraph": "రాయల కుటుంబీకుల్లో ఎవరి వివాహం నిశ్చయమైనా మొదట హంపిలోనే పూజలు చేస్తారు. స్థాపన విజయనగర సామ్రాజ్య స్థాపనకు శతాబ్దము తరువాత దక్షిణ భారత దేశము లోని రాజ్యములను ముస్లింలు జయించారు. లో మాలిక్ కాఫర్ ఓరుగల్లును ఆక్రమించి మలబార్ రాజ్యములపై దాడి చేశాడు. ఆ సమయమున హరహర బుక్క అను సోదరులు ప్రతాపరుద్రుని ఆస్థానములో కోశాధికారులుగా ఉన్నారు.",
    "kingdoms": [
      "Kakatiya",
      "Vijayanagara"
    ],
    "confidence": 0.10153846153846154,
    "all_scores": {
      "Kakatiya": 0.10153846153846154,
      "Vijayanagara": 0.05076923076923077
    }
  },
  "508": {
    "paragraph": "సోదరులిద్దరిని ఢిల్లీకి తరలించి ఇస్లాము మతానికి మార్చారు. హోయసల రాజు తిరుగుబాటు అణచివేయుటకు సుల్తాను వీరిద్దరినీ ద్వారసముద్రము పంపాడు.దాని తరువాత దక్షిణ భారతదేశంలో హిందువులు విజయనగర సామ్రాజ్య నాయకత్వం లో ముస్లిం రాజుల నీ ఓడించి మళ్ళీ హిందూ రాజ్యాలు స్థాపించారు. బుక్క భూపతి రాయలనే బుక్కరాయలని కూడా అంటారు. అయినె విజయనగర సామ్రాజ్యానికి తొలి చక్రవర్త.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.060171919770773644,
    "all_scores": {
      "Vijayanagara": 0.060171919770773644
    }
  },
  "509": {
    "paragraph": "దక్కను ప్రాంతంలోని ముస్లిమ్ సామంతుల తిరుగుబాట్ల వల్ల ముహమ్మద్ తుగ్లక్ పాలన అంతమవడంతో దెవరాయలు ఏలుబడిలోని ప్రాంతం త్వరితంగా విస్తరించింది. విజయనగర రాజధాని ప్రాంతంలో ఆనెగొందికి ఎదురుగా తుంగభద్రానదికి ఆవలి తీరాన స్థాపించబడింది. దెవరాయల తర్వాత లో అధికారంలోకి వచ్చిన మల్లికార్జున రాయలు ఇంకా అచ్చత రాయలు వరకు పాలించాడు. వారి పాలనా కాలం కొచ్చేసరికి దక్షిణభారత దేశంలో తుంగభద్రానదికి దక్షిణాన ఉన్న ప్రాంతమంతా దాదాపుగా అతడి ఏలుబడిలోకి వచ్చింది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.04838709677419355,
    "all_scores": {
      "Vijayanagara": 0.04838709677419355
    }
  },
  "510": {
    "paragraph": "చరిత్ర విజయనగర సామ్రాజ్యం మూలానికి సంబంధించి భిన్నమైన సిద్ధాంతాలు ప్రతిపాదించబడ్డాయి. ఉత్తర భారతదేశం నుండి ముస్లిం దండయాత్రలను నివారించడానికి తుంగభద్ర ప్రాంతంలో ఉన్న హొయసల సామ్రాజ్యం సైన్యంలోని కన్నడిగులు సైనికాధికారులు అయిన మొదటి హరిహర రాయలు మొదటి బుక్కరాయలు విజయనగర సామ్రాజ్యాన్ని స్థాపించారు అని చాలా మంది చరిత్రకారులు ప్రతిపాదించారు. మరికొందరు వారు తెలుగు ప్రజలు మొదట కాకతీయ రాజ్యంతో సంబంధం కలిగి ఉన్నారు. హొయసల సామ్రాజ్యక్షీణత సమయంలో ఉత్తర భాగాలను తమ ఆధీనంలోకి తీసుకున్నారు.",
    "kingdoms": [
      "Kakatiya",
      "Vijayanagara"
    ],
    "confidence": 0.059498956158663886,
    "all_scores": {
      "Kakatiya": 0.059498956158663886,
      "Vijayanagara": 0.050104384133611686
    }
  },
  "511": {
    "paragraph": "వారి మూలంతో సంబంధం లేకుండా దక్షిణ భారతదేశం మీద ముస్లిం దండయాత్రకు వ్యతిరేకంగా పోరాడటానికి శృంగేరి ఆశ్రమంలో సాధువు అయిన విద్యారణ్యస్వామి మద్దతు ప్రేరణ లభించిందని చరిత్రకారులు అంగీకరిస్తున్నారు. విజయనగర రాజ్యంలో ఇటీవలి త్రవ్వకాలు మధ్యయుగ యుగంలో విదేశీ ప్రయాణికులు రాసిన రచనలు కోటలు శాస్త్రీయ పరిణామాలు నిర్మాణ ఆవిష్కరణలు సామ్రాజ్యం చరిత్ర గురించి చాలా అవసరమైన సమాచారాన్ని కనుగొన్నాయి. వ శతాబ్దం ంలో విజయనగర సామ్రాజ్యం అభివృద్ధికి ముందు దక్కను హిందూ రాష్ట్రాలు దేవగిరి యాదవ సామ్రాజ్యం వరంగలు కాకతీయ రాజవంశం మదురై పాండ్య సామ్రాజ్య సైన్యాలు విజయనగరం మీద పదేపదే దాడి చేశారు. లో ఎగువ దక్కను ప్రాంతం ఆధునిక మహారాష్ట్ర తెలంగాణ అంతటినీ సుల్తాను అలావుద్దీను ఖల్జీ ఢిల్లీ సుల్తానేటు ముహమ్మదు బిన్ తుగ్లకు సైన్యాలు ఓడించాయి.",
    "kingdoms": [
      "Vijayanagara",
      "Kakatiya"
    ],
    "confidence": 0.035864978902953586,
    "all_scores": {
      "Vijayanagara": 0.035864978902953586,
      "Kakatiya": 0.025316455696202528
    }
  },
  "513": {
    "paragraph": "కంపిలి రాజ్యం ప్రస్తుత కర్ణాటక రాష్ట్రంలోని ఈశాన్య భాగాలలో గుల్బర్గా తుంగాభద్ర నది సమీపంలో ఉంది. ఢిల్లీ సుల్తానేటు సైన్యాలు ఓడించిన తరువాత ఇది ముగిసింది. మాలికు జాడా నేతృత్వంలోని విజయవంతమైన సైన్యం కంపిలి రాజ్యం మీద విజయంసాధించిన వార్తలతో ఢిల్లీలోని ముహమ్మదు బిన్ తుగ్లకుకు చనిపోయిన హిందూ రాజు గడ్డితో నింపిన తల పంపించబడింది. సా.శ.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.04090909090909091,
    "all_scores": {
      "Rashtrakuta": 0.04090909090909091
    }
  },
  "514": {
    "paragraph": "లో కంపిలిలో జనాభా ఒక జౌహరు సామూహిక ఆత్మహత్య కు పాల్పడింది. ఎనిమిది సంవత్సరాల తరువాత కంపిలి రాజ్యం శిధిలాల నుండి సా.శ. లో విజయనగర రాజ్యం ఉద్భవించింది. సామ్రాజ్యం స్థాపించిన మొదటి రెండు దశాబ్దాలలో మొదటి హరిహరరాయలు తుంగభద్ర నదికి దక్షిణాన చాలా ప్రాంతాల మీద నియంత్రణ సాధించి పూర్వాపస్చిమ సముదాయశివర తూర్పు పశ్చిమ సముద్రాల మాస్టర్ బిరుదును సంపాదించాడు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.06051873198847262,
    "all_scores": {
      "Vijayanagara": 0.06051873198847262
    }
  },
  "515": {
    "paragraph": "నాటికి మొదటి హరిహరరాయలు వారసుడైన మొదటి బుక్కారాయలు ఆర్కాటు ప్రధాన రాజ్యం కొండవీడు రెడ్లు మదురై సుల్తాన్లను ఓడించి పశ్చిమప్రాంతంలోని గోవా మీద ఉత్తరప్రాంతంలో తుంగభద్ర కృష్ణ నది పరీవాహకప్రాంతం మీద నియంత్రణ సాధించారు. వారి రాజధాని నేటి కర్ణాటకలోని తుంగభద్ర నది ఉత్తర ఒడ్డున ఉన్న అనెగోండి రాజ్యంలో ఉంది. మొదటి బుక్క రాయ పాలనలో రాజధానిని తరువాత నది దక్షిణ ఒడ్డున ఉన్న విజయనగరానికి తరలించారు. ఉత్తర భూముల నుండి ముస్లిం సైన్యాలు సాగించే నిరంతరం దాడి చేయడాన్ని ఎదుర్కొనడాన్ని సుభతరం చేయడానికి రజధాని విజయనగరానికి తరలించ బడింది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.04054054054054054,
    "all_scores": {
      "Vijayanagara": 0.04054054054054054
    }
  },
  "516": {
    "paragraph": "విజయనగర సామ్రాజ్యం ఇప్పుడు పొట్టితనాన్ని కలిగి ఉండటంతో మొదటి బుక్కరాయరాయలు రెండవ కుమారుడు రెండవ హరిహరరాయలు కృష్ణ నదికి దాటిన రాజ్యాన్ని మరింత సంఘటితం చేసి దక్షిణ భారతదేశం మొత్తాన్ని విజయనగర గొడుగు కిందకు తీసుకువచ్చాడు. తరువాతి పాలకుడు మొదటి దేవరాయరాయలు ఒడిశా గజపతులకు వ్యతిరేకంగా విజయవంతమై కోట నిర్మాణం నీటిపారుదల ముఖ్యమైన కార్యక్రమాలు చేపట్టాడు. ఇటాలియను యాత్రికుడు నికోలో డి కాంటి ఆయనను భారతదేశపు అత్యంత శక్తివంతమైన పాలకుడిగా పేర్కొంటూ రాశాడు. రెండవ దేవరాయరాయలు గజబెటెకర అని పిలుస్తారు లో సింహాసనం మీద విజయం సాధించారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.046153846153846156,
    "all_scores": {
      "Vijayanagara": 0.046153846153846156
    }
  },
  "518": {
    "paragraph": "లో బహమనీ సుల్తానేటుకు చెందిన ఫిరుజు బహ్మణి విజయనగరానికి చెందిన మొదటి దేవరాయతో ఒక ఒప్పందం కుదుర్చుకున్నాడు. దీనికి బహమనీకి హంసు ఐదు మాండ్స్స్ ముత్యాలు యాభై ఏనుగులు వార్షిక కప్పం అర్పించవలసి ఉంది. లో సుల్తానేటు విజయనగరపై దండెత్తినప్పుడు కప్పం చెల్లించడంలో విఫలమయ్యాడు. వ శతాబ్దంలో విజయనగర కప్పం చెల్లింపు కోసం ఇటువంటి యుద్ధాలు పునరావృతమయ్యాయి.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.06158357771260997,
    "all_scores": {
      "Vijayanagara": 0.06158357771260997
    }
  },
  "519": {
    "paragraph": "లో కప్పం చెల్లిమలేదని సుల్తాను మొదటి అహ్మదు చెల్లించని ఒక యుద్ధాన్ని ించాడు. తరువాతి సుల్తానేట్సు విజయనగర యుద్ధాలు విజయనగర మిలిటరీని విస్తరించాయి. దాని శక్తి దాని సైనిక సైనికాధికారి మధ్య వివాదాల ఫలితంగా లో సలువా నరసింహ ఒక తిరుగుబాటుకు నాయకత్వం వహించి రాజవంశ పాలనను ముగించారు. అదే సమయంలో ఉత్తరాన బహమనీ సుల్తానేటు విచ్ఛిన్నం తరువాత సృష్టించబడింది సామ్రాజ్యాన్ని సుల్తానేట్ల దాడుల నుండి రక్షించడం కొనసాగించారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.051597051597051594,
    "all_scores": {
      "Vijayanagara": 0.051597051597051594
    }
  },
  "520": {
    "paragraph": "లో మరొక సైన్యాధ్యక్షుడు తులువా నరస నాయక తిరుగుబాటులో సాలూవ వారసుడి నుండి విజయనగర పాలనను చేపట్టాడు. ఈ సామ్రాజ్యం లో తులువా నరస నాయక కుమారుడు కృష్ణ దేవరాయ పాలనలో వచ్చింది. హిందువులను ముస్లింలను తన సైన్యంలోకి నియమించడం ద్వారా ఆయన సామ్రాజ్యాన్ని బలపరిచి సంఘటితం చేశాడు. తరువాతి దశాబ్దాలలో ఇది దక్షిణ భారతదేశం అంతటా విస్తరించి దాని ఉత్తరాన స్థాపించబడిన ఐదు దక్కను సుల్తానేట్ల దండయాత్రలను విజయవంతంగా ఓడించింది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.051980198019801985,
    "all_scores": {
      "Vijayanagara": 0.051980198019801985
    }
  },
  "521": {
    "paragraph": "క్రిష్ణ దేవరాయుడి పాలనలో వరుస విజయాలతో సామ్రాజ్యం శిఖరాగ్రస్థాయిని చేరుకుంది. గతంలో ఉత్తర తూర్పుదక్కనులోని సుల్తానేట్ల పాలనలో ఉన్న భూభాగాలను కళింగ భూభాగాలను దక్షిణాన ఇప్పటికే స్థాపించబడిన భూభాగాలను సారాజ్యంలో విలీనం చేసుకుంది. కృష్ణ దేవరాయల కాలంలో అనేక ముఖ్యమైన స్మారక చిహ్నాలు పూర్తయ్యాయి కొన్ని ించబడ్డాయి. విజయనగర వద్ద సహజ కోట లో కృష్ణ దేవరాయ తరువాత అతని తమ్ముడు అచ్యుత దేవరాయుడి పాలించాడు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.05343511450381679,
    "all_scores": {
      "Vijayanagara": 0.05343511450381679
    }
  },
  "522": {
    "paragraph": "లో అచ్యుత దేవరాయ మరణించిన తరువాత అచ్యుతరాయ టీనేజు మేనల్లుడు సదాశివరాయుడిని రాజుగా నియమించారు. సంరక్షకులుగా అలియా రామరాయలు కృష్ణ దేవరాయ అల్లుడు నుండి అల్ ముల్క్ ను గోల్కొండ సుల్తానేటుకు నియమించినప్పుడు సుల్తాన్ కులీ కుతుబ్ అల్ ముల్క్ కు సేవ చేసిన వ్యక్తి ని నియమించారు. అలియా రామరాయలు గోల్కొండ సుల్తానేటును విడిచిపెట్టి దేవరాయ కుమార్తెను వివాహం చేసుకుని అధికారంలోకి వచ్చాడు. సదాశివరాయ దేవరాయ కుమారుడు యుక్త వయస్సుకు రాగానే అలియా రామరాయ ఆయనను జైలులో ఉంచి మామ అచ్యుతరాయను సంవత్సరానికి ఒకసారి బహిరంగంగా హాజరుకావడానికి అనుమతించారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.022813688212927757,
    "all_scores": {
      "Vijayanagara": 0.022813688212927757
    }
  },
  "523": {
    "paragraph": "అలియ రామరాయ తన మునుపటి సుల్తానేటు కనెక్షన్ల నుండి ముస్లిం సైనికాధికారులను తన సైన్యంలో నియమించుకుని తనను తాను సుల్తాన్ ఆఫ్ ది వరల్డ్ అని పిలిచాడు. రాయల చిహ్నం వరాహము సూర్యుడు చంద్రుడు బాకు. విజయనగరానికి ఉత్తరాన ఉన్న సుల్తానేట్లు జనవరిలో తళ్ళికోట యుద్ధంలో అలియా రామరాయ సైన్యం మీద దాడి చేశారు. యుద్ధంలో విజయనగర పక్షం యుద్ధంలో విజయం సాధించింది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.061764705882352944,
    "all_scores": {
      "Vijayanagara": 0.061764705882352944
    }
  },
  "524": {
    "paragraph": "అకస్మాత్తుగా విజయనగర సైన్యానికి చెందిన ఇద్దరు ముస్లిం సైనికాధికారులు అలియరాయలుకు వ్యతిరేకంగా సుల్తానేట్ల పట్ల తమ విధేయతను మార్చుకున్నారు. సైనికాధికారులు అలియా రామరాయలును పట్టుకుని అక్కడికక్కడే నరికి చంపారు. సుల్తాను హుస్సేను సుల్తానేట్లతో కలిసి కత్తిరించిన తలను ప్రదర్శన కోసం గడ్డితో నింపడం కోసం వారితో చేరారు. అలియా రామరాయల శిరచ్ఛేదం విజయనాగర ఇప్పటికీ సైన్యంలోని విశ్వసనీయ భాగాలలో గందరగోళాన్ని వినాశనాన్ని సృష్టించింది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.053571428571428575,
    "all_scores": {
      "Vijayanagara": 0.053571428571428575
    }
  },
  "525": {
    "paragraph": "ఇది అవకాశంగా తీసుకుని మిగిలిన సైన్యాలను పూర్తిగా నిర్మూలించారు. సుల్తానేట్సు సైన్యం హంపిని దోచుకుని దానిని ప్రస్తుతం ఉన్న శిధిలమైన స్థితికి తగ్గించింది ఇది తిరిగి ఆక్రమించబడలేదు. తళ్ళికోట యుద్ధం తరువాత తిరుమల దేవరాయ అరవీడు రాజవంశాన్ని ించి నాశనం చేసిన హంపి స్థానంలో పెనుకొండను కొత్త రాజధానిగా స్థాపించి విజయనగర సామ్రాజ్యం అవశేషాలను పునర్నిర్మించడానికి ప్రయత్నించారు. తిరుమల దేవరాయుడు లో పదవీ విరమణ చేసి తన రాజ్య అవశేషాలను తన ముగ్గురు కుమారులకు విభజించి లో మరణించే వరకు ఆధ్యాత్మిక జీవితాన్ని కొనసాగించాడు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.03968253968253968,
    "all_scores": {
      "Vijayanagara": 0.03968253968253968
    }
  },
  "526": {
    "paragraph": "అరవీడు రాజవంశం వారసులు ఈ ప్రాంతాన్ని పరిపాలించారు. కాని లో సామ్రాజ్యం కూలిపోయింది. బీజాపూరు సుల్తానేటు ఇతరులతో నిరంతర నాటికి ి అవశేషాలు ముగిశాయి. ఈ కాలంలో దక్షిణ భారతదేశంలో ఎక్కువ రాజ్యాలు స్వతంత్రం ప్రకటించుకుని విజయనగర నుండి విడిపడినాయి.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.08786610878661089,
    "all_scores": {
      "Vijayanagara": 0.08786610878661089
    }
  },
  "527": {
    "paragraph": "స్వాతంత్ర్యాన్ని ప్రకటించిన వారిలో మైసూరు రాజ్యం కేలాడి నాయక మదురై నాయకులు టాంజూరు నాయకులు చిత్రదుర్గ నాయకులు జింగీ నాయకు ఉన్నారు. ఇవన్నీ రాబోయే శతాబ్దాలలో దక్షిణ భారతదేశ చరిత్ర మీద గణనీయమైన ప్రభావాన్ని చూపాయి. తారస్థాయి విజయనగర ప్రజలు ధరించే దుస్తులు డచ్ పెయింటర్ అయిన కార్నెలియస్ హజర్ చిత్రం తరువాత రెండు శతాబ్దాలలో విజయనగర సామ్రాజ్య ఆధిపత్యం దక్షిణ భారత దేశమంతటా ప్రకాశించింది. యావద్భారత ఉపఖండములోనే విజయనగరము బలీయమైన రాజ్యంగా వెలిసింది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.04772727272727272,
    "all_scores": {
      "Vijayanagara": 0.04772727272727272
    }
  },
  "528": {
    "paragraph": "ఈ కాలంలో గంగా మైదానం నుండి వచ్చిన టర్కీ సుల్తానుల దాడులను సమర్థవంతంగా ఎదుర్కొన్నది. దక్కను లోని ఐదుగురు సుల్తానుల నుండి నిరంతరంగా ఘర్షణలను ఎదుర్కొని ఒక బలీయమైన శక్తిగా నిలబడింది. విజయనగరరాజులకు సామంతరాజులుగా బోయరాజులు బోయ పాలెగర్లు ఉండేవారు. శ్రీ కృష్ణదేవరాయలు పాలించిన విజయనగర సామ్రాజ్యం గజెటర్ ప్రకారం రాయదుర్గం చిత్రదుర్గం కళ్యాణదుర్గం ఈ మూడు ముఖ్యమైన కోటలతో పాటు మరికొన్ని ప్రాంతలను బోయలు పాలించారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.05583126550868486,
    "all_scores": {
      "Vijayanagara": 0.05583126550868486
    }
  },
  "529": {
    "paragraph": "వీటిని ఒకప్పుడు బోయ పాలెగర్ పాలించాడు. కళ్యాణదుర్గం అనే పేరు వ శతాబ్దంలో పాలేగర్ బోయ కల్యాణప్ప నుండి వచ్చిందని చరిత్ర ద్వారా తెలుస్తుంది. వీరు ఆంధ్రదేశంలో కోటలకు అధిపతులై విజయనగర సామ్రాజ్యానికి సామంతులుగా చేశారు. బోయలు విజయనగరసామ్రాజ్యంలో సైన్యాధక్షులుగా పనిచేసేవారని చరిత్ర ద్వారా తెలుస్తుంది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.07142857142857142,
    "all_scores": {
      "Vijayanagara": 0.07142857142857142
    }
  },
  "530": {
    "paragraph": "శతాబ్దాల మధ్య కర్నాటకలో చిత్రదుర్గ కోట నిర్మాణంలో రాష్ట్రకూటులు హోయసాలు చాళుక్యులతోపాటూ బోయ పాలెగార్లు కూడా పాలుపంచుకొన్నారు. విజయనగర రాజులకు సమంతులుగా కమ్మరాజులు అయిన పెమ్మసాని నాయకులు సూర్యదేవర నాయకులు శాయపనేని నాయకులు రావెళ్ళ నాయకులు ఆంధ్రదేశాన్ని పాలిస్తూ విజయనగర సామ్రాజ్యానికి సర్వ సైన్యాధ్యక్షులుగా ఉంటూ యుద్ధాల్లో తోడ్పడుతూ విజయనగర రక్షణ కవచంలా వారు ఎదురు నిలిచి ఆ తరువాత స్వతంత్రులుగా ఒక్కొక్కరు రెండు శతాబ్దాల వరకు పరిపాలించారు. ప్రాంతాల్లో బిజాపూరు సుల్తాను అధీనంలో ఉన్న గోవాను పోర్చుగీసు వారు ఆక్రమించుకున్నారు. ఇది బహుశా విజయనగర రాజ్యపు అనుమతి లేదా రహస్య అవగాహన ద్వారా జరిగి ఉండవచ్చు.",
    "kingdoms": [
      "Rashtrakuta",
      "Vijayanagara"
    ],
    "confidence": 0.0414572864321608,
    "all_scores": {
      "Rashtrakuta": 0.0414572864321608,
      "Vijayanagara": 0.035175879396984924
    }
  },
  "531": {
    "paragraph": "వీరిద్దరి మధ్య ఉన్న వ్యాపార సంబంధాలు వీరికి చాలా ముఖ్యమైనవి. శ్రీ కృష్ణదేవరాయలు కాలంలో ఈ సామ్రాజ్యం ఉచ్ఛస్థితికి చేరింది. దక్కనుకు తూర్పున కొండవీడు రాచకొండ కళింగుల అధీనంలోగల ప్రాంతాలను తమిళదేశమును వశపరచుకున్నాడు. సామ్రాజ్యపు గొప్ప గొప్ప నిర్మాణాలు ఆయన తోటే మొదలయ్యాయి.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.07276119402985075,
    "all_scores": {
      "Vijayanagara": 0.07276119402985075
    }
  },
  "532": {
    "paragraph": "విజయనగరం లోని హజార రామాలయం కృష్ణ దేవాలయం ఉగ్ర నరసింహ మూర్తి విగ్రహం వీటిలో కొన్ని. లో అచ్యుతరాయలు ఆయనకు వారసుడయ్యాడు. లో అళియ రామరాయలు గద్దెనెక్కాడు. ఇతడు దక్కను సుల్తానులను అనవసరంగా రెచ్చగొట్టి వారి శత్రుత్వం కొనితెచ్చుకున్నట్లు కనిపిస్తుంది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.06172839506172839,
    "all_scores": {
      "Vijayanagara": 0.06172839506172839
    }
  },
  "533": {
    "paragraph": "తళ్ళికోట యుద్ధంలో విజయనగర సైన్యాన్ని దక్కను సుల్తానులు చిత్తుగా ఓడించారు. సంయుక్త సుల్తాను సైన్యం రాజధానిని సర్వనాశనం చేసి నేలమట్టం చేసింది. యుద్ధంనుండి సజీవముగా బయటపడిన రామరాయల తమ్ముడు తిరుమలరాయలు సదాశివరాయలతో సహా పెనుకొండకు పారిపోయాడు. విద్యా సాంస్కృతిక పరంగా విజయనగర సామ్రాజ్య కాలాన్ని స్వర్ణయుగంగా పరిగణిస్తారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.06666666666666667,
    "all_scores": {
      "Vijayanagara": 0.06666666666666667
    }
  },
  "534": {
    "paragraph": "పాలన విజయనగర సామ్రాజ్యం పాలకులు తమ భూభాగాలను పరిపాలించడానికి తమ పూర్వీకులైన హొయసల కాకతీయ పాండ్య రాజ్యాలు అభివృద్ధి చేసిన పరిపాలనా పద్ధతులను అవసరమైన చోట మాత్రమే మార్పులు చేశారు. ప్రధానమంత్రి మహాప్రధన నేతృత్వంలోని మంత్రుల మంత్రి ప్రధాన సహాయంతో రాజు అంతిమ అధికారం నిర్వహిస్తాడు. ప్రధాన కార్యదర్శి కార్యకర్త లేదా రాయస్వామి సామ్రాజ్య అధికారులు అధికారి నమోదు చేసిన ఇతర ముఖ్యమైన శీర్షికలు కలిగిన వ్యక్తులు పాలనా బాధ్యతలు నిర్వహిస్తారు. ఉన్నత స్థాయి మంత్రులు అందరూ అధికారులు సైనిక శిక్షణ పొందవలసి ఉంది.",
    "kingdoms": [
      "Vijayanagara",
      "Kakatiya"
    ],
    "confidence": 0.048582995951417005,
    "all_scores": {
      "Vijayanagara": 0.048582995951417005,
      "Kakatiya": 0.03643724696356275
    }
  },
  "536": {
    "paragraph": "హంపిలోని విరుపాక్ష ఆలయంలో నాటి రాజు కృష్ణదేవరాయ కన్నడ శాసనం ఆయన పట్టాభిషేకం పెద్ద బహిరంగ మంటప నిర్మాణాన్ని వివరిస్తుంది ఈ సామ్రాజ్యాన్ని ఐదు ప్రధాన ప్రావిన్సులుగా రాజ్య విభజించారు. ఒక్కొక్కటి ఒక కమాండరు దండనాయక లేదా దండనాథ ఆధ్వర్యంలో రాజప్రతినిధి నేతృత్వంలో తరచూ రాజకుటుంబానికి చెందినవారు ఉంటారు పాలనావ్యవహారాలు నిర్వహించడానికి వారు స్థానిక భాషను ఉపయోగించారు. ఒక రాజ్యాన్ని ప్రాంతాలుగా విశాయ వెంటే లేదా కొట్టం విభజించారు. వీటినీ మరింతగా కౌంటీలుగా సిమే లేదా నాడు విభజించారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.025369978858350954,
    "all_scores": {
      "Vijayanagara": 0.025369978858350954
    }
  },
  "543": {
    "paragraph": "రాయలు ప్రోత్సాహంతో రాజధాని నగరంలో పెద్ద ట్యాంకులను నిర్మించారు. సంపన్న వ్యక్తులు సామాజిక మతపరమైన అర్హతలను పొందటానికి చిన్న ట్యాంకులకు నిధులు సమకూర్చారు. ఆర్ధికం హంపీ నందు గల పురాతన సంత మార్కెట్ ప్రదేశం తోటలు. విజయనగర సామ్రాజ్య రాజులు నిర్మించిన గజశాల యుద్ధానికి కావలసిన ఏనుగులను ఇక్కడ ఉంచే వారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.0711864406779661,
    "all_scores": {
      "Vijayanagara": 0.0711864406779661
    }
  },
  "551": {
    "paragraph": "వాటిని మొత్తం పొట్టును మేకులతో కట్టుకోకుండా తాళ్ళతో కుట్టడం ద్వారా నిర్మించబడ్డాయి. విజయనగర వస్తువులతో ఓడలు ఎర్ర సముద్రం ఓడరేవులైన అడెను మక్కాకు వెనిసు వరకు విక్రయించబడ్డాయి. సామ్రాజ్యం ప్రధాన ఎగుమతులలో మిరియాలు అల్లం దాల్చినచెక్క ఏలకులు మైరోబాలను చింతపండు కలప అనాఫిస్టులా విలువైన పాక్షిక విలువైన రాళ్ళు ముత్యాలు కస్తూరి పచ్చలు రబ్బరు కలబంద పత్తి వస్త్రం పింగాణీ ప్రాధాన్యత వహించాయి. పత్తి నూలును బర్మాకు ఇండిగోను పర్షియాకు పంపించారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.04838709677419355,
    "all_scores": {
      "Vijayanagara": 0.04838709677419355
    }
  },
  "554": {
    "paragraph": "స్థానిక పద్ధతులచే రూపొందించబడిన రంగు నమూనాలతో ముద్రించిన వస్త్రం జావా ఫార్ ఈస్ట్ లకు ఎగుమతి చేయబడింది. గోల్కొండ సాదా పత్తి పులికాటు ముద్రించిన ప్రత్యేకత. తూర్పు తీరంలో ప్రధాన దిగుమతులు ఫెర్రసు కాని లోహాలు కర్పూరం పింగాణీ పట్టు లగ్జరీ వస్తువులు. సంస్కృతి సాంఘిక జీవితం హంపీ నందు గల హజార రామాలయ బాహ్య గోడల పై చెక్కబడిన ఈ శిల్ప కళ విజయనగర సామ్రాజ్య ప్రజల జీవితాలను వర్ణిస్తుంది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.05600000000000001,
    "all_scores": {
      "Vijayanagara": 0.05600000000000001
    }
  },
  "555": {
    "paragraph": "విదేశీ సందర్శకుల రచనల నుండి వచ్చింది విజయనగర ప్రాంతంలోని పరిశోధనా బృందాలు వెలికితీసిన ఆధారాలు విజయనగర సామ్రాజ్యంలో సాంఘిక జీవితం గురించి అధిక సమాచారం లభిస్తుంది. హిందూ కుల వ్యవస్థ ప్రబలంగా కఠినంగా అనుసరించబడింది. ప్రతి కులసమాజానికి ప్రాతినిధ్యం వహించడానికి స్థానికపెద్దల సమాఖ్య ప్రాతినిధ్యం వహిస్తుంది. ఈ పెద్దలు రాజాఙ సహాయంతో నియమ నిబంధనలను రూపొందించి ప్రజలను నిర్దేశించారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.1,
    "all_scores": {
      "Vijayanagara": 0.1
    }
  },
  "558": {
    "paragraph": "అయినప్పటికీ తక్కువ కుల పండితుల మొల్ల కనకదాస వంటివారు రచనలు వేమన సర్వజ్ఞలతో సహా జనాదరణ పొందడం సమాజంలో సామాజిక సమత్వ స్థాయికి సూచనగా ఉంది. హంపీ నందు పూజింపబడిన నాగ దేవతల విగ్రహాలు. ధర్మేశ్వర ఆలయం కొండరాహళ్ళి హోస్ కోటే లో గల విజయనగర సామ్రాజ్య సమయం నాటి ఆలయ పలకలు బి.యల్.రైస్ గారు వీటిని గుర్తించారు. సతీసహగమనం ఆచారం అనుసరిస్తూ ఒక వితంతువు చనిపోయిన భర్త మృతదేహంతో తనకు తాను ఆత్మాహుతి చేసుకోవడానికి సాక్ష్యాలు విజయనగర శిథిలాలలో లభించాయి.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.048611111111111105,
    "all_scores": {
      "Vijayanagara": 0.048611111111111105
    }
  },
  "559": {
    "paragraph": "విజయనగరంలో సతీకలు సతి రాయి లేదా సతి విరాకలు సతీ యోధరాయి అని పిలువబడే సుమారు యాభై శాసనాలు కనుగొనబడ్డాయి. ఆశిసు నంది ఆధారంగా మొఘలు సైన్యాల దాడి కారణంగా రాజపుత్ర రాజ్యాలలో సతీసహగమన ఆచారం అధికరించిన మాదిరిగానే విజయనాగర సతిసహగమనం ఆచారసాధన అంటువ్యాధి కి ఒక ఉదాహరణగా ఉంది. ముస్లిం సుల్తానేట్లు హిందూ రాజ్యం మధ్య నిరంతర యుద్ధాలు విదేశీ చొరబాట్లు ఈ అభ్యాసం అధికరించడానికి కారణమని పేర్కొంది. జాను హాలీ వంటి పండితుల అభిప్రాయం ఆధారంగా ఆచారం పరిధి గురించి దానిని అభ్యసించిన తరగతుల గురించి ఆధారాలు చాలా స్పష్టంగా లేవు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.04464285714285714,
    "all_scores": {
      "Vijayanagara": 0.04464285714285714
    }
  },
  "566": {
    "paragraph": "విజయనగర నగర పరిధిలోని త్రవ్వకాల్లో బండరాళ్లు రాతి దిమ్మెలు ఆలయ అంతస్తులపై చెక్కిన ఆధారాలు ఉన్నాయి. కనుక ఈ ప్రదేశాలలో సాంఘిక కార్యకలాపాల ఉనికి వెల్లడైంది. ఈ ఆటలలో కొన్ని నేడు వాడుకలో ఉన్నాయి మరికొన్ని ఇంకా గుర్తించలేదు. మతం హంపిలోని విరూపాక్ష దేవాలయం.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.078,
    "all_scores": {
      "Vijayanagara": 0.078
    }
  },
  "567": {
    "paragraph": "మహావిష్ణువు అవతారమైన ఉగ్ర నరసింహ స్వరూపం హంపి విరూపాక్ష దేవాలయం దగ్గర అలంకృతమైన స్తంభాలు. హజారే రామ దేవాలయంలోని కుడ్యఫలకాలు. విదేశీ సందర్శకులు పొందుపరచిన విశేషాల ప్రకారం విజయనగర రాజులు అన్ని మతాలను వర్గాలను గౌరవించేవారు. విజయనగర రాజులు గోబ్రాహ్మణ ప్రతిపాలనాచార్య అనగా గోవుల బ్రాహ్మణుల సంరక్షకుడు హిందూరాయ సురత్రాణుడు అనగా హిందువుల విశ్వాసమును ఆదరించు రాజు అను బిరుదులు కలిగి ఉండేవారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.045572916666666664,
    "all_scores": {
      "Vijayanagara": 0.045572916666666664
    }
  },
  "568": {
    "paragraph": "దీని ప్రకారం విజయనగర రాజులు హిందూ మతమునకు ప్రాధాన్యం ఇచ్చే వారు అని తెలుస్తున్నది అయినప్పటికీ రాజ సభలో వారు పాటించే కొన్ని సంప్రదాయాలు దుస్తులు ఇస్లాం మతముతో పోలివుండేవి. విజయనగర సామ్రాజ్య వ్యవస్థాపకులు అయిన హరిహర బుక్కరాయలు ఇద్దరూ శివభక్తులు అయినప్పటికీ శృంగేరికి చెందిన విద్యారణ్య మునిని వైష్ణవులకు గురువుగా గుర్తించి నగదును అనుమతులను అందించారు. అలాగే విష్ణువు అవతారమైన వరాహమును విజయ నగర సామ్రాజ్య చిహ్నంగా నిర్ణయించారు. పావువంతుకు పైగా పురావస్తుశాఖ తవ్వకాలలో రజనివాసం దరిదాపుల్లోనే ఇస్లాముల నివాసాలు గుర్తించ బడ్డాయి.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.04038461538461539,
    "all_scores": {
      "Vijayanagara": 0.04038461538461539
    }
  },
  "569": {
    "paragraph": "మద్య ఆసియాకు చెందిన తైమురిడ్ రాజ్య వంశస్థులు అధికారులు విజయ నగర సామ్రాజ్యమును సందర్శించేవారు. ి సాళువ రాజులు తుళువ రాజులు వైష్ణవ భక్తులైనప్పటికి హంపిలోని విరూపాక్ష స్వామివారికి తిరుపతి వెంకటేశ్వర స్వామివారికి పాద పూజలు చేసేవారు.కృష్ణ దేవరాయలు వారి సంస్కృత రచన అయినటువంటి జాంబవతి కళ్యాణంలో విరూపాక్ష స్వామివారిని కర్ణాట రాజ్య రక్షా మణి అనగా కర్ణాట సామ్రాజ్యము యొక్క రక్షిత మణి గా అభివర్ణించడం జరిగింది. ఉడిపిలో విజయ నగర రాజులు మాధవాచార్యుల ద్వైత సిద్ధాంతాన్ని నమ్మే సన్యాసులను ఆదరించేవారు. ఆ సమయంలో భక్తి ఉద్యమం ప్రాచుర్యంలో వుంది ఎంతో మంది హరిదాసులు ఈ ఉద్యమంలో పాలుపంచుకున్నారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.028546712802768166,
    "all_scores": {
      "Vijayanagara": 0.028546712802768166
    }
  },
  "572": {
    "paragraph": "ఆ సమయంలోనే తిరుపతికి చెందిన మరొక గొప్ప కర్నాటి సంగీత స్వరకర్త అన్నమాచార్యుల వారు తెలుగులో కొన్ని వందల కీర్తనలు రచించారు. ఇస్లాం ఆనాటి ప్రపంచంలో పర్షియా టర్కీల ప్రభావం ప్రపంచం మీద భారీగా ఉండేది. ఆ సంస్కృతులు అభిలషణీయమైన సంస్కృతులు అయ్యాయి. విజయనగర సామ్రాజ్యం మతాతీతమైన ఇస్లామీకరణకు లోనయింది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.08275862068965517,
    "all_scores": {
      "Vijayanagara": 0.08275862068965517
    }
  },
  "573": {
    "paragraph": "వస్త్రధారణ వాస్తుశిల్పం వంటివాటిలో ఈ ప్రభావం కనిపిస్తుంది. ఇక మతపరంగానూ ఇస్లాంను వారు ఆదరించారు. విజయనగర చక్రవర్తులు మతపరమైన అంశాల్లో చాలా ఉదారంగా వ్యవహరించేవారనీ ముస్లింలు క్రైస్తవులు ఇతర అల్పసంఖ్యాకులు సామ్రాజ్యంలో సంతోషంగా జీవించేవారని శాసన సాహిత్యాధారాలు చెప్తున్నాయి. వ శతాబ్దం ంలో చోళులు జైన పశ్చిమ గంగా రాజవంశాన్ని ఓడించడం వ శతాబ్దంలో వైష్ణవ వీరశైవ అనుచరుల సంఖ్య పెరగడం జైనమతంపై తగ్గిన ఆసక్తికి అద్దం పడుతుంది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.050359712230215826,
    "all_scores": {
      "Vijayanagara": 0.050359712230215826,
      "Chola": 0.017985611510791366
    }
  },
  "574": {
    "paragraph": "విజయనగర భూభాగంలో రెండు ముఖ్యమైన జైన ప్రదేశాలు శ్రావణబెళగొళ కంబదహళ్ళి. దక్షిణ రాజ్యాలు అరబ్ రాజ్యాల మధ్య వాణిజ్య సంబంధాల ఫలితంగా భారతదేశ దక్షిణ ప్రాంతంతో ఇస్లామిక్ సంబంధాలు వ శతాబ్దంలోనే మయ్యాయి. జుమ్మా మసీదులు వ శతాబ్దం నాటికి రాష్ట్రకూట సామ్రాజ్యంలో ఆవిర్భవించాయి. అలానే వ శతాబ్దం ంలో మలబార్ తీరంలో అనేక మసీదులు అభివృద్ధి చెందాయి.",
    "kingdoms": [
      "Rashtrakuta"
    ],
    "confidence": 0.1404833836858006,
    "all_scores": {
      "Rashtrakuta": 0.1404833836858006,
      "Vijayanagara": 0.0634441087613293
    }
  },
  "575": {
    "paragraph": "స్థానికంగా స్థిరనివాసులు ఏర్పరుచుకున్న ముస్లింలు స్థానిక స్త్రీలను వివాహం చేసుకున్నారు వారి పిల్లలను మప్పిలా మోప్లా అని పిలుస్తారు. వీరు గుర్రపు వ్యాపారం నౌకాదళం వంటి వాటిలో చురుకుగా పాల్గొనేవారు. విజయనగర సామ్రాజ్యం బహమనీ సుల్తానేట్ ల మధ్య పరస్పర సంబంధాలు దక్షిణాన ముస్లింల ఉనికిని పెంచాయి. మలబార్ క్రైస్తవులకు భూమి మంజూరు చేసిన రాగి ఫలకను కనుగొనడం ద్వారా వ శతాబ్దంలోనే క్రైస్తవ మతం దక్షిణ ప్రాంతానికి విస్తరించిందని చెప్పవచ్చు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.05607476635514018,
    "all_scores": {
      "Vijayanagara": 0.05607476635514018
    }
  },
  "577": {
    "paragraph": "వీటిలో దాదాపు సగం కన్నడలో ఉన్నాయి. మిగిలినవి తెలుగు తమిళం సంస్కృత భాషలలో ఉన్నాయి. వ శతాబ్దం నాటికి ద్విభాషా శాసనాలు ఆదరణ కోల్పోయాయి. హంపి పెనుగొండ తిరుపతిలలో ముద్రించబడిన నాణేలు దేవనాగరి కన్నడ తెలుగు లిపిని కలిగివుండేవి.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.02727272727272727,
    "all_scores": {
      "Vijayanagara": 0.02727272727272727
    }
  },
  "579": {
    "paragraph": "కన్నడ తెలుగు శాసనాలను భారత పురావస్తు శాఖ చరిత్రకారులు అధ్యయనం చేసి భద్రపరిచారు. సాహిత్యం విజయనగర సామ్రాజ్యం యొక్క పాలనలో కవులు పండితులు తత్వవేత్తలు ప్రధానంగా కన్నడ తెలుగు సంస్కృతం తమిళం వంటి భాషలలో రచనలు చేసారు వారు ముఖ్యంగా మతం జీవిత చరిత్ర ప్రబంధ కల్పన సంగీతం వ్యాకరణం కవిత్వం ఔషధం గణితం వంటి అంశాల మీద రచనలు చేశారు. కన్నడ తెలుగు భాషలు సామ్రాజ్యంలో ముఖ్యమైన భాషలుగా ఆస్థాన భాషలుగా ఉండేవి తెలుగు భాష ి విజయనగర తులువ అరవీడు రాజుల పాలనలో మరింత సాంస్కృతిక ప్రాముఖ్యతను పొందింది. విజయనగర సామ్రాజ్యంలో తెలుగు ఒక ప్రసిద్ధ సాహిత్య మాధ్యమంగా ఉండేది శ్రీ కృష్ణదేవరాయల ఆధ్వర్యంలో తెలుగు సాహిత్య అభివృద్ధి తారాస్థాయికి చేరుకుంది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.06058158319870759,
    "all_scores": {
      "Vijayanagara": 0.06058158319870759
    }
  },
  "580": {
    "paragraph": "చాలా సంస్కృత రచనలు వేదాలపై లేదా రామాయణ మహాభారత ఇతిహాసాలపై వివరణ రూపంలో ఉండేవి. ఇవి సాయన విద్యారణ్య వంటి ప్రసిద్ధ కవులచే వ్రాయబడ్డాయి వీరి వ్యాఖ్యానాలు ఇతర ప్రత్యర్థ హిందూ తత్వాల కంటే అద్వైత తత్వశాస్త్రం యొక్క ఔన్నత్యాన్ని ప్రస్తావించాయి. ఇతర రచయితలు ఉడిపి క్రమానికి చెందిన ప్రసిద్ధ ద్వైత సిద్ధాంత సాధువులు ఉదాహరణకు జయతీర్థ అతని రచనలకు తికాచార్య అను బిరుదు పొందారు వ్యాసతీర్థ అద్వైత తత్వాన్ని పూర్వ తర్కవేత్తల తీర్మానాలను ఖండించారు వాదిరాజతీర్థ శ్రీపాదరాయలు ఇద్దరూ ఆది శంకరాచార్యుల వారి విశ్వాసాలను విమర్శించారు . వీరు కాకుండా మరి కొందరు ప్రముఖ సంస్కృత పండితులు విజయనగర రాజుల వారి సామంత రాజుల ఆస్థానాలను అలంకరించారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.03414634146341464,
    "all_scores": {
      "Vijayanagara": 0.03414634146341464
    }
  },
  "581": {
    "paragraph": "రాజకుటుంబానికి చెందిన కొందరు వ్యక్తులు కూడా కొన్ని రచనలు చేశారు ఉదాహరణకు శ్రీ కృష్ణదేవరాయల వారు జాంబవతి కళ్యాణం ఉషాపరిణయం యువరాణి గంగాదేవి గారు ఈమే బుక్క రాయలు గారి కోడలు మధుర విజయం వంటి ముఖ్యమైన రచనలను చేసారు. మధుర విజయం రచనను వీరకంపరాయ చరిత అని కూడా పిలుస్తారు దీనిలో మధురై సుల్తానేట్ ను విజయనగర సామ్రాజ్యం జయించడం గురించి వివరించారు. విజయనగర కవి అయిన మంజరాజు కన్నడలో లిఖించిన కవితా శాసనం. హరిదాసులు బ్రాహ్మణలు వీరశైవుల లింగాయతత్వం సాహిత్యం ద్వారా ప్రాముఖ్యత పొందిన వైష్ణవ భక్తి ఉద్యమానికి మద్దతునిస్తూ సామ్రాజ్యంలోని కన్నడ కవులు పండితులు ముఖ్యమైన రచనలను రూపొందించారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.04210526315789474,
    "all_scores": {
      "Vijayanagara": 0.04210526315789474
    }
  },
  "584": {
    "paragraph": "తెలుగు సాహిత్యంలో నిష్ణాతుడైన శ్రీ కృష్ణదేవరాయలు ప్రసిద్ధ ఆముక్తమాల్యదను రచించాడు. ఆముక్తమాల్యద శ్రీరంగంలో తమిళ ఆళ్వార్ల కవి అయిన ఆండాళ్ పెరియాళ్వార్ కుమార్తె తో విష్ణువు వివాహం జరిగిన కథను వివరిస్తుంది. శ్రీ కృష్ణదేవరాయల ఆస్థానంలో అష్టదిగ్గజాలుగా పిలవబడే ఎనిమిది మంది ప్రసిద్ధ సాహిత్య పండితులు రాయల సభకు మూల స్తంభాలుగా పరిగణించబడ్డారు. వారిలో అత్యంత ప్రసిద్ధులు ఆంధ్రకవితాపితామహడు తెలుగు కవిత్వ పితామహుడు అల్లసాని పెద్దన అలాగే అనేక ప్రముఖ రచనలను రచించిన ఆస్థాన కవి తెనాలి రామకృష్ణుడు ఉన్నారు.",
    "kingdoms": [
      "Vijayanagara",
      "Satavahana"
    ],
    "confidence": 0.03955375253549696,
    "all_scores": {
      "Vijayanagara": 0.03955375253549696,
      "Satavahana": 0.02434077079107505
    }
  },
  "586": {
    "paragraph": "ఈ కాలంలో తమిళ భాషా సాహిత్య అభివృద్ధి సామంత రాజులైన పాండ్యులు పాలించబడిన ప్రాంతాల నుండి వచ్చినప్పటికీ కొంతమంది కవులను విజయనగర రాజులు కూడా చేరదీసారు. స్వరూపానంద దేశికర్ అద్వైత తత్వశాస్త్రంపై శ్లోకాల సంకలనమైన శివప్రకాశప్పెరుండిరట్టును రచించారు. అతని శిష్యుడైన తట్టువరాయర్ కురుండిరట్టు అనే ఒక చిన్న సంకలనాన్ని రచించాడు. శ్రీ కృష్ణదేవరాయలు తమిళ వైష్ణవ కవి హరిదాసును పోషించాడు అతని ఇరుసమయ విలక్కం అప్పటి రెండు ముఖ్య హిందూ వ్యవస్థలలో వైష్ణవ వ్యవస్థకు ప్రాధాన్యతనిచ్చింది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.043642241379310345,
    "all_scores": {
      "Vijayanagara": 0.043642241379310345
    }
  },
  "588": {
    "paragraph": "నిర్మాణకళ షిమోగా జిల్లా ఇక్కేరి అఘోరేశ్వర ఆలయంలోని యాలి స్తంభాలు. విజయనగర నిర్మాణకళ చాళుక్య హొయసల పాండ్య చోళ నిర్మాణ శైలుల యొక్క కలయిక ఇవి మధ్య శతాబ్దాలలో అభివృద్ధి చెందాయి. విజయనగర సామ్రాజ్యం అంతరించిన తరువాత కూడా నాటి శిల్పకళ నిర్మాణకళ చిత్రలేఖనం తరువాతి కాలం నాటి కళల అభివృద్ధిని ప్రభావితం చేసింది. వీరి నిర్మాణ శైలిలో బాగా పేరు పొందినవి అతి సుందరమైన స్తంభాలతో కూడిన కళ్యాణమండపాలు వసంతమండపాలు స్తంభాల మందిరాలు రాయగోపురం.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.05673758865248227,
    "all_scores": {
      "Vijayanagara": 0.05673758865248227,
      "Chola": 0.014184397163120567
    }
  },
  "589": {
    "paragraph": "నిరంతర దండయాత్రలతో రాజ్యానికి ముప్పు ఉన్నందున నిర్మాణాలలో స్థానికంగా లభించే గట్టి గ్రానైట్ ను ఉపయోగించేవారు. దక్షిణ భారతదేశం అంతటా విజయనగర నిర్మాణాలు వ్యాపించి ఉన్నప్పటికి అవేవి యునెస్కో ప్ర పంచ వార స త్వ సంప దైన విజయనగర రాజధానిలో విస్తారంగా నిర్మింపబడిన కట్టడాలకు సాటిరావు. మొదట వ శతాబ్దంలో రాజులు వేసర వేసెర లేదా దక్కన్ శైలి కట్టడాలను నిర్మించడం కొనసాగించారు అయితే తర్వాత వారి ఆచార అవసరాల మేరకు ద్రవిడ శైలి నిర్మాణాలు చేశారు. బుక్క రాయల ప్రసన్న విరూపాక్ష దేవాలయం భూగర్భ దేవాలయం దేవరాయల హజారా రామ దేవాలయం దక్కన్ శైలి నిర్మాణాలకు ఉదాహరణలు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.04313543599257885,
    "all_scores": {
      "Vijayanagara": 0.04313543599257885
    }
  },
  "590": {
    "paragraph": "స్తంభాల మీద వైవిధ్యమైన సంక్లిష్టమైన అలంకరణ వారి నైపుణ్యానికి చిహ్నం. హంపి లోని విఠ్ఠల దేవాలయం వారి స్తంభాల కళ్యాణమండప శైలికి అత్యుత్తమ ఉత్తమ ఉదాహరణ అయినప్పటికీ హజారా రామస్వామి ఆలయం వారి నైపుణ్యానికి నిరాడంబరమైన నిర్మాణానికి ఒక చక్కటి ఉదాహరణ. చాళుక్యులు అభివృద్ధి చేసిన సరళమైన నిర్మలమైన నిర్మాణ కళను అనుసరించడం వారి నిర్మాణలలో కనిపించే అంశం. విజయనగర నిర్మాణ కళకు గొప్ప నమూనా అయిన విఠ్ఠల దేవాలయం తుళువ రాజుల పాలనలో పూర్తి చేయడానికి అనేక దశాబ్దాలు పట్టింది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.029735682819383262,
    "all_scores": {
      "Vijayanagara": 0.029735682819383262
    }
  },
  "591": {
    "paragraph": "హంపి లోని మార్కెట్ స్థలం. కృష్ణ దేవాలయం సమీపంలో ఉన్న పవిత్ర ట్యాంక్. హంపిలోని విఠ్ఠల దేవాలయంలో ఉన్న రాతి దేవాలయ రథం. విజయనగర శైలిలో మరొక ముఖ్యమైన అంశం ఏకశిలా శిల్పకళ.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.09939759036144578,
    "all_scores": {
      "Vijayanagara": 0.09939759036144578
    }
  },
  "592": {
    "paragraph": "హంపిలోని శశివేకాలు కన్నడలో ఆవాలు అని అర్థం గణేశుడు కడలేకలు కన్నడలో వేరుశెనగ అని అర్థం గణేశుడు కర్కాళ వేణూరులోని గొమ్మటేశ్వర బాహుబలి ఏకశిలలు లేపాక్షిలోని నంది ఎద్దు వంటి పెద్ద ఏకశిలా విగ్రహాలు విజయనగర శిల్ప కళా నైపుణ్యానికి తార్కాణం. కర్ణాటకలోని కోలార్ కనకగిరి శృంగేరి ఇతర పట్టణాలలోని విజయనగర దేవాలయాలు ఆంధ్రప్రదేశ్ లోని తాడపత్రి లేపాక్షి అహోబిలం తిరుమల వేంకటేశ్వర స్వామి ఆలయం శ్రీకాళహస్తి ఆలయాలు తమిళనాడులోని వెల్లూరు కుంభకోణం కంచి శ్రీరంగం ఆలయాలు ఈ శైలికి ఉదాహరణలు. విజయనగర కళలో చిత్రలేఖనం ముఖ్యమైన కళ హంపిలోని విరూపాక్ష ఆలయంలోని దశావతారాలు గిరిజాకళ్యాణంకు పార్వతి వివాహం శివుని భార్య సంబంధించిన చిత్రాలు లేపాక్షిలోని వీరభద్ర ఆలయంలో శివపురాణ కుడ్యచిత్రాలు శివుని కథలు కంచిలోని కామాక్షి వరదరాజ ఆలయంలో ఆలయ గోడలపై ఉన్న చిత్రాలు ఆనాటి కళా నైపుణ్యానికి ఉదాహరణలు. ఈ దక్షిణ భారత శైలుల కలయిక వలన పూర్వ శతాబ్దాల నిర్మాణాల కంటే విజయనగర నిర్మాణ కళ గొప్పగా కనబడుతుంది దీనికి ముఖ్య కారణం శిల్పకళతో పాటు వివిధ హంగులతో ఈ శిల్పాలను నిర్మాణాలను మునపటికంటే అందంగా అలంకరించడం.",
    "kingdoms": [
      "Vijayanagara",
      "Chola"
    ],
    "confidence": 0.017223382045929016,
    "all_scores": {
      "Vijayanagara": 0.017223382045929016,
      "Chola": 0.012526096033402922
    }
  },
  "593": {
    "paragraph": "విజయనగర నగరాలలో ఇస్లామిక్ లక్షణాలు కలిగిన అనేక లౌకిక నిర్మాణాల ఉనికి కాస్మోపాలిటనిజాన్ని విశ్వమానవత్వం తెలియజేస్తుంది. రాజకీయ చరిత్ర విజయనగర సామ్రాజ్యానికి దక్కన్ సుల్తానేట్ లకు మధ్య సంఘర్షణపై దృష్టి కేంద్రీకరించినప్పటికీ నిర్మాణ శైలిలో పరస్పర సంకర్షణ ప్రతిబింబిస్తుంది. ఈ ప్రభావాలను చూపించే అనేక శిలా తోరణాలు డోమ్ రూపంలో ఉన్న గోపురాలు బాండాగారాలు ఉన్నాయి. ఛత్రి శాలలు టవర్లు వంటి నిర్మాణాల ఒకే దగ్గర కేంద్రీకరమవ్వడం చూస్తే వీటిని రాజులు ఉపయోగించే వారని అర్ధమవుతుంది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.044967880085653104,
    "all_scores": {
      "Vijayanagara": 0.044967880085653104
    }
  },
  "595": {
    "paragraph": "దేవాలయ ప్రాంగణం యొక్క వైమానిక చిత్రం. మీనాక్షి దేవాలయం యొక్క వైమానిక దృశ్యం దక్షిణ గోపురం పై నుండి ఉత్తరం వైపుకు. ఈ ఆలయాన్ని విజయనగర సామ్రాజ్య నాయక్ లు పునర్నిర్మించారు. పతన దశ తళ్ళికోట యుద్ధానంతర దశను విజయనగర సామ్రాజ్య పతనదశగా చెప్పుకోవచ్చు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.08677685950413223,
    "all_scores": {
      "Vijayanagara": 0.08677685950413223
    }
  },
  "596": {
    "paragraph": "లో తళ్లికోట యుద్ధం జరిగి యుద్ధంలో విజయనగర సామ్రాజ్యం పూర్తిగా ఓటమిచెందిన తర్వాత తిరుమల దేవరాయలు నామమాత్ర పరిపాలకుడైన సదాశివరాయలను తీసుకుని విజయనగర ఖజానాను ఎత్తుకుని పెనుకొండకు పారిపోయారు. విజయనగరాన్ని పాదుషాలు నేలమట్టం చేసి వదిలిపోయాకా తిరుమల దేవరాయలు ఆ రాజధానిని బాగుచేసుకుని పరిపాలించేందుకు మూడేళ్ళపాటు ప్రయత్నించారు. శ్మశానంలా తయారైన ఈ రాజధానిని తిరిగి ఏలుకోలేక పెనుకొండకు తిరిగివచ్చారు. అంతటితో విజయనగర సామ్రాజ్యపు రాజధానిగా విద్యానగరం ముగిసిపోయింది.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.05176211453744493,
    "all_scores": {
      "Vijayanagara": 0.05176211453744493
    }
  },
  "597": {
    "paragraph": "ఆపైన కొన్నేళ్ళు పెనుకొండ మిగిలిన సంవత్సరాలు చంద్రగిరిలను రాజధానులుగా చేసుకుని పాలించారు. తళ్ళికోట ఓటమి తర్వాత రాజ్యభాగాలు తగ్గిపోనారంభించాయి. తిరుమలదేవరాయలు తన ముగ్గురు కుమారులను మూడు ప్రాంతాలకు ప్రతినిధులుగా పరిపాలింపజేశారు. పెద్దకుమారుడైన రామరాయలు కన్నడప్రాంతాలను శ్రీరంగపట్నం రాజధానిగా పరిపాలించారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.039735099337748346,
    "all_scores": {
      "Vijayanagara": 0.039735099337748346
    }
  },
  "598": {
    "paragraph": "రెండో కుమారుడు శ్రీరంగ దేవరాయలు పెనుగొండను రాజధానిగా చేసుకుని తెలుగు ప్రాంతాలను పరిపాలించారు. మూడో కుమారుడు వేంకటపతి దేవరాయలు మొదట చంద్రగిరిని రాజధానిగా చేసుకుని తమిళ ప్రాంతాలు పాలించేవారు. విజయనగర సామ్రాజ్యానికి చక్రవర్తిగా శ్రీరంగదేవరాయలు తెలుగు ప్రాంతాల విషయంలో చాలా ప్రయత్నాలు చేసి వైభవాన్ని పునరుద్ధరించేందుకు విఫలయత్నాలు చేశారు. బీజాపూరు సుల్తానులతో కొన్ని యుద్ధాల్లో గెలిచి కొన్ని ఓడిపోయారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.052763819095477386,
    "all_scores": {
      "Vijayanagara": 0.052763819095477386
    }
  },
  "599": {
    "paragraph": "ఆయనకు పుత్రసంతానం లేకపోవడంతో చిన్నతమ్ముడు చంద్రగిరి పాలకుడు అయిన వేంకటపతి దేవరాయలకు రాజ్యాన్నిచ్చారు. ఆయన పాలనకాలంలోనే బ్రిటీషు వారికి మద్రాసు పట్టణం ఏర్పాటు చేయటానికి భూమి మంజూరు చేశారు. కొంతకాలం పాటు పెనుకొండను రాజధానిగా చేసుకుని అన్నగారు ఇచ్చిన సామ్రాజ్యాన్ని పాలించినా ఆపైన మాత్రం రాజధానిని తన పట్టణమైన చంద్రగిరికే మార్చుకున్నారు. ఆయన విజయనగర సామ్రాజ్యపు ఆఖరి గొప్ప చక్రవర్తిగా పేరొందారు.",
    "kingdoms": [
      "Vijayanagara"
    ],
    "confidence": 0.05357142857142857,
    "all_scores": {
      "Vijayanagara": 0.05357142857142857
    }
  },
  "601": {
    "paragraph": "వీర విజయ బుక్క రాయలు ఐదవ దేవ రాయలు త్రయంబక్ రాయలు రెండవ మల్లికార్జున రాయలు రెండవ విరూపాక్ష రాయలు రాజశేఖర రాయలు తేదీలు సందేహాస్పదం మొదటి విరూపాక్ష రాయలు తేదీలు సందేహాస్పదం ప్రౌఢదేవ రాయలు తేదీలు సందేహాస్పదం రాజశేఖర తేదీలు సందేహాస్పదం ముడవ విరూపాక్ష రాయలు తేదీలు సందేహాస్పదం రాజశేఖర తేదీలు సందేహాస్పదం సాళువ వంశం నరసింహ అచ్చుత దెవ రాయలు తుళువ వంశం నరస వీర నరసింహ ? శ్రీ కృష్ణదేవరాయలు అచ్యుత దేవరాయలు సదాశివరాయలు నామమాత్రపు రాజు రామరాయలు పట్టాభిషిక్తుడు కాదు తిరుమల రాయలు పట్టాభిషిక్తుడు కాదు తిరుమల పట్టాభిషిక్తుడు రెండవ రంగరాయలు మొదటి వెంకటాపతి రాయలు ఆరవీడు తేదీలు సందేహాస్పదం కేవలం శాసనాల ఆధారంగా సేకరించిన సమాచారం రాజుల్లో కిందివారు ఉన్నారు. ప్రతిపేరుతోను ఒకరికంటే ఎక్కువమంది రాజులు ఉన్నారు. కాలం నుండి గా తెలిసిన వరకు రంగ దేవరాయ రామ దేవరాయ వెంకట దేవరాయ రంగ దేవరాయ ఇవి కూడా చూడండి విజయనగర వంశస్తుల వంశవృక్షాలు విజయ నగర రాజుల కాలంనాటి పన్నులు విజయ నగర రాజుల కాలంనాటి ఆర్ధిక పరిస్తితులు విజయనగర సామ్రాజ్యంలో మత వ్యవస్థ విజయ నగర రాజుల కాలంనాటి సైనిక స్థితి విజయ నగర రాజులు పరిపాలనా కాలాన్ని అనుసరించి విజయనగర సామ్రాజ్యంలో వస్త్రధారణ విజయనగర చరిత్ర వికీ బుక్స్ లో భారత జాతీయవాదం కన్నడ లో విజయనగర సాహిత్యం రాణి చెన్నభైరదేవి చోళ సామ్రాజ్యం చరిత్ర పరికరాల పెట్టె స్వరూపం దాచు పాఠ్యం చిన్న ప్రామాణిక పెద్ద వెడల్పు ప్రామాణిక వెడల్పుగా రంగు ఆటోమాటిగ్గా ప్రకాశవంతంగా చీకటిగా చోళ సామ్రాజ్యం సా.శ.పూ చోళ సామ్రాజ్యం జండా చోళ సామ్రాజ్యం సా.శ.",
    "kingdoms": [
      "Vijayanagara",
      "Chola"
    ],
    "confidence": 0.01827430293896006,
    "all_scores": {
      "Vijayanagara": 0.01827430293896006,
      "Chola": 0.010173323285606632
    }
  },
  "602": {
    "paragraph": "లో ఉత్థాన స్థితిలో నీలిరంగు గీత వ్యాపార మార్గాలు చోళ సామ్రాజ్యం సా.శ. లో ఉత్థాన స్థితిలో నీలిరంగు గీత వ్యాపార మార్గాలు రాజధాని మొదటి చోళులు పూంపుహార్ ఉరయూర్ మధ్యయుగ చోళులు పుజైయారాయి తంజావూరు గంగైకొండ చోళపురం సామాన్య భాషలు తమిళం మతం హిందూ మతము ప్రభుత్వం రాజరికం రాజు విజయాలయ చోళుడు మూడవ రాజేంద్ర చోళుడు చారిత్రిక కాలం మధ్య యుగం స్థాపన సా.శ.పూ మధ్యయుగ చోళుల ఆవిర్భావం. పతనం పాండ్యులు హోయసల జావా లోని ప్రంబానన్ వద్ద గల దేవాలయ సమూహం ద్రవిడ సంస్కృతిని సూచిస్తుంది. తంజావూరు బృహదీశ్వరాలయం లోని రాజరాజ చోళుని విగ్రహం.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.033268101761252444,
    "all_scores": {
      "Chola": 0.033268101761252444
    }
  },
  "603": {
    "paragraph": "చోళ సామ్రాజ్యం తమిళ భాష వ శతాబ్దం వరకు ప్రధానంగా దక్షిణ భారత దేశాన్ని పరిపాలించిన తమిళ సామ్రాజ్యం. ఈ సామ్రాజ్యం కావేరి నది పరీవాహక ప్రాంతంలో పుట్టి దక్షిణ భారతదేశం అంతా విస్తరించింది. కరికాల చోళుడు రాజరాజ చోళుడు రాజేంద్ర చోళుడు కుళోత్తుంగ చోళుడు చోళ రాజులలో ప్రముఖులు. చోళ సామ్రాజ్యం శతాబ్దంలో చాలా ఉచ్ఛస్థితిని పొందింది.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.04205607476635514,
    "all_scores": {
      "Chola": 0.04205607476635514
    }
  },
  "604": {
    "paragraph": "మొదటి రాజరాజ చోళుడు అతని కుమారుడు రాజేంద్ర చోళుడు కాలంలో చోళ సామ్రాజ్యం ఆసియా ఖండంలోనే సైనికంగా ఆర్థికంగా సాంస్కృతికంగా చాలా అభివృద్ధి పొందింది. చోళ సామ్రాజ్యం దక్షిణాన మాల్దీవులు నుండి ఉత్తరాన ఇప్పటి ఆంధ్ర ప్రదేశ్ లోని గోదావరి పరీవాహక ప్రాంతం వరకు విస్తరించింది. రాజరాజ చోళ భారతదేశంలోని దక్షిణ ద్వీపకల్ప భాగాన్ని శ్రీలంకలోని కొన్ని భాగాలు మాల్దీవులుకి తమ సామ్రాజ్యాన్ని విస్తరించారు. రాజేంద్ర చోళ ఉత్తర భారతదేశం మీద విజయ యాత్ర చేసి పాటలీపుత్రంని పరిపాలిస్తున్న పాల రాజు మహిపాలుడిని జయించాడు.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.0274390243902439,
    "all_scores": {
      "Chola": 0.0274390243902439
    }
  },
  "605": {
    "paragraph": "తరువాత మలయా ద్వీపసమూహం మలయ్ ఆర్కిపెలగో వరకు కూడా చోళ రాజులు జైత్ర యాత్రలు జరిపారు. వ శతాబ్దంకి పాండ్య రాజులు వ శతాబ్ధానికి హోయసల రాజులు వారి వారి సామ్రాజ్యాలు స్థాపించడంతో చోళుల ఆధిపత్యం క్షీణించింది. ం చోళులను చోడా అని కూడా పిలుస్తారు. వారి మూలానికి సంబంధించి చాలా తక్కువ సమాచారం అందుబాటులో ఉంది.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.020202020202020204,
    "all_scores": {
      "Chola": 0.020202020202020204
    }
  },
  "606": {
    "paragraph": "పురాతన తమిళ సాహిత్యంలో శాసనాలలో పేర్కొన్నట్లు దాని ప్రాచీనత స్పష్టంగా తెలుస్తుంది. తరువాత మధ్యయుగ చోళులు కూడా సుదీర్ఘమైన పురాతన వంశానికి చెందినవారుగా పేర్కొనబడ్డారు. సంగం సాహిత్యంలోని ప్రస్తావనలు సా.శ. చోళుల గురించి ప్రస్తావించబడింది.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.05128205128205129,
    "all_scores": {
      "Chola": 0.05128205128205129
    }
  },
  "607": {
    "paragraph": "రాజవంశం తొలి రాజులు సా.శ. కంటే పూర్వం ఉన్నట్లు సూచిస్తున్నాయి. క్రీస్తుపూర్వం వ శతాబ్దానికి చెందిన అశోకుడి శాసనాలు చోళలను దక్షిణాదిలో ఉన్న పొరుగు దేశాలలో ఒకటిగా పేర్కొన్నారు. సాధారణంగా ప్రజాభిప్రాయంలో పాలక కుటుంబం ప్రాచీనత చోళ చేరా పాండ్య ఒకేలా భావించబడుతుంది.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.023076923076923078,
    "all_scores": {
      "Chola": 0.023076923076923078
    }
  },
  "608": {
    "paragraph": "పరిమెలాజగరు ఇలా అన్నాడు పురాతన వంశీయులు చోళులు పాండ్యాలు చేరాల వంటివి ఉన్న ప్రజల స్వచ్ఛంద సంస్థ వారి శక్తి క్షీణించినప్పటికీ సదా ఉదారంగా ఉంటాయి . సాధారణంగా చోళులకు కిల్లి వల్లవను సెంబియాను సెన్నీ వంటి పేర్లు ఇప్పటికీ వాడుకలో ఉన్నాయి. కిల్లి బహుశా తమిళ కిళ్ నుండి వచ్చింది. అంటే త్రవ్వడం లేదా విడదీయడం.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.02491694352159468,
    "all_scores": {
      "Chola": 0.02491694352159468
    }
  },
  "609": {
    "paragraph": "త్రవ్వినవాడు లేదా భూమి కార్మికుడు ఆలోచనను తెలియజేస్తుంది. ఈ పదం తరచుగా నేడున్కిల్లి నలన్కిల్లి వంటి చోళ పేర్లలో ఇది అంతర్భాగంగా ఏర్పడుతుంది. కాని తరువాతి కాలంలో ఇది దాదాపుగా ఉపయోగం నుండి తప్పుకుంటుంది. వల్లవన్ చాలావరకు వళం తో అనుసంధానించబడి ఉంది.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.024390243902439025,
    "all_scores": {
      "Chola": 0.024390243902439025
    }
  },
  "610": {
    "paragraph": "సంతానోత్పత్తి సారవంతమైన దేశం యజమాని లేదా పాలకుడు. సెంబియాను సాధారణంగా షిబి వంశస్థుడు అని అర్ధం ఒక పురాణ వీరుడు చోళ పురాణాలలో పావురాన్ని రక్షించడంలో ఆత్మబలిదానం చేయడం. బౌద్ధమతం జాతక కథలలో సిబి జాతక అంశాన్ని ఏర్పరుస్తుంది. తమిళ నిఘంటువులో చోళ అంటే సోజి లేదా సాయి అంటే పాండ్యా లేదా పాత దేశం తరహాలో కొత్తగా ఏర్పడిన రాజ్యాన్ని సూచిస్తుంది.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.017964071856287425,
    "all_scores": {
      "Chola": 0.017964071856287425
    }
  },
  "611": {
    "paragraph": "తమిళంలో సెన్నీ అంటే తల. వ శతాబ్దానికి ముందు చోళుల వ్రాతపూర్వక ఆధారాలు చాలా తక్కువ. దేవాలయాల మీద శాసనాలు సహా చారిత్రక రికార్డులు ఉన్నాయి. గత సంవత్సరాలలో చరిత్రకారులు పురాతన తమిళ సంగం సాహిత్యం మౌఖిక సంప్రదాయాలు మత గ్రంథాలు ఆలయాలు రాగి పలక శాసనాలు వంటి వివిధ వనరుల నుండి ఈ విషయం గురించి గణనీయమైన జ్ఞానాన్ని పొందారు.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.019230769230769232,
    "all_scores": {
      "Chola": 0.019230769230769232
    }
  },
  "612": {
    "paragraph": "చోళుల అందుబాటులో ఉన్న సమాచారానికి సంగం కాలం తమిళ సాహిత్యం ప్రధాన మూలం. పెరిప్లసు ఆఫ్ ది ఎరిత్రోయిను సీ స్వల్పకాలం తరువాత టోలెమీ రచనలో చోళ దేశం దాని పట్టణాలు ఓడరేవులు వాణిజ్యం గురించి కూడా సంక్షిప్త నోటీసులు ఉన్నాయి. క్రీస్తుపూర్వం వ శతాబ్దంలో వ్రాసిన మహావంశ అనే బౌద్ధ గ్రంథం క్రీస్తుపూర్వం వ శతాబ్దంలో సిలోను చోళ నివాసుల మధ్య అనేక విభేదాలను వివరిస్తుంది. అశోక స్తంభం క్రీ.పూ.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.016,
    "all_scores": {
      "Chola": 0.016
    }
  },
  "613": {
    "paragraph": "చెక్కినవి శాసనాలలో చోళుల గురించిన ప్రస్తావన ఉంది. అశోకుడికి లోబడి ఉండకపోయినా ఇక్కడ రాజ్యాలలో చోళులకు స్నేహపూర్వక సంబంధాలు ఉన్నాయి. చరిత్ర చోళుల చరిత్ర నాలుగు కాలాలుగా వర్గీకరించబడింది సంగం సాహిత్యంలో కాల చోళుల తరువాత కొంతకాలం వ్యవధిలో చోళుల పతనం తరువాత కొంతకాల వ్యవధిలో అజ్ఞాతంగా ఉన్న చోళవంశాలు తిరిగి విజయాలయా నాయకత్వంలో మధ్యకాల చోళులుగా విజయాలయా రాజవంశంగా అభివృద్ధి చెందింది. వ శతాబ్దం మద్యకాలంలో కులోత్తుంగచోళ రాజవంశం ి చోళరాజవంశంగా పాలన సాగించింది.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.033185840707964605,
    "all_scores": {
      "Chola": 0.033185840707964605
    }
  },
  "614": {
    "paragraph": "కాల చోళులు సంఘం సాహిత్యంలో స్పష్టమైన ఆధారాలు ప్రస్తావించబడ్డాయి. ఈ సాహిత్యం శతాబ్దాలకు చెందినదని చరిత్రకారులు అంగీకరిస్తారు. ఈ సాహిత్యం అంతర్గత కాలక్రమం ఇప్పటికీ స్థిరపడలేదు. ప్రస్తుతం ఈ కాల చరిత్రకు అనుసంధానించబడిన ఆధారాలు పొందలేము.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.032188841201716736,
    "all_scores": {
      "Chola": 0.032188841201716736
    }
  },
  "615": {
    "paragraph": "ఇది రాజులు యువరాజుల పేర్లను వారిని కీర్తించిన కవుల పేర్లను నమోదు చేస్తుంది. సంగం సాహిత్యం పౌరాణిక చోళ రాజుల గురించి ఇతిహాసాలను కూడా నమోదు చేస్తుంది. ఈ పురాణాలు అగస్త్య ఋషి సమకాలీనుడిగా భావించే చోళ రాజు కాంతమ గురించి మాట్లాడుతుంటాయి. ఆయన భక్తి కవేరి నదిని ఉనికిలోకి తెచ్చింది.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.02181818181818182,
    "all_scores": {
      "Chola": 0.02181818181818182
    }
  },
  "616": {
    "paragraph": "మూలం అవసరం సంగకాల సాహిత్యంలో ప్రధానంగా కరికాళచోళుడు కోసెంగన్నను. ఒకరితో ఒకరు వారసత్వ క్రమాన్ని పరిష్కరించడానికి అదే కాలంలో అనేకమంది యువరాజులతో వారి సంబంధాలను పరిష్కరించుకోవటానికి కచ్చితమైన మార్గాలు లేవు. ఉరూరు ప్రస్తుత తిరుచిరాపల్లిలో ఒక భాగం వారి పురాతనమైనది రాజధాని. చోళ రాజధానిగా కావేరిపట్టినం కూడా పనిచేసింది.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.019169329073482427,
    "all_scores": {
      "Chola": 0.019169329073482427
    }
  },
  "617": {
    "paragraph": "ఎలలను అని పిలువబడే చోళ యువరాజు తమిళ జాతీయుడైన సాహసికుడు శ్రీలంక ద్వీపం మీద దాడి చేసి క్రీస్తుపూర్వం లో మైసూరు సైన్యం సహాయంతో జయించాడని మహావంశ పేర్కొన్నాడు. సంగకాలం సంగం యుగం సి. నుండి పాండ్యులు పల్లవులు తమిళ దేశంలో ఆధిపత్యం సాధించిన మూడు శతాబ్దాల పరివర్తన కాలం గురించి పెద్దగా సమాచారం లేదు. ఒక అస్పష్టమైన రాజవంశం అయిన కలాభ్రాసు తమిళ దేశం మీద దాడి చేసి అక్కడ ఉనికిలో ఉన్న రాజ్యాలను స్థానభ్రంశం చేసి ఆ సమయంలో పాలించారు.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.014388489208633094,
    "all_scores": {
      "Chola": 0.014388489208633094
    }
  },
  "618": {
    "paragraph": "వ శతాబ్దంలో పల్లవ రాజవంశం పాండ్య రాజవంశం వారు స్థానభ్రంశం చెందారు. వ శతాబ్దం రెండవ త్రైమాసికంలో విజయాలయ ప్రవేశం వరకు మూడు శతాబ్దాలలో చోళుల గురించి చాలా తక్కువగా సమాచారం లభిస్తుంది. తంజావూరు పరిసరాలలో ఉన్న శాసనాల ఆధారంగా ఈ రాజ్యాన్ని ముతరైయారులు మూడు శతాబ్దాలుగా పరిపాలించారు. క్రీస్తుశకం మధ్య ఇలంగో ముతరైయారు నుండి తంజావూరును స్వాధీనం చేసుకున్న విజయాలయ చోళ వారి పాలనను ముగించారు.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.03562005277044855,
    "all_scores": {
      "Chola": 0.03562005277044855
    }
  },
  "619": {
    "paragraph": "ఎపిగ్రఫీ సాహిత్యం ఈ సుదీర్ఘ విరామంలో ఈ రాజుల శ్రేణి మీద వచ్చిన పరివర్తనల కొన్ని సంగ్రహావలోకనాలను అందిస్తుంది. చోళుల శక్తి దాని కనిష్ఠ స్థాయికి పడిపోయిన సమయంలో ఉత్తర దక్షిణప్రాంతాలలో పాండ్యులు పల్లవుల అభివృద్ధి చెందారు. ఈ రాజవంశం వారి మరింత విజయవంతమైన ప్రత్యర్థుల కింద ఆశ్రయం పొంది పోషణను పొందవలసిన అవసరం ఏర్పడింది. ఉరైయూరు పరిసరాలలో క్షీణించిన భూభాగం మీద స్వల్ప సామర్థ్యంతో చోళులు పాలన కొనసాగించారు.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.018796992481203006,
    "all_scores": {
      "Chola": 0.018796992481203006
    }
  },
  "620": {
    "paragraph": "అధికారాలు తగ్గి ఉన్నప్పటికీ పాండ్యులు పల్లవులు చోళ యువరాణులను వివాహం చేసుకోవడానికి అంగీకరించారు. ఈ కాలంలో అనేక శాసనాలు వారు చోళులతో సాగించిన యుద్ధం గురించి పేర్కొన్నాయి. ప్రభావం శక్తిలో ఈ నష్టం ఉన్నప్పటికీ చోళులు వారి పాత రాజధాని ఉరైయూరు చుట్టూ ఉన్న విజయాలయ భూభాగం మొత్తం పట్టును కోల్పోయే అవకాశం లేదు. ఆయన ఆ ప్రాంతానికి చెందిన వ్యక్తిగా ప్రశంసలు అందుకున్నాడు.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.033426183844011144,
    "all_scores": {
      "Chola": 0.033426183844011144
    }
  },
  "621": {
    "paragraph": ". వ శతాబ్దంలో ప్రస్తుత ఆంధ్రప్రదేశులో చోళ రాజ్యం అభివృద్ధి చెందింది. ఈ తెలుగు చోళులు వారి సంతతిని సంగం చోళులు గుర్తించినప్పటికీ చోళులతో వారికి సంబంధం ఉందో లేదో తెలియదు. పాండ్యులు పల్లవుల ఆధిపత్య ప్రభావాలకు దూరంగా తమ సొంత రాజ్యాన్ని స్థాపించడానికి పల్లవుల కాలంలో తమిళ చోళుల శాఖ ఉత్తరప్రాంతాలకు వలస వెళ్ళడానికి అవకాశం ఉంది.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.023364485981308407,
    "all_scores": {
      "Chola": 0.023364485981308407
    }
  },
  "622": {
    "paragraph": "కాంచీపురంలో చాలా నెలలు గడిపిన చైనా యాత్రికుడు జువాన్జాంగు సమయంలో ఈ తెలుగు చోళుల గురించి కులీ యా రాజ్యం గురించి వ్రాశారు. రాజరాజ చోళుడు అసలు పేరు అరుమేలి బిరుదు ముమ్మడిచోళ. రాజరాజ చోళుడు ప్రముఖ చోళరాజులలో ఒకడు. స్థానిక స్వపరిపాలనకు సంబంధించి అనేక సంస్కరణలు చేశాడు.",
    "kingdoms": [
      "Chola"
    ],
    "confidence": 0.022813688212927757,
    "all_scores": {
      "Chola": 0.022813688212927757
    }
  }
}